[
  {
    "id": 3470496102,
    "text": "[Kareem Dennis or Lowkey](https://en.wikipedia.org/wiki/Lowkey) said in [this](https://youtu.be/KEUElq-T5TI?si=YLWdpUmpRqa3qOwx&t=255) video:<br />\u003e I condemn the genocidal conditions that created this violence. Every human heartbeat is sacred to me, We don't have a clear picture of what happened on October 7th because unfortunately too much of the media has relied on the Israeli military talking points which are given directly to them. Until you show observers that are able to establish the facts of October 7th, I will not allow the talking points of the Israeli military to become dominant of what happened on that day. The Palestinians are subject to genocidal war, a collective punishment in Gaza is real.<br />",
    "responderId": 262151679,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/KEUElq-T5TI?si=YLWdpUmpRqa3qOwx&start=255"
    }
  },
  {
    "id": 2332417880,
    "text": "[Mohammed Hijab](https://mohammedhijab.com/about-hijab/) said in [this](https://youtu.be/9jBgGY2Ww9Q?si=W-tMmLlE3mmKuRlu&t=130) video:<br />\u003e As a Muslim, I don't believe in the killing of any man or woman or children. That's not despite the religious teachings. That's because of the religious teachings. I condemn not only Hamas but any other entity wherein it's proven that the killing of combatants has been made and therein I condemn any party that kills people or strikes at people where it's more probable than not that it will hit a civilian target I condemn them and that's why I condemn the IDF because when they strike they know that it's more probably than not it's going to hit civilian targets. They know that the majority of civilians or the majority of people who are going to be affected are civilians. We know that from the various operations that have been conducted. We know that because now in Gaza you find that there is a blockage as you know for 17 years but also they are stopping the electricity and water which is a war crime under the Geneva Convention protocol.",
    "responderId": 1232798458,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/9jBgGY2Ww9Q?si=W-tMmLlE3mmKuRlu&start=130"
    }
  },
  {
    "id": 765064705,
    "text": "[Mohammed Hijab](https://mohammedhijab.com/about-hijab/) said in [this](https://youtu.be/9jBgGY2Ww9Q?si=Nr_SGTkL9Sw8hQy-&t=996) video:<br />\u003e How can it be that an occupier is defending itself in the first place? The notion that Israel is defending itself is as absurd as the notion that the rapist is defending itself from the victim. Because Israel is the occupier. An occupier by international law definition means that they are already in an offensive posture. If someone brings you, grabs you, throws you into your bathroom, you in your bathroom are screaming and are eating food and having a good time, one day you come out of your bathroom, you try and fight one of them, then who's defending themselves from who?<br /><br />\u003e If it is the case that it's defending itself against Hamas, is the only way to defend itself against Hamas by dropping bombs in one of the most densely populated areas in the world?",
    "responderId": 1232798458,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/9jBgGY2Ww9Q?si=Nr_SGTkL9Sw8hQy-&start=996"
    }
  },
  {
    "id": 2302604085,
    "text": "[Bassem Youssef](https://en.wikipedia.org/wiki/Bassem_Youssef) said in [this](https://youtu.be/4idQbwsvtUo?si=29FXhNC6f1-ioI9j&t=389) video:<br /><br />\u003e Lets for a minute imagine a world without Hamas. What will this world look like? Let's give this world a name and let's name this world the West Bank. Hamas has absolutely no control in the West Bank and since the beginning of this year only through August, 37 Palestinian kids were killed. No music festival, no paragliding, no Hamas. Since the occupation of the West Bank, 7000 Palestinians have been killed. No music festival, no paragliding, no Hamas. I can go on and on and on and on.",
    "responderId": 3883926909,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/4idQbwsvtUo?si=29FXhNC6f1-ioI9j&start=389"
    }
  },
  {
    "id": 1600904205,
    "text": "[Bassem Youssef](https://en.wikipedia.org/wiki/Bassem_Youssef) said in [this](https://youtu.be/4idQbwsvtUo?si=29FXhNC6f1-ioI9j&t=389) video:<br /><br />\u003e Lets for a minute imagine a world without Hamas. What will this world look like? Let's give this world a name and let's name this world the West Bank. Hamas has absolutely no control in the West Bank and since the beginning of this year only through August, 37 Palestinian kids were killed. No music festival, no paragliding, no Hamas. Since the occupation of the West Bank, 7000 Palestinians have been killed. No music festival, no paragliding, no Hamas. I can go on and on and on and on.",
    "responderId": 3883926909,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/4idQbwsvtUo?si=29FXhNC6f1-ioI9j&start=389"
    }
  },
  {
    "id": 840977546,
    "text": "[Bassem Youssef](https://en.wikipedia.org/wiki/Bassem_Youssef) said in [this](https://youtu.be/4idQbwsvtUo?si=_o7w2_uJPJRVFzZB&t=476) video:<br />\u003e How cute! That's so nice of them! Because with this logic if Russian troops started warning Ukranians before bombing their houses we're cool with Putin, right? I mean, okay Habibi you have warned them, go invade, it's fine, you've done your job. <br />",
    "responderId": 3883926909,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/4idQbwsvtUo?si=_o7w2_uJPJRVFzZB&start=476"
    }
  },
  {
    "id": 2951741429,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) said in [this](https://youtu.be/GvDAra1VFnE?si=uQFKqUorM5O2zXjm&t=159) video:<br /><br />\u003e This very same Hospital, the Baptist Ahly Hospital of Gaza was bombarded only two days before last night by the Israeli air strike and they recognize that. This very same hospital was designated by Israel as a place to be evacuated. This very same hospital the director of it was called by the Israeli occupation authorities asking him to evacuate all patients on mass. I believe the archbishop of Jerusalem when he condemns the Israeli air strike. I don't believe the Israeli mouthpieces and spokespeople, they lie more than they breathe and the record is very clear.",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/GvDAra1VFnE?si=uQFKqUorM5O2zXjm&start=159"
    }
  },
  {
    "id": 524142859,
    "text": "In [this](https://www.youtube.com/watch?v=rGVgjS98OsU) video, Vox website mentions the following along with sources:<br />* Around the time that Israelis celebrate Independence Day, Palestinians commemorate “The Nakba,” or “The Catastrophe.” The Nakba was a series of events, centered around 1948, that expelled hundreds of thousands Palestinians from their homeland and killed thousands. The Nakba isn’t the beginning of the story, but it’s a key part of Palestinian history — and the root of Israel’s creation. <br />* Prior to the Nakba, Palestine had a thriving population — largely made up of Arabs — that had lived and worked the land for centuries. But with the founding of Zionism, years of British meddling, and a British pledge to help create a Jewish state in Palestine — things began to change drastically. By 1947, with increasing tensions between Jewish settlers and Palestinian Arabs — the British left Palestine, and the UN stepped in with a plan to partition the land into two states. What followed was known as Plan Dalet: operations by Israeli paramilitary groups that violently uprooted Palestinians. An estimated 15,000 Palestinians were killed, more than 500 villages were decimated, and roughly 750,000 Palestinians displaced. <br />* Most who were expelled from their homes couldn’t return to historic Palestine. And today, millions of their descendants live in refugee camps in Gaza, the West Bank and surrounding countries. The history of the Nakba has been deliberately concealed and often ignored in western narratives around the creation of Israel. In this episode of Missing Chapter, we break down how the Nakba happened — and how it defined the future of Palestine. <br />",
    "responderId": 2705686142,
    "source": {
      "type": "youtube",
      "reference": "https://www.youtube.com/embed/rGVgjS98OsU"
    }
  },
  {
    "id": 3824868360,
    "text": "Why doesn't Israel release the [10,000](https://www.aljazeera.com/features/2023/10/21/number-of-palestinian-prisoners-in-israel-doubles-to-10000-in-two-weeks) prisoners? Why doesn't Israel release the 2 million Palestinian hostages in Gaza? Not only are hundreds of thousands of children born into the world's largest open-air prison, but the IDF bombs them indiscriminately as a means of leverage. They use their ability to attack hospitals and kill children to deter resistance from the Palestinian people.<br /><br />Secondly, Netanyahu does not care for the Israeli hostages in Gaza. Hamas made several amicable offers to release hostages, such as [releasing all civilians for a ceasefire](https://www.theguardian.com/world/2023/nov/09/netanyahu-rejected-ceasefire-for-hostages-deal-in-gaza-sources-say#:~:text=According%20to%20three%20sources%20familiar,launch%20of%20the%20ground%20offensive.). Netanyahu has rejected these offers as they do not benefit his objectives.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 758045240,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=Y2bvua4XzPsY_Xpz&t=104) video:<br /><br />\u003e Israel is insisting that it is targeting everybody in Gaza. It is not as if it is saying there will be no water no food no electricity just for Hamas. They are very straightforward about it. They are targeting everybody in Gaza. And they unabashedly target everybody. The Minister of Defense Yoav Gallant said on October 9th, just two days after the attack: \"We are imposing a complete siege on the city of Gaza. There will be no electricity no food no water no fuel, everything is closed. We are fighting human animals and we are acting accordingly\". Major General Ghasan Alyan, the person who heads the administration in the occupied territories said: \"Hamas became ISIS and the citizens of Gaza are celebrating instead of being horrified. Human beasts are dealt with accordingly. Israel has imposed a total block on Gaza. No electricity, no water, just damage. You wanted hell, you will get hell.\"<br /><br />\u003e That's not targeting Hamas. That's targeting the whole population of Gaza straight from the horse's mouth. We don't have to infer it from the carpet bombing of Gaza. They are announcing what they are doing.",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=Y2bvua4XzPsY_Xpz&start=104"
    }
  },
  {
    "id": 2610141251,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=NX2NaVgf11jnDAoN&t=258) video:<br /><br />There's another question: What did you expect the people of Gaza to do after being incarcerated in a concentration camp for 20 years? I know what you wanted them to do. You wanted them to just languish and die but did you not really expect that if they had the opportunity or made the opportunity that they would attempt to do something. Then there's the logic, if you look at World War 2, everytime the partisans, the resistance, killed a major Nazi officer, the Nazis retaliated in very bloody ways. The most famous of the killings was when the Czech partisans killed [Reinhard Heydrich](https://en.wikipedia.org/wiki/Reinhard_Heydrich). What did the Nazis do? they went into the village of [Lidice](https://en.wikipedia.org/wiki/Lidice) and flattened it and killed every male above the age of 14. There come [Jack Tapper](https://en.wikipedia.org/wiki/Jake_Tapper) from radio berlin and he [says](https://www.israelunwired.com/cnn-anchor-finally-gets-it-right-on-israel-and-hamas/#:~:text=pro%2DHamas%20spokesmen%2C%20%E2%80%9C-,What%20did%20you%20expect,-%3F%E2%80%9D) What did you expect the Nazis to do? They killed Reinhard Heydrich! What did you expect them to do? The logic of his argument is the people of Gaza should do nothing. Because if they do anything, Israel is going to retaliate. What did you expect them to do?<br /><br /><br />The people of Gaza in the beginning of March 30th 2018, they tried nonviolence. They marched non-violently to the fence. What did Israel do? It targeted children, targeted Medics, targeted journalists, targeted people with physical disabilities, people on crutches and in wheelchairs and then comes Jake Tapper, well they were approaching the fence in Gaza, what did you expect the Israelis to do? That's his logic. The logic is, they should do nothing. They should just languish and die because if they do anything, what do you expect Israel to do!<br /><br />I know the Israelis, that's exactly how they act but that doesn't mean that it is right! or that it's permissible!",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=NX2NaVgf11jnDAoN&start=258"
    }
  },
  {
    "id": 4131074122,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=JzmoSidAWb4TSNYl&t=760) video:<br /><br />I don't want to bore your listeners with the technicalities of international law. Human shielding is what's called a term of art. It's not a technical term which has been codified into law. It basically means the conscription of civilians either to protect combatants or to protect a military site. That's basically what is meant by human shielding. If you take the most extensive investigation of human shielding in the case of Hamas occurred after operation [Cast Lead](https://www.amnesty.org/en/documents/mde15/015/2009/en/) from the 26th of December 2008 to the 17th of January 2009. It was called \"22 days of death and destruction\". It found no evidence that Hamas was engaged in human shielding. It's just not true. This is a factual question. Now there's a separate question, it's called: taking all these feasible precautions when in a civilian area. That is to say, according to the laws of war which is called international humanitarian law [IHL](https://en.wikipedia.org/wiki/International_humanitarian_law), if you are firing from a civilian area, you have to take all feasible precautions so as not to endanger civilians and there it has occasionally been the case that Hamas has been accused of not taking all feasible precautions. Obviously, if you are living in the most densely populated place on God's Earth, it's very hard to take all feasible precautions.<br /><br />So, that's one side of the equation but if you look at all the human rights reports. All of them, going back to [Operation Defensive Shield](https://en.wikipedia.org/wiki/Operation_Defensive_Shield) in 2002, Israel always takes Palestinians as human shields. That's just a standard practice. So you have scenes of Israelis. They take over a building. They put the Palestinians in the window and they fire from behind them. They have tank emplacements and they drag Palestinians to surround the tank placements. This isn't my imagination. There's a voluminous number of human rights publications which document, yes there's a lot of human shielding going on there, but it's all going on by Israel. That's all vanished and airbrushed from the commentary on the Israeli mowings of the lawn in Gaza.",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=JzmoSidAWb4TSNYl&start=760"
    }
  },
  {
    "id": 3311123058,
    "text": "The spokesman said: \"Nations are not easily liberated. The Russians sacrificed 30 million people in World War 2 to liberate it from Hitler's attack. The Vietnamese sacrificed 3.5 million people until they defeated the Americans. Afghanistan sacrificed millions of Martyrs to defeat the USSR and then the US. The Algerian people sacrificed 6 million Martyrs over 130 years. The Palestinian people are just like any other nation. No nation is liberated without sacrifices.\"<br /><br />[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=UJ6fJDlcfcvRnin1&t=1037) video:<br /><br />I interpret that as a factual account of historical events. He's correct. It took 27 million Russian people's lives just to defeat the Nazis. Does that mean that Stalin or any of the Soviet leaders was indifferent to the deaths of their people? Does it mean that the Vietnamese leadership was indifferent? The fact that he's saying that Hamas can't resist because large numbers of people are going to die is in effect to say the Russians shouldn't have resisted the Nazis, the Vietnamese shouldn't have resisted the Americans. A lot of people are going to die. That's just a factual reality but it doesn't follow from that that Zalinski is indifferent to the deaths of Ukranians in the course of the war. ",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=UJ6fJDlcfcvRnin1&start=1037"
    }
  },
  {
    "id": 4247350737,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=LZcgdDP1NO8j7Csb&t=1238) video:<br /><br />If the United States would send 3.8 billion in aid to Hamas for its military, then they would have money left over to build bomb shelters. Now, you might find what I just said factious. Under international law, an occupied people have the right to use force and violence to end an illegal occupation. Under international law, an occupying power doesn't have the right to use force to preserve an illegal occupation. So under international law, the 30 billion dollars that Barack Obama gave to Israel over a 10-year period should have been given to Hamas because they're resisting an illegal occupation.<br /><br />That's the law. It sounds funny almost like I'm trying to score a debater point, no. Under international law, nothing is barring a foreign power from assisting people engaged in a war of self-determination. So, President Obama would have been completely in the right to allocate 30 billion dollars over a 10-year period to assist the Palestinians in their struggle for self-determination. However, international law does bar an occupying power from using force to deny a people the right to self-determination. If you are so upset by the fact that Hamas is devoting resources to building tunnels which are used for military purposes that we can agree on, if he's so upset that instead of building bomb shelters, there's a very simple solution, let the unites states pay for building the tunnels which are legal under international law and then Hamas will have resources left over to build the bomb shelters. ",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=LZcgdDP1NO8j7Csb&start=1238"
    }
  },
  {
    "id": 3843862840,
    "text": "[Briahna Joy Gray](https://en.wikipedia.org/wiki/Briahna_Joy_Gray) said in [this](https://youtu.be/NeO9jGxnbbs?si=PVIn08nz3tXAqq7M&t=1499) video:<br /><br />Israel is already saying that zones that are supposed to be safe zones for civilians are not in fact civilian zones and that they have been infiltrated by Hamas, that's hospitals, that's camps, schools, refugee camps and the like. So why should anybody take their word for the idea that if there were a bomb shelter, it too wouldn't become a target under the justification that Hamas is using the bomb shelter?",
    "responderId": 681380190,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=PVIn08nz3tXAqq7M&start=1499"
    }
  },
  {
    "id": 444538499,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=qIqXQiTahujvx5RD&t=1548) video:<br /><br />So Israel is presenting all of these very sophisticated images to prove that there is a Hamas command and control centre under Al Shifa hospital and in every military operation they target Al Shifa. There's a very simple way to answer that question. there are 60,000 people in Alshifa Hospital. You just send an inspector. Show us where the command and control centre is.<br /><br />So you know exactly where they are! Let's see it. Nobody even asks the question. Why aren't they just sending in inspectors to check whether the hospital is used as a command centre? Because everybody knows. It's nonsense. ",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=qIqXQiTahujvx5RD&start=1548"
    }
  },
  {
    "id": 1301171355,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=NX2NaVgf11jnDAoN&t=258) video:<br /><br />What did you expect the people of Gaza to do after being incarcerated in a concentration camp for 20 years? I know what you wanted them to do. You wanted them to just languish and die but did you not really expect that if they had the opportunity or made the opportunity that they would attempt to do something. Then there's the logic, if you look at World War 2, everytime the partisans, the resistance, killed a major Nazi officer, the Nazis retaliated in very bloody ways. The most famous of the killings was when the Czech partisans killed [Reinhard Heydrich](https://en.wikipedia.org/wiki/Reinhard_Heydrich). What did the Nazis do? they went into the village of [Lidice](https://en.wikipedia.org/wiki/Lidice) and flattened it and killed every male above the age of 14. There come [Jack Tapper](https://en.wikipedia.org/wiki/Jake_Tapper) from radio berlin and he [says](https://www.israelunwired.com/cnn-anchor-finally-gets-it-right-on-israel-and-hamas/#:~:text=pro%2DHamas%20spokesmen%2C%20%E2%80%9C-,What%20did%20you%20expect,-%3F%E2%80%9D) What did you expect the Nazis to do? They killed Reinhard Heydrich! What did you expect them to do? The logic of his argument is the people of Gaza should do nothing. Because if they do anything, Israel is going to retaliate. What did you expect them to do?<br /><br /><br />The people of Gaza in the beginning of March 30th 2018, they tried nonviolence. They marched non-violently to the fence. What did Israel do? It targeted children, targeted Medics, targeted journalists, targeted people with physical disabilities, people on crutches and in wheelchairs and then comes Jake Tapper, well they were approaching the fence in Gaza, what did you expect the Israelis to do? That's his logic. The logic is, they should do nothing. They should just languish and die because if they do anything, what do you expect Israel to do!",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=NX2NaVgf11jnDAoN&start=258"
    }
  },
  {
    "id": 2085421832,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/NeO9jGxnbbs?si=WAX9oV3Eyllt4rRw&t=1994) video:<br /><br />There's a common expression: wherever there is oppression, there's resistance. Not a particularly original idea. So when [Marzook](https://en.wikipedia.org/wiki/Mousa_Abu_Marzook) says there's going to be another and another and another action like this, well there was another and another and another slave revolt. Not altogether shall be a shocking revelation that people who are oppressed will continue to resist. So allow me just to read the passage.<br /><br />The British Empire and the french republic linked together in their cause and their need will defend themselves to the death on their native soil, aiding each other like good comrades to the utmost of their strength even though large tracks of Europe and many old and famous states have fallen or may fall into the grip of the Gestapo and all the odious apparatus of Nazi rule we shall not flag or fail, we shall go on until the end. This island or large part of it, even if it were, subjugated and starving, even then we would continue. When Winsoton Churcill says that that's heroic. It's in all the history books. We shall go on till the end even if we're subjugated or starving but when Marzook says we are willing to sacrifice. We are a nation of Martyrs, we will do what it takes to free ourselves, to emancipate ourselves, to break out of this concentration camp. It suddenly becomes fanatical Jihadi talk. One of the most famous lines from the American Revolution: Give me liberty or give me death. Isn't that a martyr? And that's supposed to be exemplary of the standard to which we should all rise?",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NeO9jGxnbbs?si=WAX9oV3Eyllt4rRw&start=1994"
    }
  },
  {
    "id": 3260706046,
    "text": "We have to make a distinction between anti-Zionism and anti-Semitism. Zionism is a political movement that is not strictly supported by jews, it is supported by some christians and atheists, so it is not purely a religious movement. There are jews who are prominently anti-zionism or not part of the Israel Lobby like Jews Voice for Peace. In essence, it would make no sense to incorporate anti-zionism into the definition of anti-semitism, since it would only serve the purpose of silencing people from criticising Israel. One other example is calling the jews who criticise Israel as \"self hating jews\". This question is discussed by many people, I will just highlight this one [John Mearsheimer with Lex Fridman](https://youtu.be/r4wLXNydzeY?si=QqkEfYEbFNk8qY6g).<br />",
    "responderId": 1917907232,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/r4wLXNydzeY?si=QqkEfYEbFNk8qY6g"
    }
  },
  {
    "id": 3786688625,
    "text": "Okay, let us break this down. Firstly, the premise behind this question is fallible, and for a few reasons:<br /><br />* Not every Palestinian voted for Hamas; just because a certain entity represents a collective, it does not mean that every part of that collective holds the views or ideals of that entity. <br />* Babies and children did not vote for Hamas. <br />* Do you really think the people as a collective were able to predict the future?<br />* Israel has been causing chaos in Palestine for over 75 years. Would you use Israel's prior (and current) actions to justify a Hamas attack? No, you wouldn't. Would you say that America should be obliterated because its presidents have killed millions in other countries? Again, you wouldn't. ",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3458389549,
    "text": "What good does a warning do if,<br />* the time period given for evacuation is simply not long enough<br />* there are people who are lesser abled, people who are bedbound, elderly, children and pregnant women,<br />* there aren't enough means of transport, nor fuel, food and water to travel elsewhere, and<br />* Israel bombs the so-called 'safe' passages and no road is safe to walk on? It isn't rocket science.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2445129852,
    "text": "Peace can only be made with the Palestinians. You have to solve the root causes to achieve peace, which is ending the occupation, the settlements, the oppression of people, the inhumane conditions forced on the people, the confiscation of land, and the discrimination of Christian and Muslim worshipers. Normalising relations with Israel is not even related to the root causes. The PLO, 30 years ago, accepted the two-state solution, to recognise Israel, to commit to non-violent negotiations. All Israel had to do was back from the occupied lands which it never did. <br /><br />[Husam Zomlot](https://youtu.be/NS1ZDPu9_2M?si=CpMoz-o-2QwBMJXr&t=325) explained this eloquently many times.",
    "responderId": 1917907232,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/NS1ZDPu9_2M?si=CpMoz-o-2QwBMJXr&start=325"
    }
  },
  {
    "id": 1304315786,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/I_Sh-ERypMA?si=nCleK53FgKJnBLQ_&t=672) video:<br /><br />I'm very reluctant to condemn people who are in a position or in a condition such that were I in that position or condition I'm not sure what I would do now the 1500 young men who burst the gates of Gaza they were born into a concentration camp they lived for two decades in a concentration camp they had no past they had no present they had no future they had no jobs half of them according to humanitarian organizations suffered from what's called severe food insecurity and then on top of that Israel goes into Gaza and it [mows the lawn](https://en.wikipedia.org/wiki/Mowing_the_lawn) and what mows the lawn means is a massacre in Gaza in 2008-2009 [Operation Cast Lead](https://en.wikipedia.org/wiki/Gaza_War_(2008%E2%80%932009)), in 2012 [Operation Pillar of Defense](https://en.wikipedia.org/wiki/2012_Israeli_operation_in_the_Gaza_Strip), in 2014 [Operation Protective Edge](https://en.wikipedia.org/wiki/2014_Gaza_War) and on each of these high tech massacres visited on the people of Gaza in some cases hundreds in some cases thousands of Palestinians are killed.",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/I_Sh-ERypMA?si=nCleK53FgKJnBLQ_&start=672"
    }
  },
  {
    "id": 3534773090,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) answered a similar question in [this](https://youtu.be/Coe0XrLFMzk?si=gsUiig1SmjvGI_qe&t=94) video:<br /><br />While good on you that you mention these hostages and good that they are released they should be released I mean the Israeli hostages but why didn't you ask me about the Palestinian hostages the children that have been released that have been in Israeli prisons before the 7th of October you know we have hundreds of Palestinian children being grounded by Israel over years and years without charge without trial without access to lawyer or their own families and parents this is really unconscionable it doesn't even belong to our today and our humanity and there for this is a time to really focus on the overall system of Oppression.<br /><br />I'll really tell you what's the difference; the difference is the first is done by individuals but the second is done by a state that sponsored an army the arm invades innocent people's houses in the middle of the night in the early hours of the morning wake up these children in the most terrifying way. It is disgraceful to even draw any Equity between a state that is a member of the UN that is Israel and its responsibility under international law and between individuals. So in fact the the lack of equity is to focus on \"responsible\" actions that they should perform in full accordance with international law.<br />",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/Coe0XrLFMzk?si=gsUiig1SmjvGI_qe&start=94"
    }
  },
  {
    "id": 4187317669,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) said in [this](https://youtu.be/Coe0XrLFMzk?si=y7GgwQjG6ZgsHJE_&t=405) video:<br /><br /><br />This is really a sort of snapshot of this situation. Palestinian-Israeli conflict was not caused by Hamas or any other group. It's 100 years of conflict it's the conflict that caused and created all these Palestinian political and militant groups all through our history and perhaps the world needs to, particularly the US, go straight to the root cause of all this which is the illegal military occupation this is not an issue between Arabs and Arabs or Palestinians and Palestinians this is an issue with Israel's 56 years of occupation and 75 years of Nakba and ethnic cleansing and that's why you have the situation we have today and we need to go straightaway to the root cause.<br />",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/Coe0XrLFMzk?si=y7GgwQjG6ZgsHJE_&start=405"
    }
  },
  {
    "id": 62396797,
    "text": "[Mehdi Hasan](https://en.wikipedia.org/wiki/Mehdi_Hasan) said in [this](https://youtu.be/K1VTt_THL4A?si=0PvySDMB9wvFqGW7&t=2171) video which was discussing whether Anti-Zionism is Anti-Semitism:<br /><br /><br />Let's be clear about what this motion is. The motion says \"Anti-zionism is anti-semitism\". It doesn't say some anti-zionists are anti-semites which is true, it doesn't say anti-zionism can sometimes turn into anti-semitism which is true, it doesn't say that anti-semites often use anti-zionism as cover as an excuse for their bigotry and racism which is true. I wouldn't oppose any of that but that's not what the motion says. The motion says, ridiculously sweepingly offensively ahistorically, that anti-zionism is anti-semitism that merely being opposed to zionism as a political ideology is inherently by definition: ant-semitic which is absurd think about the implications of voting for that tonight you'd be saying every anti-zionist every anti-zionist is a bigot a racist and an anti-semite.<br /><br />By definition, even the many Jewish and Israeli anti-zionists so [Ilan Pappé](https://en.wikipedia.org/wiki/Ilan_Papp%C3%A9), a Jewish historian born and raised in Israel, served in the Israeli military, he's an anti-semite that's what they want you to believe. So is the former speaker of Israel's own parliament the Knesset [Avraham Burg](https://en.wikipedia.org/wiki/Avraham_Burg) melody, they would say he's a self-hating jew so is my The Intercept colleague [Naomi Klein](https://en.wikipedia.org/wiki/Naomi_Klein#Criticism_of_Israel) the acclaimed author and climate change activist so is [Noam Chomsky](https://en.wikipedia.org/wiki/Noam_Chomsky) he's an anti-semite as well. They want you to vote for them and say that the thousands of Haredi ultra-orthodox anti-zionist Jews who oppose Zionism for religious theological reasons they're anti-semites too that's what they want. Don't take my word for it listen to the [35 top Israeli Jewish scholars](https://www.jewishvoiceforlabour.org.uk/article/israelis-warn-against-equating-anti-zionism-with-anti-semitism/) and academics historians of the holocaust who came together and published an open letter in which they wrote: \"many victims of the holocaust opposed Zionism, on the other hand, many anti-semites supported Zionism it is nonsensical and inappropriate to identify anti-zionism with anti-semitism\". are they anti-semites too really all 35 of them by the way in terms of the history they refer to in their letter it is an undeniable indisputable fact that many many European anti-semites did support Zionism at the outset they did embrace the founder of Zionism [Theodor Herzl](https://en.wikipedia.org/wiki/Theodor_Herzl) because, for their own selfish racist reasons, they shared his goal of treating Jews as a foreign separate nation and getting them out of Europe take British foreign secretary [Arthur Balfour](https://en.wikipedia.org/wiki/Arthur_Balfour) author of the 1917 Balfour declaration. In favour of Zionism, Balfour dismissed jews as \"an alien and hostile people\". He sponsored legislation to keep Jewish refugees out of the UK. The only Jewish member of the cabinet at that time [Edwin Samuel Montagu](https://www.opendemocracy.net/en/zionism-anti-semitism-and-balfour-declaration/) opposed the Balfour declaration and called Zionism a mischievous political creed yet apparently according to the proposition tonight Montague's the anti-semite and Balfour isn't.<br /><br /><br />We've heard tonight that it's anti-semitic to suggest Israel is born in sin. Every black American I know says to me and says to everyone else that the United States were born in sin slavery was a sin at the start of the United States no one accuses them of being anti-white racist or anti-american racist it's just a statement of historical fact they say the proposition that when you oppose Zionism you're denying Jews and no one else a right to self-determination which is just flat false not every nation or ethnic group wants a state gets a state.",
    "responderId": 1811331528,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/K1VTt_THL4A?si=0PvySDMB9wvFqGW7&start=2171"
    }
  },
  {
    "id": 603626094,
    "text": "* The United Nations considered this evacuation as an [impossible](https://www.un.org/sg/en/content/sg/note-correspondents/2023-10-12/note-correspondents-gaza) move to take place without devastating humanitarian consequences.<br />* While Palestinians were on the evacuation route, they were killed by the Israeli military. Check [this](https://www.youtube.com/watch?v=bsEj2dcihP4) video by [The Times](https://en.wikipedia.org/wiki/The_Times).",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 4069394009,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) answered a similar question in [this](https://youtu.be/Coe0XrLFMzk?si=gsUiig1SmjvGI_qe&t=94) video:<br /><br />While good on you that you mention these hostages and good that they are released they should be released I mean the Israeli hostages but why didn't you ask me about the Palestinian hostages the children that have been released that have been in Israeli prisons before the 7th of October you know we have hundreds of Palestinian children being grounded by Israel over years and years without charge without trial without access to lawyer or their own families and parents this is really unconscionable it doesn't even belong to our today and our humanity and there for this is a time to really focus on the overall system of Oppression.<br /><br />I'll really tell you what's the difference; the difference is the first is done by individuals but the second is done by a state that sponsored an army the arm invades innocent people's houses in the middle of the night in the early hours of the morning wake up these children in the most terrifying way. It is disgraceful to even draw any Equity between a state that is a member of the UN that is Israel and its responsibility under international law and between individuals. So in fact the the lack of equity is to focus on \"responsible\" actions that they should perform in full accordance with international law.<br />",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/Coe0XrLFMzk?si=gsUiig1SmjvGI_qe&start=94"
    }
  },
  {
    "id": 3818351757,
    "text": "Accusations:<br />* In February 2022, [Amnesty International](https://en.wikipedia.org/wiki/Amnesty_International) [accused](https://www.amnesty.org/en/documents/mde15/5141/2022/en/) Israel of committing the crime of apartheid against the Palestinians, joining other human rights organizations that had previously accused Israel of the crime against humanity.<br />* In January 2021, [B'tselem](https://en.wikipedia.org/wiki/B%27Tselem) both [accused](https://www.btselem.org/apartheid) Israel of apartheid for its treatment of the Palestinians in the occupied territories.<br />* In April 2021, [Human Rights Watch](https://en.wikipedia.org/wiki/Human_Rights_Watch) also [accused](https://www.hrw.org/report/2021/04/27/threshold-crossed/israeli-authorities-and-crimes-apartheid-and-persecution) Israel of apartheid.<br /><br />Amnesty International mentioned in [this](https://www.youtube.com/watch?v=CoFjbnvkmQ0) video:<br />* In 1948 when [Ben Gurion](https://en.wikipedia.org/wiki/David_Ben-Gurion) visited Lifta and other areas near Jerusalem that were completely emptied from their Palestinian residents following attacks of Jewish forces he [stated](https://www.progressiveisrael.org/ben-gurions-notorious-quotes-their-polemical-uses-abuses/#:~:text=there%20are%20no,in%20the%20country) “There are no Arabs. One hundred percent Jews… If we persist it is quite possible that in the next six or eight months, there will be considerable changes in the country, very considerable and to our advantage”. <br /><br />* Benjamin Netanyahu posted on Instagram [that](https://www.npr.org/2019/03/11/702264118/netanyahu-says-israel-is-nation-state-of-the-jewish-people-and-them-alone) Israel is not a state of all its citizens, but rather “the nation of all Jewish people and only them.”<br /><br />* In Jerusalem the Israeli official policy is to maintain at least 60% Jewish majority.<br /><br />* The fragmentation of the Palestinian society and the dispossession of their land are key pillars of Israel's apartheid system to maintain domination and control.<br /><br />* The unequal structure of nationality and status, restrictions on freedom of movement, use of military rule, denial of the right to political participation or the right to peaceful protest and cruel separation of families all add to the complex system that we see today.<br /><br />* Jewish Israelis have only one ID card with a status that grants them the right to live almost anywhere they wish in the country. They can move freely with access to health care and vast resources. Palestinians on the other hand have 4 types of ID cards if any at all. The type of ID card you’re given determines the level of rights you can enjoy and controls where you can go and what you can do.<br /><br />* To make sure Palestinian communities can’t develop any further, Israel has made it almost impossible to grant building permits for Palestinian homes.<br />In 2020 issued 1,094 building permits for Jewish Israelis and only 1 for Palestinians.<br /> <br />",
    "responderId": 2270142857,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3609156120,
    "text": "At a press conference, Lifshitz, the old woman, [said](https://www.theguardian.com/world/2023/oct/24/freed-gaza-hostages-named-yocheved-lifshitz-nurit-cooper) that after initial violence her Hamas captors had shown “care” and “gentleness” – a rare description of humanity in a savage conflict that may turn even bloodier. She also said that they were eating the same food as what the Hamas fighters were eating. Some Israeli commentators called her comments a public relations win for Hamas.<br /><br />Also the following [letter](https://www.trtworld.com/middle-east/israeli-mothers-letter-to-hamas-thank-you-for-extraordinary-humanity-16005866) is sent from an Israeli hostage to Hamas members before being released:<br /><br />*“To the generals who have accompanied me for the last few weeks... it looks like we will part ways tomorrow, but I thank you from the bottom of my heart.*<br /><br />*I am grateful for the extraordinary humanity you showed to my daughter Emilia. You were like her parents, inviting her into your room whenever she wanted. She felt that you were all not just friends, but real, kind-hearted loved ones.*<br /><br />*Thank you, thank you, thank you... Thank you for the hours you spent with her. Thank you for being patient with her and spoiling her with sweets and fruits.*<br /><br />*Children should not be in war zones, but thanks to you and the other kind people we met along the way, my daughter saw herself as a queen in Gaza.*<br /><br />*We did not meet a single person who did not treat us with kindness, care and love.*<br /><br />*I will forever be a prisoner of gratitude towards you because my daughter did not leave here with any lasting psychological trauma. I will remember your kindness despite your difficult situation and the heavy losses you suffered in Gaza.*<br /><br /><br />*I wish you all and your families health and love, thank you very much.”*<br /><br />*Danielle and Emilia*",
    "responderId": 1917907232,
    "source": {
      "type": "website",
      "reference": "https://www.theguardian.com/world/2023/oct/24/freed-gaza-hostages-named-yocheved-lifshitz-nurit-cooper"
    }
  },
  {
    "id": 3365437775,
    "text": "The best answers submitted by the community so far:<br />* Do you condemn Britain for colonizing Palestine and imposing the jews with their state upon peaceful Palestinian people's land? Do you condemn IDF for each and every kill since Nakba to October the 6th 2023?<br />If you condemn them, then how to blame Hamas for resisting?<br />If you don't condemn them then don't condemn Hamas cause they caused further less damage.<br />* I find that any country has the moral and legal right to defend itself against any occupation. In our case, Palestine is a country that existed peacefully till 1948. Being oppressed, forced to leave their homes and lands, treated like dogs in the manger that have no right to hold to their lands (that's what Churchill [really said](https://en.wikipedia.org/wiki/Talk%3AThe_Dog_in_the_Manger#:~:text=Winston%20Churchill%20Example,-Latest%20comment%3A%2013&text=Churchill%20said%20of%20the%20Palestinians,do%20not%20admit%20that%20right.), if that's not pure racism against Palestinians I don't know what it is) I would be surprised if a resistance group like Hamas wouldn't be raised to fight for their homeland. As for what happened in October 7th, I condemn anyone who would kill unarmed civilians but I refuse to blindly believe Israel's scenario especially since Israel said after all it was the [IDF airplanes which bombed](https://www.businessinsider.com/idf-mistakenly-hit-festival-attendees-while-targeting-hamas?r=US&IR=T) the music festival by mistake. Hamas only confessed they took hostages and they did it to exchange the Palestinian prisoners (men, women, and children) held in the Israeli prisons. Still, IDF refused and they decided to use the most inhuman way to win the war which is by bombing the civilians in their houses, hospitals, mosques and churches even the [UNRWA schools](https://www.unrwa.org/newsroom/official-statements/gaza-strip-unrwa-schools-sheltering-displaced-people-constantly-hit) leading to the death of more than [13000](https://www.reuters.com/world/middle-east/israel-renews-call-gazans-flee-key-southern-city-2023-11-17/) persons mostly children and women plus few of the hostage that was kept safe by Hamas but bombed by their own country so the real question here is: do you condemn the apartheid system of Israel?!<br />* I condemn Israel for creating Hamas. Hamas was formally established in [December 1987](https://en.wikipedia.org/wiki/Hamas) after the outbreak of a Palestinian uprising known as the [First Intifada](https://en.wikipedia.org/wiki/First_Intifada) and Israel wanted that and it helped Hamas financially and politically just to create a policy of divide and rule between it and Fatah. Later, the [Central Elections Commission](https://www.elections.ps/tabid/201/language/en-US/Default.aspx) released the final results on Sunday, 29 January 2006, and announced that Change and Reform (Hamas) had [won](https://en.wikipedia.org/wiki/2006_Palestinian_legislative_election) 74 of the 132 seats, while Fatah trailed with 45.<br />According to the results, Hamas won the large majority of the constituency seats which means Palestinian civilians voted for it.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1458703748,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) said in [this](https://youtu.be/amKnSybgv8s?si=1Mbhz9v13XXoHqwy&t=2869) video:<br /><br />Let me explain this! Many people around the world believe that the two-state solution is a Palestinian demand. No, it's not. The two-state solution is a Palestinian concession because by the late 80s, the PLO was proposing one Democratic egalitarian state for all of its citizens be it Muslim be it Christian be it Jewish that was our political platform. But the world (i.e. the West-led world), primarily, the US proposed something else. They said no, we have to divide the land (i.e. The two-state Solution). By the late 80s, Yasser Arafat and the founders of the movement decided to Ally themselves with International resolutions and therefore we accepted the two-state solution, not as our demand, but as our compromise. Now here is the deal! We cannot accept less than the than the 1967 borders.<br /><br />Israel keeps negotiating with us, not about how to achieve the 67 borders, no no, they want to arrive somewhere between Jerusalem and Jericho. So they want to bite more of the 22% of historic Palestine that is the 1967 borders and they don't understand that any Palestinian leader, will never be able to accept less than what was offered by the UN Security Council and they can never give more. This is the line. <br />",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/amKnSybgv8s?si=1Mbhz9v13XXoHqwy&start=2869"
    }
  },
  {
    "id": 195995782,
    "text": "[Amnesty International](https://www.amnesty.org/en/about-us/) mentions in [this](https://www.amnesty.org/en/latest/campaigns/2017/06/israel-occupation-50-years-of-dispossession) report:<br />* Although Israel withdrew ground troops from the Gaza Strip in 2005, it maintains an illegal air, sea and land blockade on Gaza and maintains a so-called “access-restricted area” or buffer zone within Gaza. These have cut off more than 2 million Palestinians from other parts of the Occupied Palestinian Territories and the outside world for 10 years.<br />* As well as controlling where Palestinians can go and who they see, Israel also controls and arbitrarily restricts their access to safe, clean water. Water consumption by Israelis is at least four times that of Palestinians living in the OPT.<br />* The hundreds of Israeli military closures across the West Bank such as checkpoints, roadblocks and settler-only roads, as well as the overall permit regime, make simple daily tasks for Palestinians who are trying to get to work, school or hospital a constant struggle.<br />",
    "responderId": 2270142857,
    "source": {
      "type": "website",
      "reference": "https://www.amnesty.org/en/latest/campaigns/2017/06/israel-occupation-50-years-of-dispossession"
    }
  },
  {
    "id": 2787927916,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/te1y7ahp2LQ?si=wW1aFyfffVWBY-dd&t=613) and [this](https://youtu.be/te1y7ahp2LQ?si=5w4mmQaY-RVkOj13&t=2857) parts of a video:<br /><br />This is not a particularly complicated situation right now, the Israeli government has openly unabashedly blatantly declared a war of genocide on the people of Gaza, that's not an exaggerated language. The prime minister of Israel [said](https://www.middleeastmonitor.com/20231029-netanyahu-declares-holy-war-against-gaza-citing-the-bible/) in a speech which been which has been reproduced everywhere said this is a war against [Amalek](https://en.wikipedia.org/wiki/Amalek) referring to the Old Testament. What's a war against Amalek? well, just open up the Old Testament. It obliges Israel to kill every man, woman, and child. Can there be any doubt, now I mean this seriously, can there be any doubt in the minds of any objective observer when Israel declares a policy of prohibiting any food water, fuel or electricity from entering Gaza that it's a genocide?<br /><br />Why do they do that? Because Gaza for Israel has always been a problem. Because they refuse to just languish and die in a concentration camp. The famous expression: wherever there's oppression there's resistance, so periodically there is resistance and Israel [mows the lawn](https://www.washingtonpost.com/world/2021/05/14/israel-gaza-history/) but after October 7th, it decided, number one this was obviously a resistance of a much higher magnitude and also it was an opportunity to solve the Gaza question. During the first week, and we're not talking about ancient history, they were hoping to expel all the Palestinians to Egypt and ethnic cleansing just clean out Gaza that was the goal it didn't work.<br />",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/te1y7ahp2LQ?si=wW1aFyfffVWBY-dd&start=613"
    }
  },
  {
    "id": 351407104,
    "text": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot) said in [this](https://youtu.be/amKnSybgv8s?si=ap2h_H2p_uSSN72I&t=311) video:<br /><br />They didn't leave because they saw that people who left were bombarded everywhere they saw that the South was not spared. They see that Israel has already called on major cities like Khan Yunis in the South to evacuate they see that if they leave their home they're killed anyway so they decided: if Israel is going to kill us let it kill us in our own home<br />",
    "responderId": 1943801793,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/amKnSybgv8s?si=ap2h_H2p_uSSN72I&start=311"
    }
  },
  {
    "id": 151983837,
    "text": "The best answer we received so far from the community is:<br /><br />This is an unproven narrative being put forward by the Israeli propaganda machine in order to link this to Iran with the allegation that the Palestinian Resistance takes directives and instructions from Iran, which is completely untrue.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 4157037524,
    "text": "The best answers submitted by the community so far:<br />* Does a criminal have the right to defend himself against a man whose brother he has just killed in order to steal his money?<br />* Look up the map of Palestine starting from 1942 to Nakba to 1967 to nowadays, how come a refugee becomes not only a land owner but \"The land owner\" leaving only a small percentage of homeland for the Palestinians under occupation by the Israeli military. This didn't start on October the 7th. This started 75 years ago. Didn't the Palestinian have the right to defend themselves?",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3019401293,
    "text": "The best answers submitted by the community so far:<br />* The White House [retracted](https://www.nbcnews.com/tech/internet/unverified-allegations-beheaded-babies-israel-hamas-war-inflame-social-rcna119902) a statement from Biden about the false claim of beheaded babies.<br />* Ben Shapiro’s post depicting a “burnt baby” image was [reverse-engineered](https://twitter.com/jacksonhinklle/status/1712585253456400856?s=20) proving it was AI-generated.<br />* Israeli settler Yasmin Porat [asserts](https://groundreport.in/israeli-settler-yasmin-porat-says-israel-killed-hostages-too/#google_vignette) that it was the Israeli forces, not Hamas, who were responsible for the death of Israeli civilians.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2654900554,
    "text": "The best answers submitted by the community so far:<br />* The IDF attacked the hospital twice before. They also signalled intent to attack the hospital again. The IDF first posted about the attack on X as a celebration of sorts. Then this was deleted. Then the post was changed to state the attack was carried out by Hamas. And then Islamic Jihad. Then there was an alleged audio between two supposed Hamas operatives discussing an attack on the hospital which was [proven](https://twitter.com/alextomo/status/1714670858914894046?s=20) fake.<br />* Ex-US military weapons expert Dylan Griffith [debunked](https://twitter.com/ShaykhSulaiman/status/1714767928870985866?s=20) this claim on 18 October 2023 stating that only the IDF had the capability to carry this out - as it was a guided munition.<br /><br />",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3872121290,
    "text": "[Al Jazeera](https://en.wikipedia.org/wiki/Al_Jazeera) said in [this](https://www.youtube.com/watch?v=z_Ccjh22GtU) video:<br /><br />The Israeli Army has accused Hamas of using hospitals as a convenient cover for its Fighters and an elaborate system of tunnels. On November 5th, the Israeli Army published a video on X that claims to reveal the entrance to a tunnel used by Hamas Fighters. After further analysis, our digital investigations team found that this structure is nothing more than a water reservoir. To further verify its finding, the team tracked down one of the original Engineers who worked on the construction of the Hospital by cross-referencing his diagram with the images in the video released by the Israeli Army our digital investigations team was able to clearly identify that pressure equalisation pipe commonly used for water and fuel tanks or reservoirs. Its conclusion is that the only thing this video confirms is that there is a water tank on the property, not a tunnel used by Hamas Fighters.<br />",
    "responderId": 7852704,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3178402056,
    "text": "[Al Jazeera](https://en.wikipedia.org/wiki/Al_Jazeera) showed in [this](https://www.youtube.com/watch?v=0el9wiOBmmM) that there's no trusted proof that Hamas has beheaded Israelis.",
    "responderId": 7852704,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 717388995,
    "text": "The state of Israel has violated many international laws, including United Nations Resolutions and the Laws of War and<br />Occupation as stated in the [Fourth Geneva Convention](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949).<br /><br />**1. Israeli Occupation is Illegal**<br /><br />Laws Violated:<br />* [U.N. Charter, Article 2(4) & 51 (1945)](https://www.un.org/en/about-us/un-charter/full-text) <br />* [Declaration on Principles of International Law Concerning Friendly Relations…, Principle 1](https://digitallibrary.un.org/record/202170?ln=en)<br /><br />Israeli Actions:<br />* It is illegal under international law to acquire land by force: Israel annexed land occupied by force during 1948 and 1967 wars (lands other than those given by the UN 1947-48 partition plan) ILRC article. Military action and occupations are legal only if they are for self-defense, or to directly benefit the native population. But studies show Israel is not just defending itself as it develops de-facto annexation with its settlements and separation barrier on occupied land, as it takes over most of the occupied territories (over 70%) and its natural resources for its own use and economic benefit, at the expense of the native population. ILRC article on why the Occupation is illegal.<br />* In violation of the UN Partition Plan, Israel took an extra 15% of the land in 1948, and then, following the 1967 war, Israel<br />confiscated East Jerusalem and the Golan Heights.<br />* Studies by UN, I.C.J., and International H.R. organizations have found that Israel violates the human rights of Palestinian people on a massive scale, including torture, imprisonment without charges or trial, land confiscation, harassment at checkpoints, unwarranted civilian shootings, not punishing Israeli settlers’ crimes against Palestinians, unwarranted disruption of medical care, commerce, employment, free movement, destruction of public and private property, family separation.<br /><br />**2. Illegal Israeli Settlements On Occupied Land**<br /><br />Laws Violated: [Geneva Conventions IV, Article 49(6) (1949)](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949/article-49). It is illegal to colonize occupied land or transfer non-indigenous population to that land.<br /><br />Israeli Actions:<br />* Immediately following the 1967 war, Israel began building Israeli civilian settlements on Palestinian lands, eventually building over 200 settlements throughout the occupied territories, and settling over 450,000 Israeli civilians in them, displacing hundreds of thousands of Palestinian civilians from their own legally owned lands.<br />* Israeli citizens live in hundreds of Israeli settlements on occupied land not originally given to them in the UN Partition Plan, displacing hundreds of thousands of Palestinians.<br /><br />**3. Illegal Israeli Practice of Ethnic Cleansing**<br /><br />Laws Violated:<br />* Geneva Convention IV, Articles [45](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949/article-45?activeTab=undefined), [46](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949/article-46?activeTab=undefined) & [49](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949/article-49?activeTab=undefined) (1949),<br /><br />Israeli Actions:<br />* Since 1910, in different ways, the Zionists and then Israel have taken Palestinian lands, forced native populations from their land,<br />and then refused the Palestinian landowners or tenants’ residency or employment on them.<br />* Following fighting in 1948 and then again in 1967,<br />Palestinian civilians who wished to return to their homes in Israel and the Occupied Territories were forbidden re-entry (“right of return”), confining<br />them to increasingly smaller areas of Israel and Occupied Territories.<br />* The Israeli government enacts laws, and employs its military to keep<br />approximately 750,000 Palestinian Arab civilians from returning to their homes following the end of fighting both in 1948 and in the occupied<br />territories in 1967. Israel then violates UN resolutions ordering them to respect Palestinians’ right to return to their homes. <br />",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1327044613,
    "text": "**4. Israeli Apartheid System Is Illegal**<br /><br />Laws Violated:  [International Convention on the Suppression and Punishment of the Crime of Apartheid (1976)](https://www.un.org/en/genocideprevention/documents/atrocity-crimes/Doc.10_International%20Convention%20on%20the%20Suppression%20and%20Punishment%20of%20the%20Crime%20of%20Apartheid.pdf)<br /><br />Israeli Actions:<br />* Check the answers to the question 'Why are you calling Israel an apartheid state?' <br />* Israel’s society-wide system of discrimination and isolation of the Palestinian people within Israel, and its system of exploitation, oppression and isolation in the occupied territories, [fits](https://www.amnesty.org/en/documents/mde15/5141/2022/en/) exactly the official, legal UN definition of apartheid, which is considered to be a crime against humanity.<br />* In 2003, the Israeli legislature (Knesset) passed [legislation](https://www.hrw.org/news/2005/05/22/israel-reject-law-separating-spouses) that forbade spouses of Arab-Israeli citizens who are in the occupied territories from joining their families in Israel (with some exceptions). The reason for this legislation is to help maintain the Jewish demographic majority family unification.<br />* The racist nature is evident in that only Palestinians (no other ethnic groups) are not forbidden to live in Israel after marrying an Israeli. Amnesty International argues that this law violates fundamental principles of equity, human dignity and personal freedom enshrined in basic law as well as the rights of the child to live with both parents.<br />* Human Rights Watch [reported]( https://www.hrw.org/report/2021/04/27/threshold-crossed/israeli-authorities-and-crimes-apartheid-and-persecution) on the Crimes of Apartheid and Persecution saying: \"Israeli authorities methodically privilege Jewish Israelis and discriminate against Palestinians\"<br /><br />**5. Collective Punishment is Illegal**<br /><br />Laws Violated:<br />* [Geneva Conventions IV, Article 33 (1949)](https://ihl-databases.icrc.org/en/ihl-treaties/gciv-1949/article-33#:~:text=Espa%C3%B1ol-,Article%2033%20%2D%20Individual%20responsibility%2C%20collective%20penalties%2C%20pillage%2C%20reprisals,Pillage%20is%20prohibited.)<br />* [Geneva Conventions (Protocol I), Article 75(2d) (1977)](https://ihl-databases.icrc.org/en/ihl-treaties/api-1977/article-75)<br /><br />Israeli Actions: In response to Arab rebellion, the Israeli Military takes massive action against entire Palestinian communities, for example destroying entire neighbourhoods of homes, or confiscating communal farmlands, bulldozing homes, blocking off certain areas, or not allowing civilian populations to leave their houses for extensive periods of time. This is called collective punishment because it punishes entire communities for the actions of a few<br /><br />**6. Illegal Massive Transformation of Local Laws**<br /><br />Laws Violated: [Hague Regulations IV, Article 43 (1907)](https://ihl-databases.icrc.org/en/ihl-treaties/hague-conv-iv-1907/regulations-art-43)<br /><br />Israeli Actions: Israel has created a dual legal system in the occupied territories – a democratic one linked to Israel for the Israeli settlements, and an oppressive, exploitive one for the Palestinian communities run by the Israeli military committees and Israeli-controlled civic administrations, replacing all Arab government functions with Israeli military committees, and dismissing or deporting all Arab government official.<br /><br />**7. Violations of U.N. Security Council Resolutions**<br /><br />Laws Violated: Israel has violated 28 resolutions of the United Nations Security Council (which are legally binding on member-nations U.N. Charter, Article 25 (1945); a few sample resolutions:<br />* [Resolution 54](https://digitallibrary.un.org/record/112001?ln=en#record-files-collapse-header): At its  332nd  meeting,  on  8  July  1948,  the  Council, decided that the President should send telegrams to the parties concerned and to the United Nations Mediator requesting immediate information on the situation in  Palestine,  and inquiring particularly about the attitude of the parties concerning the observance and prolongation of the truce.<br />* [Resolution 111](https://digitallibrary.un.org/record/112084?ln=en): According  to  the  report  of  the Chief of Staff, this Israel action was a deliberate violation of the provisions of the General <br />Armistice Agreement between Israel and Syria, including those relating to the de-militarized <br />zone, which was crossed by the Israel forces which entered  Syria.<br />* Also see resolutions: 233, 234, 236, 248, 250, 252, 256, 262, 267, 270, 280, 285, 298, 313, 316, 468, 476, etc.<br /><br />Israeli Actions: Israel has violated many U.N. Security Council resolutions especially relating to its occupations, land annexations, military aggression, HR violations,<br /><br />",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 6821393,
    "text": "**8. Separation Barrier Ruled Illegal**<br /><br />Laws Violated: [International Court of Justice of 2004](https://www.un.org/unispal/document/auto-insert-178825)<br /><br />Israeli Actions: The separation barrier built by Israel snakes it way though the West Bank, isolating Palestinians from each other, from their land, work, schools and health care. The wall confiscates significant amounts of land and annexes more land to Israel. The court said: The construction of the wall being built by Israel, the occupying power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated regime, are contrary to international law.” “Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem.” The court noted that significant amounts of the West Bank are, defacto, annexed by the wall.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2774615582,
    "text": "Everyone can do any of the following things individually to help Palestine:<br />* **Raise Awareness:** The narrative, especially in the West is largely doctored by the Israeli lobby. The more people you talk to, the more difficult it becomes for the deadlock-enabling narrative to take hold. Post and share on social media, share Palestinian voices, stores, and culture.<br />* **Vote:** Politicians must understand they will lose votes on this issue.<br />* **Boycott, Divestment and Sanctions (BDS):** As long as it is economically viable, the issue will never be resolved. BDS aims to make a resolution viable instead. Check [this](https://bdsmovement.net/Act-Now-Against-These-Companies-Profiting-From-Genocide) BDS movement.<br />* **Donate:** Donate money, food, or any other thing that can reach and help Palestinians.<br />* **Pray:** Prayers are very powerful. Ask Allah to help your brothers and sisters in Palestine.<br />* **Educate Yourself, Your Family and Your Friends:** A big reason for the weakness and languidness we see from those who can help the Palestinians but don't is that they don't base their actions and decisions on a strong religious stance and because of their illiteracy on the cause. Start by yourself and those around you and intend to bring up a stronger generation. Check [Al Jazeera](https://www.instagram.com/aljazeeraenglish/), [Middle East Eye](https://www.instagram.com/middleeasteye/), [IMEU](https://www.instagram.com/theimeu), [AJ+](https://www.instagram.com/ajplus/), and follow [those](https://www.instagram.com/p/CzgC3jCg7bz/) in and from Gaza.<br />* **Protest**: Join local actions & protests.<br /><br />Also, everyone has their own speciality:<br />* **Computer scientists** should think of how can they use their knowledge to build software/hardware that supports their brothers and sisters (e.g. by joining a community like [Tech for Palestine](https://techforpalestine.org/)).<br />* **Artists** can use their talents to create impactful art that highlights the Palestinian struggle, history, and culture.<br />* **Writers and journalists** can help make the real narrative of Palestine presented accurately.<br />* **Teachers** can incorporate lessons about the history and ongoing situation in Palestine into educational curriculums.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3419435052,
    "text": "[Yanis Varoufakis](https://en.wikipedia.org/wiki/Yanis_Varoufakis) wrote in [this](https://www.yanisvaroufakis.eu/2023/10/15/why-i-refuse-to-condemn-hamas-or-the-israeli-settlers-but-instead-insist-that-the-culprits-for-the-atrocities-in-israel-palestine-are-us-europeans-and-americans/) article:<br /><br />On 8th October, during an interview in Berlin (click adjacent icon and read the full text below), I refused to condemn either Hamas or the Israeli settlers committing atrocities across Israel-Palestine. Instead, I condemned us, Europeans and Americans, as the true villains who, for decades, we stood idly by while the underlying cause of these atrocities, Apartheid, became a fait accompli.<br /><br />Why did I not take the easier route of, on the one hand, condemning Hamas and, on the other, championing the rights of Palestinians? Because I wanted to make the point that it is we, Europeans and Americans, who must be condemned. Because it is we, Europeans and Americans, who, with our patronisingly ritual moralistic condemnations (whether one-sided or equidistant), have been making Peace impossible in Israel-Palestine.<br /><br />We allow this by keeping dead quiet when Palestinians are suffering killings, evictions, war crimes. By dismissing Israeli war crimes (like those committed now that Gaza is being turned into a parking lot) as “inevitable”, as Acts of God – like a Volcano erupting as is its wont, as its nature dictates. And by issuing stern condemnations of Palestinians, calling them ‘animals’ and ‘savages’, when some of them lash out violently, brutally, in response to the slow genocide the Apartheid state is calculatingly foisting upon their families and communities.",
    "responderId": 127173960,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 509690710,
    "text": "Some of the points written by the [Middle East Monitor](https://en.wikipedia.org/wiki/1929_Hebron_massacre) in [this](https://www.middleeastmonitor.com/20210819-the-massacre-of-jews-in-1929-hebron-is-a-microcosm-of-the-conflict/) article:<br />* On that fateful day in August 1929, Arab-Palestinians in Jerusalem were incited to violence by rumours that Jews were planning to appropriate what is known to Muslims as the Noble Sanctuary of Al-Aqsa and destroy the mosques there. The late Israeli historian Haim Gerber pointed out that in numerous documents written by Zionist leaders in the late 1920s they expressed the will to demolish the buildings on the “Temple Mount” to make space for a new Jewish Temple.<br />* While the spark of the Hebron massacre – part of the so-called 1929 Palestine riots, in which a total of **133** Jews and **116** Arabs were killed –  is indeed linked to Jerusalem, the deeper roots are to be found in Hebron itself, where Arabs and Jews had lived together for centuries without any particular tension, and often spoke the same language. The most notable exception to this was in 1775, when members of Hebron’s Jewish community were unjustly accused of having killed the son of a local sheikh and were obliged to pay a heavy fine.<br /><br />",
    "responderId": 2926155375,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 729343115,
    "text": "The best answers we got from the community so far:<br /><br />* The way they were treated in the Ottoman Empire as per this video:<br />[Palestine 1896](https://youtu.be/1vaIK8wlAl0). But that question is fundamentally wrong: Christians and Jews are Palestinians. They were then and are now. You're confusing religion for ethnicity. The idea that all Palestinians are all Muslims is wrong.<br />* We can look at South Africa and draw similarities. If a resolution to the Palestinian cause is reached, non-Palestinian rights will be dictated within the said resolution.",
    "responderId": 1917907232,
    "source": {
      "type": "youtube",
      "reference": "https://youtu.be/1vaIK8wlAl0"
    }
  },
  {
    "id": 1332347810,
    "text": "In [this](https://twitter.com/_ZachFoster/status/1716497689787949232) tweet, Zachary said:<br /><br />* From late 1987-1988, Palestinians in Gaza rose up in a series of non-violent demonstrations, strikes, boycotts & protests. They killed 0 Israelis. They were unarmed. In response, Israel killed 142 Palestinians in Gaza. Source: Jean-Pierre Filiu, Gaza: A History (2014), 206.<br />* In 2005, Palestinians organized a non-violent movement, Boycott, Divestment & Sanctions (BDS). In response, Israel: 1) said the movement's true goal is to destroy Israel. 2) called BDS supporters antisemitic. 3) [Punished](https://t.co/dTAizzuUE1) its founder w/threat of displacement.<br />* In 2003, unarmed Palestinians in Bil'in organized weekly protests against the separation barrier that was confiscating their land. In 2009, Israel [killed](https://www.972mag.com/escaping-justice-who-killed-bassem-abu-rahme/#:~:text=In%20April%202009%2C%20during%20the,the%20presence%20of%20senior%20officers.) Bassem Abu Rahmah w/a shot in the chest; in 2010, it killed Jawaher Abu Rahmah, who died from tear gas inhalation.<br />* In 2008 & 2009, the residents of Ni'lin, in the West Bank, protested non-violently every week against the expansion of the separation barrier that was confiscating their land. In response, Israel killed Ahmed Moussa on 29 July 2008; Israel [killed](https://electronicintifada.net/content/transcript-israeli-military-kills-10-year-old-nilin/7643) Yousef Aqel Srour on 5 June 2009.<br />* Beginning in March 2018, tens of thousands of Gazans marched to the fence, unarmed, demanding the right of return. Israel killed 223 Palestinians & Israeli snipers left 6,106 Palestinians with life-changing wounds.  Not a single Israeli experienced any major physical harm.<br /><br />These incidents represent a tiny fraction of Palestinian non-violent resistance. In the vast majority of cases of Palestinian non-violent resistance, Israel responds w/ lethal & disproportionate violence. And you wonder why a tiny number of Palestinians have turned to violence?",
    "responderId": 1763891674,
    "source": {
      "type": "twitter",
      "reference": "https://twitter.com/_ZachFoster/status/1716497689787949232"
    }
  },
  {
    "id": 4253193575,
    "text": "[Al Jazeera](https://en.wikipedia.org/wiki/Al_Jazeera) mentions in [this](https://www.aljazeera.com/news/2023/11/2/from-the-river-to-the-sea-what-does-the-palestinian-slogan-really-mean) article:<br /><br />* To Palestinian and Israeli observers alike, different interpretations over the meaning of the slogan hang on the term “free”. Nimer Sultany, a lecturer in law at the School of Oriental and African Studies (SOAS) in London, said the adjective expresses “the need for equality for all inhabitants of historic Palestine”.<br />* Freedom here refers to the fact that Palestinians have been denied the realisation of their right to self-determination since Britain granted the Jews the right to establish a national homeland in Palestine through the Balfour Declaration of 1917.<br />* Sultany, a Palestinian citizen of Israel, said \"It’s important to remember this chant is in English and it doesn’t rhyme in Arabic, it is used in demonstrations in Western countries. The controversy has been fabricated to prevent solidarity in the West with the Palestinians.\"<br />* According to the Jewish Virtual Library, the party’s original party manifesto in 1977 stated that “between the Sea and the Jordan there will only be Israeli sovereignty”. It also argued that the establishment of a Palestinian state “jeopardises the security of the Jewish population” and “endangers the existence of the state of Israel”.<br />* Israel’s ambassador to the UK, Tzipi Hotovely, has been among the promoters of international recognition of the Jewish historic claim to lands from the river to the sea.<br />",
    "responderId": 7852704,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1103041227,
    "text": "As the superior power, and with the help of the US, Israel signed an inequitable peace accord with the Palestinians in 1993. Despite its unfairness, the Palestinians accepted everything that the Israelis and US dictated (including being allowed to inhabit only 22% of historical Palestine), whilst Israel did not concede anything in return. It did not withdraw from the occupied territories, did not allow the return of refugees, and did not accept the substantive human right of self-determination for the Palestinians. It only furthered its takeover and occupation of Palestine. Since 1993 Israel has multiplied its illegal Jewish settlements in the West Bank, expropriated land and water resources, added more than 500 checkpoints, imprisoned and tortured thousands of Palestinians including children without a trial process, and taken every step to deny the Palestinians their statehood. This behaviour obviously raises questions about the sincerity of these ‘generous offers’, and proves that Israel has always had clear ulterior motives in their dealings with Palestine. Even in this current genocide, Hamas has been willing to work on coming towards an agreement regarding a ceasefire deal. It has been Israel who has rejected the deal on multiple occasions. The ceasefire deal that was reached weeks ago and lasted for a number of days, was the exact same deal that Hamas had presented Israel some weeks prior, and Israel rejected at the time. It is abundantly clear that Hamas/Palestine is not the issue here, as well as it is clear where Israel’s interests lie - and it is not even with their own people.<br /><br />Sources:<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[@propagandavstruth](https://www.instagram.com/propagandavstruth/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 1451539971,
    "text": "**Short:** The US supports Israel to safeguard its strategic interests in the Middle East, particularly those related to oil and gas resources. The timing of Israel's creation with the discovery of oil in the region also reinforced their partnership. Their relationship has now also extended to destabilising Middle Eastern nations like Iraq, Afghanistan, Palestine, and Lebanon. Secondly, the political lobby group [AIPAC](https://www.aipac.org/), one of the US’ largest, contributes massive political funding to US politicians. Finally the extensive multi-billion dollar US/Israel weapons partnership, which includes military aid, arms sales, police training and technological collaboration is another key factor.<br /><br />**Long:** Israel is helping to protect America's oil and gas interests in the Middle East. The US also aims to eventually mine Gaza’s oil and gas reserves, and as such, it needs Israel's help in eradicating the Palestinians in order to make this possible. The timing of Israel's creation was similar in timing to when the Middle East first found its oil. And so, it was in the interest of the UK and US to support the Zionist state of Israel from that point forward. These nations worked together, and have continued to work together, to destabilise the Middle East - particularly Iraq, Afghanistan and now Palestine and Lebanon. The creation of a solely Israeli state would also finally serve as the first ever stable foothold in the Middle East for the United States, something which it has been yet to achieve.<br /><br />Similarly, one of the largest political lobby groups in the United States is the AIPAC (American Israel Public Affairs Committee) which provides billions of dollars in political funding to representatives in the US political system. This also ties into one of the most significant reasons the US backs Israel, and that is due to their longstanding and extensive weapons relationship, which is marked by military aid, arms sales, police training, and joint technological collaboration. The United States also provides Israel with substantial military and financial aid annually. The U.S. foreign assistance to Israel is one of the largest aid packages it offers, and in 2022, the U.S. [signed](https://www.aljazeera.com/news/2016/9/15/us-and-israel-sign-record-38bn-military-aid-deal) an agreement to provide Israel with $3.8 billion in military aid. Doing this ensures they remain backed by and in Israel’s good books.<br /><br />[Video: What AIPAC does and who it backs](https://www.instagram.com/reel/Cz46_nri_72/?igshid=MzRlODBiNWFlZA==)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3482487767,
    "text": "**Short:** Firstly, Hamas is making incursions into its own occupied territory, not 'Israel.' Israelis in that territory are considered illegal settlers under international law. We also need to remember that if Israel targets Hamas, Hamas has the right to counter attack. Recent events also suggest that the majority of the Israeli casualties on October 7th are due to their own military strategy, including the Hannibal Directive which instructs the IDF to kill its own civilians in favour of them being taken captive. Secondly, if we are to condemn the targeting of civilian deaths we need to acknowledge that Israel, one of the most advanced militaries in the world has the means to avoid them but in actuality, has repeatedly targeted civilians and is even using AI to ensure they strike the most densely populated areas. The focus should be on the tens of thousands of Palestinian casualties rather than attempting to justify war crimes and killing children based on the excuse of targeting Hamas. It is also a fact that Israel's military operations often aim for mass Palestinian death, both in the past and now, and the practice itself is considered legitimate and encouraged by the Israeli government.<br /><br />**Long:** Firstly it’s important to understand that Hamas technically made an incursion into occupied Palestinian territory, not ‘Israel’. Israelis are illegal settlers living in occupied Palestinian territory, in violation of international law. Even if Israel was truly targeting Hamas, Palestinians have the right under international law to counter attack. Regardless, Hamas entered Israel purely to capture hostages in order to facilitate a hostage swap. The civilian casualties that resulted on the Israeli side, are increasingly appearing to be mostly IDF personnel, and mostly as a result of Israel's own military strategy. The Hannibal Directive instructs the IDF to kill their own to prevent them being taken captive. An Israeli reserve pilot, Col. Nof Erez, has recently [spoken](https://twitter.com/WarWatchs/status/1726671271017013494) out describing the IDF’s response to the October 7th attacks as a ‘Mass Hannibal’. Furthermore, it is becoming increasingly clear that many, perhaps most, of the alleged horrific crimes committed by Hamas on October 7th were caused by tanks and attack helicopters operated by the IDF.<br /><br />Secondly, and most importantly, if we are going to condemn the killing of civilians, we need to acknowledge the upwards of 20,000 and growing number of Palestinian children, women and men killed at the hands of the Israeli occupation since October 7th. Targeting Hamas is not a defensible position for what Israel is currently doing to Palestine and its people, nor is it the sole reason. Even if this was, Israel also would not be any more tolerant of Hamas if it strictly targeted military objects because Israel considers Hamas and any form of its resistance, armed or otherwise, to be illegitimate. <br /><br />In contrast, Israel has the eleventh most powerful military in the world and is a nuclear power. According to [Human Rights Watch](https://www.hrw.org/news/2023/12/07/israel-strikes-journalists-lebanon-apparently-deliberate) and [Amnesty International](https://www.amnesty.org/en/latest/news/2023/10/damning-evidence-of-war-crimes-as-israeli-attacks-wipe-out-entire-families-in-gaza/), Israel directly targeted civilians or recklessly caused civilian deaths during both during previous ‘conflicts’ and now.  Far from avoiding the deaths of civilians, Israel considers them legitimate targets. In fact, Israel’s facial recognition technology is so advanced it can pick out faces in a sea of people, and follow them for miles. There is no conceivable reason as to why a military with such sophisticated tracking technology, lacks the ability to directly identify and attack ‘Hamas’, and instead has to resort to obliterating entire apartment blocks, hospitals and schools. Recent reports have also revealed the depths of Israel’s AI technology, which enables them to generate thousands of target sites within seconds. The report quotes Israeli intelligence sources who say Israel knows how many civilians it’ll kill with each strike, including children, and chooses to kill large numbers of them anyway. Israel also seeks out what it calls “power targets” to bomb. “Power targets” are non-military targets like homes and public buildings that Israel bombs for the purpose of terrorising Palestinian civilians and harming their society.<br /><br />Sources:<br /><br />[@Tracking_Power](https://twitter.com/Tracking_Power)<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />[@olblueyzz](http://instagram.com/olblueyzz)<br /><br />[@theimeu](https://www.instagram.com/p/C0VQ-NnM2uP/?img_index=1)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3629827228,
    "text": "**Short:** This is by design. The deliberate strategy of Israeli government propaganda is not only to win you over but also to capitalise on your confusion. The Israeli government invests billions in social media channels and marketing, using false evidence and fake videos to deepen support from their base and confuse you. The Zionist playbook - a real Israeli government document - offers specific instructions to shape conversations to benefit Israel's public image. Also, one thing to remember is that propaganda doesn't always aim to change your beliefs outright; it's often most effective when it’s planting seeds of doubt. This tactic ends up having the effect of making every claim from a Palestinian source immediately untrustworthy and allowing you to remain confused, unsure of the truth and afraid to speak up. But much like how we can rise up at those ‘confused’ about other issues that seem completely black and white, like murder, DV, SA etc, and demand people to be on the right side of history, we can definitely put in the same effort in this instance too, and I think it’s something you are definitely capable of given how much I know we both value safety, peace and justice. <br /><br />**Long:** This is by design. If Israeli propaganda cannot win you over entirely, it will bank on your confusion and your inability to see this situation clearly. The state of Israel has its own social media channels, has massive ties to Hollywood, and spends billions of dollars on marketing. They also deploy false evidence, fake videos and more both in order to further entrench those already on their side, and sow further confusion in those who are unsure of which side to take. They also have something called the Zionist playbook, in which you can be provided specific instructions and tools to properly ensure you are talking about Israel in ways that are most beneficial for its public image.<br /><br />The thing with propaganda is that most of it does not need to capture your belief entirely. Most of the time, it's not designed to sway you there and then, in actuality, planting seeds of doubt is a much more effective strategy. Much like how the Indigenous Voice (Australia) campaign was muddied by misinformation and noise in an attempt to inject distrust into the population and confuse voters, let’s take the ‘conflicting’ reports of who is ultimately responsible for the hospital strikes in Gaza as an example. The expectation set by Israeli and Western media complicating who’s to blame now ensures that no matter what is reported, no matter how much evidence is provided or how heinous the actions may be against Palestinians, you can’t “jump to conclusions” and assume it’s Israel. Now, everything from Palestinian sources can be painted as unverifiable. Do you see how they’re intentionally trying to muddy the waters? <br /><br />Being confused about this situation is also a marketing tactic. It is a tool of propaganda. It is supposed to keep you confused, scared and misinformed so that you refuse to see the situation for what it is or feel confident enough to speak up, even in small ways. Unfortunately, however, being ‘confused’ in the face of genocide, while understandable for the above reasons, is ultimately not a defensible position. So much like how we can rise up at those ‘confused’ about other issues that seem completely black and white, like murder, DV, SA etc, and demand people to be on the right side of history, we can definitely put in the same effort in this instance too, and I think it’s something you are definitely capable of given how much I know we both value safety, peace and justice.<br /><br />Source: Adam Johannes, Secretary, Cardiff Stop the War Coalition<br /><br />[Video](https://www.instagram.com/p/CyywrrLtyFF/): This 4 minute video uncovers the truth behind Israel's PR Machine<br /><br />[Video](https://www.instagram.com/p/Cy5yCH4MrKG/): Proof Israel used false evidence to justify bombing a hospital <br /><br />[Video](https://www.instagram.com/reel/CzkY1RjxXxj/): The Zionist Propaganda Playbook<br /><br />[Post](https://www.instagram.com/p/Cz6NuAHglSF/): Proof that contemporary wars were always started by false media reporting<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 430060275,
    "text": "**Why can’t I rely on news from sources like the BBC, ABC, New York Times, The Guardian etc?**<br /><br />Due to the billions of dollars spent by the Israeli government on marketing and the spreading of propaganda and misinformation, not only is it misguided to suggest that people seek out information from the news sources cited above, but actively harmful. These organisations are notoriously Zionist and anti-Palestine, backed and funded by the West and Israel, some even owned by Zionists. So, they feed the imperialist propaganda machine. There are several independent news sources reporting real-time, on-the-ground information that is integral to 'uncomplicating' a lot of the confusion people are having around this issue such as the following:<br /><br />* [Al Jazeera](https://www.instagram.com/aljazeeraenglish/)<br /><br />* [Middle East Eye](https://www.instagram.com/middleeasteye/)<br /><br />* [IMEU](https://www.instagram.com/theimeu)<br /><br />* [AJ+](https://www.instagram.com/ajplus/)<br /><br />* [shaunking](https://www.instagram.com/shaunking/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br /><br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 283783547,
    "text": "**Short:** Palestine is among the earliest sites of human habitation in the world and Palestinian people descended directly from the ancestral inhabitants of the land. The Zionist claim over the land is rooted in the Hebrew bible, and is under questioning by scholars who suggest that myths like the Abraham story (which claims Abraham descended from Palestine) were written after the fact in an attempt to give Jews in captivity in Babylon land rights. The Moses Exodus story (where God promised the Israelites Palestine) is another myth used to justify the establishment of Israel. That, and for many other reasons, relying on ancient texts with questionable historical accuracy to justify the harm being done to Palestinians is dangerous. Until 1947, Jews and Palestinians coexisted in harmony, but the majority of today's global Jewish population, including those in Israel, have European roots. Zionism, as a European settler-colonial movement, denies Palestinian existence, and falsely emphasises Jewish ties to the land. At the end of the day, regardless of the evidence for or against the claims of Jewish presence 2000 years ago, it does not justify the current theft of land and harm inflicted on Palestinians.<br /><br />**Long:** Palestine is among the earliest sites of human habitation in the world. Palestinian people descended directly from the ancestral inhabitants of the land. The reason Jewish Zionists feel they have a claim to the land is based on what is written in the Hebrew bible. However, scholars now suggest that the Abraham myth - which claims Abraham was born in Palestine - was composed centuries later in late 600 BCE by landowners while in captivity in Babylon, who were attempting to trace their rights to the land through their father Abraham. These captives upon their return from Babylon, then based their claim to what is now Palestine on another myth – the Moses Exodus story, which claims God gifted the Israelites the ‘promised land’ (Palestine). It is also worth questioning why a book written centuries ago and believed only by those who follow the religion, and is historically proven at the very least questionable in its factual accounts - is being used as a justification to exterminate Palestinians and occupy the land. <br /><br />In actuality, Jews and Palestians lived in harmony in Palestine until 1947. Jews are also largely a diaspora, with several Jews and Israeli Jews in particular, having no genetic or Middle Eastern heritage tying them to the region. In fact, European/Ashkenazi Jews make up 80% of the world's Jewish population. Meaning the majority of Jews globally - and in Israel - have European roots and are not Indigenous to Palestine. Genetic testing is also conveniently banned in Israel, likely in an attempt to cover up this fact.<br /><br />To justify the appropriation of land, and the expulsion and elimination of its people, Zionism as a European settler-colonial movement has tried to deny the existence of the Palestinians altogether and falsely inflate Jews ancestral ties to the land. Before the British Mandate on Palestine and the Balfour declaration, Jews in Palestine made up only 4% of the population. Jewish claims that they inhabited Palestine 2000 years ago are irrelevant in the current context, and definitely do not justify the theft of land and the killing and expulsion of the Palestinians.<br /><br />Sources:<br /><br />[@key48return](https://www.instagram.com/key48return)<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[welcometopalestine.com](https://www.welcometopalestine.com/history-of-palestine/ancient-history/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 2867931721,
    "text": "**Short:** No. Hamas is not even declared as a terrorist group by the UN. It is recognized as a political organisation with a resistance armed branch, acknowledged by the UN for its right to resist illegal occupation. The group, democratically elected in 2006, faces tightening restrictions imposed by Israel, which are responsible for the current Palestinian humanitarian crisis. Hamas is labelled a terrorist organisation by Israel and some Western nations for their political gain, even though Hamas’ goal is to liberate Palestinians from a 75-year-long illegal occupation. The claim that they are a terrorist group makes even less sense when we understand that their creation was [backed and funded by Israel](https://www.instagram.com/p/CzCta6sIABF). Regardless of what you want to believe about Hamas, the root issue is the fact that Palestinians aren’t free - a right that every one of us deserves. We also need to understand that people growing up under violent restrictions are always going to be radicalised and fight for their lives. Ending the occupation is the best and most humanitarian way to truly eradicate Hamas (if that is your ultimate goal).<br /><br />**Long:** No. The UN has also actually never declared Hamas to be a terrorist group. They are a political organisation with an armed branch of Resistance Fighters, who have been given the right by the UN \"to resist the illegal occupation by any means necessary.\" Hamas is a legitimate resistance group according to international law because they are made up of an occupied people.<br /><br />Hamas was elected democratically in 2006, but Palestinians have yet to experience a moment of independence. Israel immediately imposed massive restrictions upon Palestinians in the Gaza Strip when Hamas won the elections, and has been tightening them ever since. These restrictions have created an ongoing  \"humanitarian catastrophe\". Even prior to October 7, these restrictions have meant that Palestinians have had limited to no access to clean water, electricity or the ability to tend to even the most urgent medical needs.<br /><br />The narrative that Hamas is a terrorist organisation came from the Israeli government and other Western nations and only began once Hamas won the election. It also makes it even more clear this labelling was done for political gain when you understand that Israel funded and helped create Hamas. In fact, Wikileaks revealed that the Israeli Intelligence Chief [said](https://www.jpost.com/defense/yadlin-israel-would-be-happy-if-hamas-takes-over-gaza) that the IDF could deal with Gaza as a hostile state if Hamas ruled. And for 14 years, it has been Netanyhu’s policy to keep Hamas in power. Hamas has actually never threatened to attack any other nation. Their focus is solely on getting their freedom and land back from illegal occupiers and they have every legitimate right to do so.<br /><br />If Hamas was a terrorist group it would just be a terrorist group. They would promote terror, not liberation. We also need to understand that people growing up under a blockade are going to be radicalised and fight violently for their lives. Even if the goal still remains to ‘eradicate Hamas’, we need to first eradicate the occupation. That is the most humane solution for everyone involved and gives Palestinians back their freedom - a right we all deserve. <br /><br />Sources:<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />[@phantomchasr](https://twitter.com/phantomchasr)<br /><br />[@olblueyzz](http://instagram.com/olblueyzz)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 1522123622,
    "text": "**Short:** This question, as well as saying “but Hamas”, whether intended to or not, ends up being used to justify treating all Palestinians as terrorists. It is an extremely unfair and unhelpful question to ask. It also overlooks the long-standing struggles of Palestinians and the fact Hamas emerged to fight for the human rights of Palestinians as a result of a 75-year-long ethnic cleansing. Blaming all Palestinians for Hamas also ignores their fight for freedom and forces them as oppressed people, currently experiencing mass death, into a cycle of endless fault-finding that overlooks the root cause of the problem. It is also detrimental to your learning process, and in moving towards a solution.<br /><br />The questions you should be asking are: why aren’t Israelis asked to condemn the actions of Israel before being given a voice? Why are Jews allowed to be scared but not Muslims? Why are white people entitled to feel fear but not Arabs? Being asked to condemn Hamas distracts you from the urgent reality of ongoing Palestinian suffering and the need for meaningful action to help both the Palestinian people and Israeli hostages.<br /><br />**Long:** This question, as well as saying “but Hamas”, whether intended to or not, end up being used to justify treating all Palestinians as terrorists. It is an extremely unfair and unhelpful question to ask.  People want Palestinians to condemn Hamas before even discussing the horrors they've been facing for 75 years. It's important to remember that Hamas came about only in the past 17 years and as a result of the violence Palestinians have been subjected to by the occupation. Hamas and potentially new resistance groups will continue to exist and grow unless there is global support in first liberating the Palestinian people.<br /><br />Secondly, blaming all Palestinians for what Hamas does makes it easy to dismiss their struggle for freedom. Unlike Israeli officials who don't have to condemn their documented, proudly admitted to, genocidal actions before being allowed to speak - Palestinians are forced to condemn Hamas first. This puts Palestinians in a wildly unfair position. No matter what they or anyone else says, it's never enough. It is also detrimental to your learning process, and in moving towards a solution. The questions you should be asking are: why aren’t Israelis asked to condemn the actions of Israel before being given a voice? Why are Jews allowed to be scared but not Muslims? Why are white people entitled to feel fear but not Arabs? <br /><br /><br />This focus on condemning Hamas distracts you from the real issue – the occupation and suffering of Palestine and its people. And by addressing questions such as these, instead of talking about any other part of what is currently happening right now, we are just repeating empty phrases that can neither bring the 1,200 Israelis or 20,000 Palestinians back to life.<br /><br />Sources:<br /><br />[@MEE/Nicki Kattoura, Geo Maher](https://www.instagram.com/p/Czcq7T8qsCK/?igshid=MXBmampzN2pkMzF0NA%3D%3D)<br /><br />[@theslowfactory](https://www.instagram.com/theslowfactory/?hl=en)<br /><br />[@key48return](https://www.instagram.com/key48return/)<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3220307170,
    "text": "**Short:** Israel and the IDF's claims about the events on October 7th have now been widely debunked, some even confirmed by the IDF themselves. Allegations of rape and the claim of 40 beheaded babies were officially retracted and proven false, and the overall death toll has been revised from 1400 to 1200. Eyewitnesses, including IDF soldiers, have all stated that the IDF indiscriminately shot and bombed, killing its own civilians. We also have to question the IDF’s failure to pre-empt the attack despite being given multiple warnings, as well as its continued blocking of negotiations to free its own hostages. If we’re going to condemn child-killing and cry for the Israeli hostages, that should at the very least also include the 10,000 Palestinian hostages (including women and children) who are currently illegally imprisoned by Israel, and the 20,000 and counting innocent Palestinians who have been killed in the name of ‘defeating Hamas’. We have real war crimes being committed, real Palestinian children dying, and real hostages (on both sides) under attack due to the actions of the Israeli government and IDF. Ensuring a better future for the Palestinian people is where our focus should be.<br /><br />**Long:** Israel and the IDF's claims about the events on October 7th have now been widely debunked, some even confirmed by the IDF themselves. The allegations of mass rape have also been dropped by the Israeli government. The 40 beheaded babies claim has been officially retracted and proven false by the US government and other independent organisations and downscaled to one dead baby, not beheaded, and killed by persons unknown. Two-thirds of Israelis killed on October 7 were military personnel. <br /><br />The killers of the remaining third are revealed to have been in part, the Israeli armed forces themselves. They have also recently revised the death toll from 1400 to 1200. Several eyewitnesses, including IDF soldiers and a recent investigation, have all attested to the fact the IDF was shooting/bombing indiscriminately and was targeting its own civilians/military. They also released helicopter footage of the attack, in which they admitted they had killed their own citizens/soldiers as it was ‘too difficult to tell who was who’. There have also been several questions surrounding the fact that the most sophisticated military on earth, with the world's best surveillance system was both unable to pre-empt the Hamas attack and also unable to respond accurately.<br /><br />The state of Israel also has more to gain from retaliating to an attack than preventing one, and this needs to be taken into consideration especially when we are claiming that Hamas’ actions have been ‘unjustifiable’. We know Netanyahu specifically is not on the side of preventing further harm because he has continued to block negotiations by Hamas to release the Israeli hostages in exchange for fuel, aid and a ceasefire, and he continues to bomb Gaza indiscriminately, so far resulting in the death of 8 Israeli hostages. Yet, Hamas remains the enemy and the excuse to cause further destruction. Even when the Israeli hostages have publicly spoken out about their experiences in captivity, saying they were treated very well. If we want justice for the Israeli hostages, the most immediate risk to their safety and well-being is the carpet bombing and restrictions on Gaza where many of them are located. Due to the occupation, they are also being deprived of food and water and facing imminent death alongside the remaining Palestinians.<br /><br />In the same vein, if we agree that taking hostages and killing children are horrible crimes, we need to acknowledge the 10,000 Palestinians, including women and children, who currently remain illegally imprisoned and tortured by the Israeli government. Hamas captured Israeli hostages on Oct 7 in order to facilitate a hostage swap, aiming to negotiate the release of all Palestinians being held in Israeli jails. These men, women, children and elders are arrested indiscriminately and held without trial, dehumanised, stripped, urinated on, beaten, and exposed to physical and psychological torture, and whose whereabouts are often kept from their families. We have real war crimes being committed, real children dying, and real hostages under ‘attack’ all due to the Israeli occupation. Restoring Palestinian's human rights and dignity is where the focus should be.<br /><br />[Video](https://www.instagram.com/p/CzCvpQVvtOG/): The Israeli hostages were taken for a hostage swap<br /><br />Sources:<br /><br />[@georgegalloway](https://twitter.com/georgegalloway)<br /><br />[@olblueyzz](http://www.instagram.com/olblueyzz)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3970410603,
    "text": "**Short:** Hamas is actually only in Gaza. Even still, Israel continues to occupy, kill and imprison Palestinians in the West Bank where there is no Hamas - with the same ‘wiping out Hamas’ justifications. Israel blaming Palestinians for their own deaths is misleading and a common tactic of the IDF designed to paint Palestinians and Arabs as terrorists, and therefore justify their killing. In fact, investigations by international human rights organisations have proven the claims that Hamas is storing weapons in UNRWA schools are false. And while Israel accuses Hamas of using civilians as shields, evidence actually shows Israeli soldiers have regularly used Palestinians as human shields throughout history. Also, unlike Israel’s ‘Hamas’ claims - which it cannot verify, we can explicitly see the documented and current actions of Israel's military operation, including the demolishing of Palestinian homes, decimation of hospitals and refugee camps, and the indiscriminate killing of women and children. At least at this present moment, these actions show that Netanyahu and the IDF are the ones with no regard for civilians and civilian infrastructure, NOT Hamas.<br /><br />**Long:** Hamas are actually only in Gaza. Even still, Israel continues to occupy, kill and imprison Palestinians in the West Bank where there is no Hamas - with the same ‘wiping out Hamas’ justifications. This is arguably one of Israel's most misleading claims because it blames Palestinians for their own death and deprives them of their victimhood. The Israeli government will say that a resistance group's existence is terrorism, therefore everyone associated with them (aka every citizen in every location in the area) is complicit, and dangerous and should be eradicated. They have used these arguments for decades, like in its attacks on Lebanon in 2006 and in Palestine in 2008. The Israeli government has yet to even prove that Hamas has used civilian infrastructure to store military weapons. In the two cases where Hamas stored weapons in UNRWA schools, the schools were empty.<br /><br />In fact, only Israeli soldiers have consistently used Palestinians as human shields. Sometimes, by tying young Palestinians onto the hoods of their cars or forcing them to go into a home where a potential militant may be hiding. Israel’s definition of ‘human shields’' is also simply a combatant who may or may not be in the same general area as hundreds of civilians.’ Israel also rarely names these ‘combatants’ or provides evidence they were ever even in the area that was bombed. Even if we say that Israel's claims could be true, humanitarian law means Israel is supposed to avoid civilian casualties that would be ‘excessive’ in relation to whatever advantage could be gained. Despite what you may be led to believe are equal violations to human life, the sheer number of Palestinian civilian deaths, 10,000 children (and counting), along with the blockading of aid, indiscriminate carpet bombing, use of white phosphorus, bombing of schools, mosques, hospitals, churches, civilian homes and more horrendous violations of human rights - at least at this present moment -  show Netanyahu and the IDF are the ones with no regard for civilians and civilian infrastructure, NOT Hamas.<br /><br />Sources:<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />[@inthesetimesmag](https://www.instagram.com/inthesetimesmag/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3117346315,
    "text": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) said in [this](https://youtu.be/te1y7ahp2LQ?si=rrqUlsMg0CsIyfAr&t=1574) video:<br /><br />A brutal blockade was imposed on Gaza in 2006. It means nobody can go into Gaza and nobody can leave Gaza with the rarest of exceptions. Israel controls the exit and the entry to Gaza. Israel controls the airspace. Israel controls the waterways. Israel controls everything, There was a period when Israel denied chocolate, wouldn't allow baby chicks to go into Gaza, it wouldn't allow potato chips to go into Gaza. There was a period when Israel had an explicit policy of giving Gazans, it was calculated, starvation plus diet; A diet that just hovered above starvation. There are people with severe medical conditions who want to go to better hospitals and say to Jordan, they cannot leave. David Cameron the former conservative prime minister of the UK described Gaza as an open-air prison. One of the senior security officials, [Giora Eiland](https://en.wikipedia.org/wiki/Giora_Eiland), a still very prominent figure in Israel's security establishment, in 2004, before the blockade, described Gaza as a huge concentration camp.<br /><br />It's not just a concentration camp. it's a killing field. because every few years, Israel [mows the lawn](https://www.washingtonpost.com/world/2021/05/14/israel-gaza-history/) in Gaza. They killed in [OperationCast Lead](https://www.amnesty.org/en/documents/mde15/015/2009/en) 1400 people [Operation Protective Edge](https://en.wikipedia.org/wiki/2014_Gaza_War) 2200 people and that's leaving aside a slew of other operations. ",
    "responderId": 1603959675,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/te1y7ahp2LQ?si=rrqUlsMg0CsIyfAr&start=1574"
    }
  },
  {
    "id": 895918999,
    "text": "**But if Hamas stops, won’t Israel too?**<br /><br />**Short:** Hamas actually did not exist until 1987. The Israel we know was established in 1948. Knowing the history helps us better understand possible solutions. Because the real driver behind the violence we are currently witnessing is Zionism. Zionism which is fueled by political, economic, and territorial interests, and hinges on acquiring sole control over Palestines rich oil reserves, gas, and agricultural landscapes. Israel's actions are not because of Hamas, and even if they were - Hamas’ existence doesn't justify the deaths of tens of thousands of innocent Palestinians. Netanyahu has made clear he is not going to end the violence, nor do the majority of Israelis want him to. Hamas are also not going to stop, as they are fighting for their livelihoods, and their right to live freely. The more the Israeli government kills, maims and oppresses the Palestinians, the more they are rightfully going to fight back. Netanyhu is hellbent on acquiring control of Palestine, and wiping out the Palestinains - and he and other members of the Israeli government and military are freely, widely admitting this to the public. If we truly want anything to ‘stop’ we need to cut the tree from its root by exerting political and economic pressure on Israel, and dismantle the occupation entirely.<br /><br />**Long:** Hamas actually did not exist until 1987. The Israel we know was established in 1948. Knowing this helps us better understand possible solutions. Because the real question to ask is, what is Israel's end goal? Is it to defend themselves from terrorists, or to push the Palestinans out by any means necessary? So what if Israel is just defending itself from Hamas? If that’s the case - then according to Israel's logic, 2.2 million Palestinians - half of them children, are potential terrorists, or at least human shields for terrorists. And then the solution becomes to destroy the 360-kilometre square strip of land and to expect you to accept 20,000 and climbing civilian deaths as collateral damage.<br /><br />But, we know that Israel is not just defending itself against Hamas. Because the reality is that this is no different from any other ‘war’, in this is a ‘war’ about land, resources and power. This also isn’t a conspiracy, this is outlined in official Israeli documents, and is being pushed for proudly by Netanyahu and Biden. Gaza has rich, untapped oil reserves that rival those of other nations in the Middle East and are also wanted by the US. Gaza’s gas is also worth $500 million, and it’s also highly in demand. Palestine also has a rich and abundant agricultural landscape, which Israel is both destroying and illegally profiting off of. <br /><br />Finally, having full control of Palestine, and surrounding countries such as Lebanon - which is part of the “Greater Israel Plan” clearly state that Israel’s end goal is to establish a trade channel with Europe, which would allow them stronger ties to the West, the means to amass further wealth and also gain more control of the region in general. It is clear, with the full context, that none of what is happening to Palestine is just about Hamas, and none of Israel’s actions exist in a vacuum. Israel cannot bomb Palestinians into submission, and it cannot bomb them into peace. If we truly want anything to ‘stop’ we need to cut the tree from its root by exerting political and economic pressure on Israel, and dismantle the occupation entirely.<br /><br />Sources:<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />[@key48return](https://www.instagram.com/key48return/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3863291296,
    "text": "**Short:** The Hamas charter explicitly states that their war is against Zionism, the occupation, and the settler colonial project, not the Jewish people. The claim that \"Hamas wants to kill all Jews\" is misleading and pits together two unrelated concepts. Hamas is fighting for the liberation of the Palestinian people and an end to the occupation, not the eradication of Jews. They have also agreed to a two-state solution, which Israel rejected. The narrative suggesting otherwise is used for political gain and to justify genocide under the claim of eradicating a 'terrorist' group.<br /><br />**Long:** The Hamas charter explicitly states that they have no problem with the Jewish people. They also clearly state that their war is against Zionism, the occupation, and the settler colonial project. It’s also important to understand that settler-colonialism is a dynamic of power and resources, and is the reality of the situation, not just a justification being used by Hamas to ‘kill all the Jews’. Israel is a settler colony because its creation necessitated the violent displacement of the land's inhabitants and in order to exist, it must perpetually police and populate stolen homes to maintain power, as well as eradicate those that stand in their way.<br /><br />The “Hamas wants to kill all Jews” argument is also similar to the one that states it is anti-semitic to be anti-zionist, in that it is falsely equating two unrelated concepts. Hamas wanting liberation for the Palestinian people, and the end to the occupation so they can live freely and rightfully on their own land, is not equivalent to calling for the death of all Jews - in theory nor in their own writings. Hamas has also agreed to a two-state solution, which Israel rejected. This narrative is perpetuated for political gain, and to justify genocide in the name of eradicating a ‘terrorist’ group.<br /><br />[Video](https://www.instagram.com/p/CzXGQTBOqV5/): See this same question answered by a Jew<br /><br />Sources:<br /><br />[@k.w.bogen](https://www.instagram.com/k.w.bogen/)<br /><br />[@agelender](https://www.instagram.com/agelender)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 265124000,
    "text": "**If Hamas knew Israel was going to retaliate, why did they attack in the first place?**<br /><br />**Short:** The Palestinians, particularly those in Gaza, have endured this ‘war’ for decades. Efforts for peace, such as the Oslo Peace Accord in 1993, was not adhered to at all by the Israeli government, and the situation has worsened over time with continued Israeli occupation, settlement expansion, and restrictions on Palestinian life. Peaceful initiatives, like the March of Return in 2018, were met with lethal force from Israeli snipers, causing hundreds of casualties and injuring 36,000 innocent people. The Gaza Strip has been declared 'unlivable' even prior to this current genocide by the WHO due to the quality of life that is being imposed on Palestinians by the Israeli occupation. It's also crucial to understand that the reason for the recent Hamas attack was to take live hostages in order to negotiate the release of thousands of illegally imprisoned Palestinians, not to instigate harm to their own people or eradicate all Israelis and Jews.<br /><br />**Long:** This 'war' has been going on for decades. The PLO (the governing body at the time) accepted all US and Israeli conditions for peace and signed the Oslo Peace Accord in 1993, in return for an end to Israeli occupation. 30 years have passed, and the Palestinians regained nothing. Israel actually ended up occupying more land, built more settlements, increased its military presence, and violated holy sites. Palestinians have tried to resist peacefully, they've tried everything. Each time it has only resulted in more and more deaths of the Palestinian people and stricter restrictions on their daily life, movements and access to resources.<br /><br />In fact, in 2018 Palestinians in Gaza launched a peaceful initiative called the March of Return by walking to the Israeli military fence surrounding Gaza demanding an end to the suffocating blockade. Israeli snipers responded by killing hundreds of marchers, ¼ of them children and injuring over 36,000. For the Palestinians, peace treaties and peaceful marches have only exacerbated their loss and perpetuated their suffering. The current state of affairs for the past 75 years, particularly in the last 16 years, have rendered Gaza ‘unlivable’ according to the WHO. Finally, it's important to understand that the purpose of the Hamas attack was to take live hostages in order to facilitate the release of 10,000 illegally imprisoned Palestinian men, women and children - not to incite the destruction of their own people, nor the eradication of all Israelis. <br /><br />Sources:<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[@phantomchasr](https://twitter.com/phantomchasr)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 32033766,
    "text": "**Isn't this a very complex issue that seems unsolvable?**<br /><br />**Short:** The situation in Palestine is a clear case of genocide, and framing it as a 'war' or 'conflict' is factually wrong when one side has no military and is being intentionally deprived of food and water. We can clearly see the parallels with other historical cases of colonisation and genocide, such as South African apartheid and the colonisation of Indigenous Australians, yet somehow there is still room for confusion about what is happening when it involves Palestinian lives. The claim that it's a 'complicated' issue also assumes that you lack the compassion and ability to understand that killing 10,000 children (so far), and bombing aid trucks, hospitals and civilian homes is wrong. No country in the world has killed that many kids in that time period in modern history. The media also perpetuates that it’s complicated when in reality, Israel is in violation of international law and is committing war crimes under religious pretences. The ‘it’s complicated’ narrative is also fueled by the West and is entirely based on the hope you will continue to believe debunked propaganda. We need to understand that sitting idly by in the face of genocide, has direct effects on all of our rights and freedoms. Most of us have also had the privilege to speak out without fearing for our lives, so we should.<br /><br />**Long:** Despite what the media is telling you, this is a clear-cut case of genocide. Framing it as a ‘war’ or a ‘conflict’ when one side lacks a military and is facing a severe deprivation of basic necessities is dishonest and actively harmful. The story of Palestine is a simple case of colonisation and dispossession. It has been told before European settlers arrive in a foreign land, settle there, and either commit genocide against or displace the indigenous inhabitants. Zionists have not introduced anything new in this regard. However, with the help of Western media and propaganda, the state of Israel has managed to construct a multilayered narrative so complex that it seems only Israel itself can understand it. When you consider instances like the apartheid in South Africa and the genocide of Indigenous Australians, it is evident that these events are publicly recognised as morally unjust. The Palestinian cause shares striking similarities with both of these injustices yet somehow there is still room for people to be divided on this matter.<br /><br />Also, the ‘it's complicated’ framing assumes you are too uncompassionate and dense to understand that Israel has been wiping out an entire indigenous population for 75 years, a population that is half children. Since October 7th, the average age of Palestinians being murdered in Gaza is 5 years old, and 1 child is killed every 10 minutes in Gaza. More than 74% of the 20,000 Palestinians killed (so far) are children, women and the elderly. No country in the world has killed that many kids in that time period in modern history. Israel kills them and their families whilst calling them terrorists, restricting their movements, calories, electricity, internet and more, and bombs them indiscriminately. It does so under the guise of religious honour, in order to falsely claim the land, which they actually intend to mine for its abundant oil and gas reserves. I don’t think you’re able to understand that at all. <br /><br />The imbalance in the presentation of this issue is also exacerbated by the West, which benefits from you buying into the perpetuation of this ‘too complex to talk about’ narrative because it keeps you silent and spending money. They also expect you to believe the most absurd propaganda, all of which has been debunked. Never in history has there been a genocide so explicitly endorsed by those committing it, and they still think you're dumb enough to believe they're the victims? This issue is also a problem that impacts the rights and freedoms of all of us, whether you are able to see it that way yet or not. We also have a duty to use our privileges to speak out and protest as many of us have the luxury to do so without fearing for our lives as a result, so we should.<br /><br />Sources:<br /><br />[@theslowfactory](https://www.instagram.com/theslowfactory/?hl=en)<br /><br />[@key48return](https://www.instagram.com/key48return/)<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[@_SecondThought](https://twitter.com/_SecondThought)<br /><br />[@celinecelines](https://www.instagram.com/celinecelines/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 4105400456,
    "text": "**Short:** The true fair solution to the Israeli-Palestinian conflict is the decolonization of Palestine, which involves the dismantling of the Israeli state as we know it, an end to the military occupation and restrictions, the right of return for Palestinian refugees, and the re-establishment of pre-1948 borders for an equal Palestine. It’s somewhat true however to say there isn’t a solution that suits both sides because the Zionist-Israeli goal is not peaceful coexistence but the permanent expulsion of Palestinians, something those in power stand by proudly. It’s also important to emphasise that this solution doesn’t in any way call for the eradication of Israelis, and in reality, it allows for the continued existence of Israelis in Palestine, given they are willing to accept its liberation. If not, Israelis have always possessed the ability to relocate and travel freely, something which Palestinians haven’t. Also, the duty for answering the question of ‘what else are we supposed to do’ should be on the people perpetrating war crimes to justify why they need to keep committing war crimes, and how the current state of affairs is absolutely necessary to ensure everyone's safety. Like many situations, we don’t even have to know the alternative to know that something is bad.<br /><br />**Long:** This is somewhat correct. While Hamas has previously been open to a two-state solution, ultimately peaceful co-existence is not possible as long as Palestine is under occupation by Israel. The only solution is the decolonisation of Palestine. Israel as it currently stands should be dismantled, their illegal military occupation and restrictions on Palestinians should come to an end, the legal right to return be granted to all Palestinian refugees, and the re-creation of Palestinian borders pre-1948 established. One state, Palestine, Indigenous Palestine - where every citizen will be treated equally regardless of religion or race, as it was before the creation of 'Israel' and not victim to the Israeli government's current eradication plan. The reason that it is somewhat correct to say there is no solution that appeals to both sides, is because Israel's goal is not to exist peacefully alongside the Palestinians, it is to claim the entirety of Palestine and expel the people permanently. Zionism requires the state of Israel to thrive. This is something that they actively admit, have government documents stating, and are ultimately proud of. This isn’t a conspiracy.<br /><br />In essence, it is also entirely plausible to fight for this solution, whilst respecting the rights of the Israelis who, whether they are against the occupation or not, have established homes, lives and communities in Palestine. And, emphasise the fact this solution does not call for the eradication of Israelis. If this solution is ever achieved, Israelis have the option to remain and accept a liberated Palestine and continue life in a land that is governed equally and humanitarian for all. Or they can leave, as they are telling and forcing the Palestinians to do. The difference in telling a Palestinian to leave to escape their circumstances, as opposed to an Israeli (apart from the fact that Palestinians are indigenous to Palestine), is that 10% of the Israeli population has dual citizenship and is also freely able to travel due to having one of the highest ranking passports in the world. Palestinians however, even when trying to flee bombing, are unable to easily acquire passports or enter another country. Even under the best circumstances, Palestinian passports are amongst the lowest-ranking passports in the world which further restricts their movement globally.<br /><br />We also have to understand that asking ‘Well what else are they supposed to do?’ is misguided. Regardless of the presence of a solution, the duty should be on the people perpetrating war crimes to justify why they need to keep committing war crimes, and how the current state of affairs is absolutely necessary to ensure everyone's safety. Like many situations, we don’t even have to know the alternative to know that something is bad.<br /><br />Sources:<br /><br />[@key48return](https://www.instagram.com/key48return/)<br /><br />[@timhutton](https://twitter.com/TimHuttonAu/status/1718175316588585448)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 352101399,
    "text": "**Why can’t I be on both sides? I just want peace.**<br /><br />**Short:** Choosing to remain neutral means that you choose to support the oppression of Palestinians and accept their eradication. Palestinians are people just like you and me, and they deserve to experience life freely, and fairly, with their families alive and healthy and without lifelong trauma. Being on both sides also assumes both sides are equal, which they are not. Israel is a nuclear-powered, militarised occupier and Palestine is a civilian population, made up of mostly children, facing occupation, militarily enforced restrictions and mass death. We also need to understand that Israel only exists, and can only continue to exist off of the bloodshed of hundreds of thousands of Palestinians. Not taking a side and advocating for peace as an attempt to remain neutral not only ignores the reality but also means you agree with things continuing the way they are - at the expense of Palestinians. A struggle for freedom cannot peacefully coexist with an occupying oppressor, so you cannot simply advocate for ‘peace’ here. How can there be peace without freedom? It’s simple, you are either with humanity or war. You are either for liberation or eradication. There is a future for Palestinians on the horizon, and we have the ability to ensure it is a dignified and safe one.<br /><br />**Long:** Choosing to remain neutral means that you choose to support the oppression of Palestinians and accept their eradication. Palestinians are people just like you and me, and they deserve to experience life freely, and fairly, with their families alive and healthy and without lifelong trauma. Being on both sides also assumes it’s a situation with equal sides, which it is not. The 2 sides here are justifying a genocide or living a genocide. This is a nuclear-powered, militarised colonial occupier (Israel) colonising, militarily occupying, and besieging an indigenous population (Palestine) who have no army or comparable amount of power. Israel is a state built on the bloodshed of hundreds of thousands of Palestinians - mostly women and children, and the destruction of thousands of Palestinian towns and villages. It is able to sustain its existence by killing Palestinians, keeping 1.2 million Palestinians as refugees, illegally banning their right to return, and keeping the remaining 3 million Palestinians under illegal military occupation and restriction. Suggesting co-existence as things currently stand, and sitting on the fence, means you agree with the continued oppression, killing and exile of indigenous Palestinians until they are wiped from existence entirely.<br /><br />A struggle for freedom cannot coexist with an occupying oppressor, so you cannot simply advocate for ‘peace’ here. Wishing peace is also an empty statement that robs Palestinians of their right to have their struggle for freedom recognised, and shields Israel and its government from being held accountable for its ethnic cleansing, colonisation, military occupation, international law and human rights violations. How can there be peace without freedom? You are either with humanity or with war. You are either for liberation or for genocide. Even on the most basic level, if we can allow over 10,000 children to be killed in 8 weeks while choosing to stay silent because it's ‘war’ or it's ‘too complicated,’ the kind of world that we will be creating will be a world where your child's life, ANY child's life, will hold no value. There is a future for Palestinians on the horizon and by taking a side we have the ability to ensure it is a dignified and safe one.<br /><br />Sources:<br /><br />[@key48return](https://www.instagram.com/key48return/)<br /><br />[@thatlawyermomlife](https://www.instagram.com/thatlawyermomlife/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 917674484,
    "text": "**Short:** This situation actually has almost nothing to do with religion. It’s also not just a fight about land. Before the establishment of Israel, Palestinian Christians, Jews, and Muslims coexisted peacefully. The oldest Christian community in the world is Palestinian. Both Palestinian Christians and Jews, face oppression by Israel. Framing the suffering of Palestinians as a religious conflict is also factually inaccurate and perpetuates Islamophobia, which then contributes to the dehumanisation of Arabs around the world. The Zionist narrative also benefits from presenting this as a 'religious conflict,' by allowing Israel to spread misinformation about its colonial past and present, and evade accountability for its actions since 1948 -  including the ethnic cleansing of Palestinian cities and villages, the displacement of millions, and the denial of their right to return. Saying it's a 'religious conflict' also ultimately denies Palestinians their right to liberation, freedom, and justice because this framing makes the entire thing seem trivial and primes you to look away when it's anything but and you definitely shouldn’t!<br /><br />**Long:** This situation has almost nothing to do with religion. It’s also not just a fight about land. Before the creation of 'Israel' only 75 years ago, Palestinian Christians, Jews and Muslims all peacefully co-existed in Palestine. The Palestinian Christian community is the oldest Christian community in the world. There are Palestinian Christians and Palestinian Jews, and both are oppressed by Israel. So making the suffering of Palestinians seem like it’s a result of their religion is just factually incorrect. Also implying this is just another religious conflict in the Middle East perpetuated by Muslims, also furthers an Islamophobic narrative that is consistently used to dehumanise Arabs, and has real-world implications for their safety.<br /><br />It also benefits the Zionist narrative to have you believe this is simply a conflict, and it's about religion. Israel consistently spreads misinformation about its own colonial existence in order to conceal the true extent of their harm to Palestinians, and over-inflates its ties to religion in order to justify it. They also know it is a lot easier for the majority of us to disassociate ourselves from a situation that has been wrongfully minimised to a 'religious conflict that’s happened since the beginning of time.’ Israel also hides behind this religious narrative to give weight to their ‘promises’ (and therefore right to claim) Palestinian land that stems from the Hebrew bible. Viewing Israel as a Jewish homeland also helps to distract from the fact that the state of Israel didn't even exist before 1948. In reality, the state of Israel only exists because of Zionists (who are not necessarily always Jewish, in fact, many aren't) who ethnically cleansed, massacred and destroyed over 540+ Palestinian towns and villages and made 7.2 million Palestinian refugees. In fact, the only reason Jews were even given a homeland was completely political and was a result of the UK looking to rid itself of the ‘Jewish problem’ it was left with after the holocaust.<br /><br />Saying it's a 'religious conflict' also ultimately denies Palestinians their right to liberation, freedom, and justice because this framing makes the entire thing seem trivial and primes you to look away, when it's anything but and you definitely shouldn’t!<br /><br />Sources:<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 43816875,
    "text": "**The war will pass, and things will go back to normal/Israel will eventually accept a peace deal.**<br /><br />**Short:** The current \"normal\" for Palestinians is unsustainable, and inhumane and has resulted in their genocide. Also, assuming that there is even a normal for them to return to is meaningless when you understand the traumatic loss of life and infrastructure. Gaza will never be the same again. Israel, with the support of the U.S. and EU, refuses a ceasefire, driven by their political interests in overtaking Gaza and accessing power and resources. Also, the majority of Israelis, influenced by an alternate historical narrative and deep propaganda, lack empathy for Palestinians and view them through a dehumanised lens. On top of all of this, Israeli society is becoming more extreme and nationalistic and hell-bent on destroying Palestine to ensure Israeli ‘safety’, making Israeli-led change extremely unlikely. The path to Palestinian liberation, similar to South Africa's apartheid, lies in external pressure through things like consumer and corporate boycotts and sanctions from the political elite. Peace will not come from Israel.<br /><br />**Long:** Firstly we need to ask, what ‘normal’ is that? The current normal for the Palestinians was already unsustainable, and inhumane and has resulted in their genocide. It is clear that whatever the outcome of the ‘conflict’, returning to normal is not an option for the Palestinians - nor at all possible due to the severe loss of life, trauma and decimation of homes, schools, hospitals and other essential resources. Gaza will never be the same again. Secondly, Israel will never willingly make a peace deal with Palestinians. Not only is Joe Biden actively and proudly standing alongside Netanhayu in his refusal to enact a ceasefire, but Israel and the West have a lot to gain from overtaking Gaza and eradicating Palestinians. Namely regional power, and access to abundant oil and gas reserves. <br /><br />Another reason peace will not come from Israel is that the vast majority of Israelis, along with Zionists around the world, live in an alternate universe with alternate historical facts that feed more nationalism, militarism, and extremism. Also, the past 75 years of conflict have dehumanised Palestinians in the eyes of Israelis. Israelis as a collective are not able to empathise with Palestinians, they aren't able to comprehend Palestinian suffering - this phenomenon is widely documented. So when the IDF bombs Gaza and kills children, the average Israelis thinks that a) it is the Palestinian's fault for not agreeing to peace and for continuing to threaten and attack Israel, etc. and b) Israel is merely defending itself and there is simply no alternative.<br /><br />Of course, there are some Israeli leftists and anti-Zionist Israelis who fight for Palestinian liberation. But it's a tiny minority. Most Israelis don't consider what it means for Palestinian freedom, dignity, and physical well-being to be systematically erased. Israel is, by every definition, an apartheid state. If a Jew and an Arab commit the exact same crime in the West Bank, they will face two different legal systems. The Jew will face a civil court, the Arab will face a military court. Two legal systems for two different groups. Things like these show us that it is near impossible for Israel to willingly end the occupation and agree to a just solution to the conflict because they are benefitting from the current state of affairs. Peace will not come from within Israel.<br /><br />Israeli society is also getting more extreme, more nationalistic, more violent, and more entrenched in its<br />own historical narrative and its own self-victimisation. At this point, it is simply delusional to expect that change will come from Israel. The only thing that can bring Palestinian liberation is if the cost of the occupation outweighs its benefits. And that requires, just like for the apartheid in South Africa, massive external pressure. That means consumer boycott of Israeli goods, corporate boycott of Israeli technology, and sanctions by Israel's main trade partner and political supporters, the US and EU. Those are the only measures that can meaningfully push Israel toward ending the occupation and achieving true peace and thankfully are pretty easy for you to do.<br /><br />[Video](https://www.instagram.com/p/Cy6GVHfuj_R/): What Israel really wants and why it won’t settle for ‘peace’ <br /><br />Sources:<br /><br />[@raphmim](https://www.instagram.com/nouraerakat/): *we think it’s especially important to note that the majority of this answer was pulled directly from comments made by a former Zionist-Israeli*<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3261794179,
    "text": "**It’s too much. It’s too sad. I have to protect my peace.**<br /><br />**Short:** This is not an attack on you, but hopefully a way to enable you to break free from the comfort of using 'mental health' as a shield to disengage from the world. We have a responsibility to each other to care, and distance breeds hate and indifference. Choosing to stay uninformed creates numbness and hurt over time. Avoiding pain won't make you stronger; it will build walls and erode your empathy. Leaning into discomfort is what fosters empathy, solidarity, and community. Your inaction and refusal to engage may also be hurting people you care about, particularly those who don’t have the option to look away. While genocide has obviously been around for centuries, the difference now is the widespread access to information. Protecting your peace should not be an excuse to ignore readily available information. Silence is complicity, and your voice can make a difference in supporting justice and awareness. The protests and boycotts are making an impact, and using your voice or taking even the smallest action, can sustain the momentum and keep us in the direction of positive change.<br /><br />**Long:** Firstly, I will state that this is not an attack. This is an attempt to reach out and awaken you, and rid you of the safety blanket that uses your ‘mental health’ against you to keep you disengaged from the world. As much as we have a responsibility over ourselves, we have an even bigger responsibility towards each other. A detached and distant society can do nothing to disrupt the system that benefits from oppressing people. Detachment and distance is what breeds hate, violence and indifference. There is also a difference between not knowing what to say because you are uninformed and *choosing to remain* uninformed so you won't have to say anything or pretend to care. I get that this feels big, and heavy and raises an infinite amount of hard to grapple with questions about the world we live in. <br /><br />But, turning away from pain and suffering will not make you stronger or keep you from being traumatised, but it will harden you and build walls of protection so high, you will lose empathy for others and the world. Leaning into pain and suffering, witnessing struggles, allowing yourself to feel the disgust, the anger, the nausea that comes along with injustice and grief won't traumatise you. Leaning in and expressing pain builds empathy, solidarity, community, support, and in turn it will help you grieve accordingly to PREVENT traumatization. This culture of individualisms creates nothing but numbness and greed.<br /><br />I also think it’s extremely important to consider that you may be currently surrounded by people who are deeply hurt by your inaction and silence. You may not even be aware you are currently being given the benefit of the doubt. Thousands of children are being murdered by a genocidal regime. The victims and survivors of genocide have begged the world to share their stories and do all we can to raise awareness about what they're suffering through. Protecting your peace first and foremost, will always mean you cannot engage meaningfully with reality, and you may unintentionally harm those you care about, particularly those who do not have a choice about whether they look away.<br /><br />Genocide and ethnic cleansing has of course been happening for centuries. What's different is that now, even though there are challenges, many more people have access to information than before. Taking care of your mental health is important, but it's not an excuse to ignore information that is so readily available to you. Silence is enablement. Silence is complicity. The protests are working, the boycotting is working. Never before in history have this many people stood behind Palestine. Politicians are starting to come around. You can keep the momentum going, by using your voice and not looking away. Your voice is your power and your privilege and your gift, how are you choosing to use it? <br /><br />[Video](https://www.instagram.com/p/CzRV__8tU4y/): On the obsession with self-care in times of conflict <br /><br />[Post](https://www.instagram.com/p/Cy25u_GsjWm/?img_index=1): “To my non-Arab friends”<br /><br />[Post](https://www.instagram.com/p/CzO1ZQDxzoR/?img_index=1): Be angry<br /><br />Sources:<br /><br />[@micheline.maalouf](https://www.instagram.com/micheline.maalouf/)<br /><br />[@moontwerk](https://www.instagram.com/moontwerk/)<br /><br />[@tmobarak](https://www.instagram.com/tmobarak/)<br /><br />[@ashoncrawley](https://twitter.com/ashoncrawley)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 2162786026,
    "text": "**Short:** Palestinians cannot simply leave Palestine as it’s their homeland and deeply tied to their historic, ethnic, and cultural identity. They also have a legal right to live, work, create, farm and enjoy the land. Leaving is not a practical solution, nor is it fair to suggest to people who are facing violent displacement from their own homes. But this is especially so when all would-be exit points are sealed off by Israel. They quite literally have nowhere to go. Attempts for civilians to flee towards Egypt are met with attacks from the IDF, making escape impossible and just as dangerous as staying put. Expecting Palestinians to flee to other countries also overlooks the burden placed on neighbouring countries, like Lebanon, which is economically strained and already hosting large refugee populations. It also assumes that all Arabs are the same, and will easily assimilate to other areas in the Middle East, ignoring the differences in dialect, culture and more that pose even more challenges for both the Palestinians and the people of the host nations. Palestinians have a right to live in their homeland with dignity and respect and also have a deeply vital connection to their land that sustains their communities, culture, and means of survival. Suggesting they up and leave is inhumane and something we would never ask of ourselves in the same circumstances. Palestinians aren’t asking for anything more than me or you would in the same situation, and I know you can understand why they have a right to have those needs met.<br /><br />**Long:** Palestinians can't simply leave Palestine because it's their homeland. Palestinians are indigenous to Palestine, a land where they have historic, ethnic and cultural ties, as well as a legal right to inhabit. Palestinians have lived in Palestine for hundreds of years, and their connection to the land is an essential part of their identity. Leaving is also not a practical or just solution for people at the mercy of violent displacement and occupation. It also ignores the fact that there are currently no ways to exit Palestine, as all exit points have been sealed off, particularly the one leading to Egypt where Israel is currently trying to herd the Palestinians. Not only are Palestinians physically unable to leave, but the ‘safe’ corridors created to force them closer to the Egyptian border are patrolled and bombed by the IDF, and hundreds of Palestinians are being killed as they attempt to ‘flee’. Similarly, the neighbouring countries such as Lebanon, are unfairly expected to take on hundreds of thousands more refugees, despite facing near-economic collapse, and also already hosting millions of Palestinian and Syrian refugees in overflowing refugee camps. It also assumes that all Arabs are the same, and will easily assimilate to other areas in the Middle East, ignoring the differences in dialect, culture and more that pose even more challenges for both the Palestinians and the people of the host nations.<br /><br />Expecting Palestinians to leave their homeland is an expectation that needs to be challenged. To put yourself in their shoes, it would be wholly unreasonable to expect that you should leave your belongings, family, pets and life behind to submit to an oppressive regime. You also wouldn’t ask Indigenous Australians to up and leave, and make other countries foot the bill of their displacement. Asking Palestinians to leave is an ethnic cleansing. Palestinians aspire to and have the right to live in their homeland with their rights and dignity respected, just like people in any other part of the world. Palestinians are also historically a farming society, with 65% of Palestinians being farmers or from farming families. Palestinian communities rely directly on their land for material sustenance. Without it, they would lose their communities, culture and their means for survival. Israel is acutely aware of this, and this is partly why Zionist settlers uproot Palestinians' olive trees and other crops as a means to erase their identity and belonging. Suggesting they up and leave is inhumane and something we would never ask of ourselves in the same circumstances. Palestinians aren’t asking for anything more than me or you would be in the same situation, and I know you can understand why they have a right to have those needs met.<br /><br />Sources:<br /><br />[@letstalkpalestine](https://www.instagram.com/letstalkpalestine)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 1757723881,
    "text": "**Short:** In the late 1980s, Palestinians in Gaza engaged in non-violent protests, strikes, and boycotts. No Israelis were killed as a result of any of these actions. But in response, Israel killed 214 Palestinians and injured thousands. The 2005 non-violent BDS movement was accused of wanting to destroy Israel, with Israel labelling BDS supporters as antisemitic. Then, tens of thousands of unarmed Palestinian civilians marched in 2018 for the right of return, resulting in 223 killed and over 6,000 left with life-changing wounds. Palestinian non-violent resistance consistently meets deadly and disproportionate violence from Israel, even for the most tiny actions like social media engagement. This is authoritarianism. And how should we expect people to fight back against authoritarianism? When even your seemingly harmless actions, such as liking an Instagram post, can result in your imprisonment or death, there is no amount of peaceful resistance possible that will have any meaningful impact on changing the situation happening around you. Violent resistance as a result of occupation is also protected under international law. Any violent resistance from a Palestinian is clearly the justifiable result of being backed into a corner for 75 years.<br /><br />**Long:** From late 1987 to 1988, Palestinians in Gaza rose up in a series of non-violent demonstrations, strikes, boycotts and protests. They killed 0 Israelis. They were unarmed. In response, Israel killed 214 Palestinians in Gaza and injured thousands more. In 2005, Palestinians organised a non-violent movement, Boycott, Divestment & Sanctions (BDS) In response, Israel a) said the movement's true goal is to destroy Israel, b) called BDS supporters antisemitic, and c) punished its founder by threatening to expel him from his home. Then, in March 2018 tens of thousands of Palestinian civilians marched to the fence illegally built by Israel, unarmed, demanding the right of return. Israel killed 223 Palestinians, and Israeli snipers left 6,106 Palestinians with life-changing wounds and 30,000 more injured. Not a single Israeli experienced any major physical harm, nor were any killed.<br /><br />In the vast majority of cases of Palestinian non-violent resistance, Israel has responded and continues to respond with deadly and disproportionate violence. Even when Palestinians are not taking to the streets, Israel punshines, kills, imprisons and sanctions Palestinians for their existence on a daily basis. Palestinians are also treated most violently when they display or engage in even the smallest resistance behaviours, such as following pro-Palestine accounts on social media. This kind of surveillance and political repression is a fixture of daily life for Palestinians. But this is also authoritarianism. And how should we expect people to fight back against authoritarianism? Israeli soldiers are showing up to Palestinian homes and businesses, sometimes in the middle of the night, and arresting those who share posts condemning the bombing of innocent Palestinians in Gaza online. What are they expected to do? Share more posts that will also get them arrested or killed. <br /><br />When even your seemingly harmless actions, such as liking an Instagram post, can result in your imprisonment or death, there is no amount of peaceful resistance possible that will have any meaningful impact on changing the situation happening around you. Violent resistance as a result of occupation is also protected under international law. Any violent resistance from a Palestinian is clearly the justifiable result of being backed into a corner for 75 years.<br /><br />[Video](https://www.instagram.com/p/Cy0477FsTiE/): Did you know Israel arms its civilians? <br /><br />[Video](https://twitter.com/CensoredMen/status/1723686286165254414): It’s better to lose your life than live under occupation<br /><br />Sources:<br />[@_ZachFoster](https://twitter.com/_ZachFoster/status/1716497689787949232)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 2523042848,
    "text": "Because it is not controlled by them. The 75 year long Israeli occupation of Gaza, with increasingly strict sanctions since Hamas came into power, means that the state of Israel entirely controls Palestinians water, fuel, food, medicine, electricity, imports, exports, fishing rights, and all human movement inside and out of the territory and it encircles it militarily. Currently Israel is committing war crimes by shutting off electricity, water and fuel. As a result 95% of the water in Palestine is currently contaminated. In normal circumstances, the citizens of occupied Palestine are still only given access to electricity for less than 12 hours a day.<br /><br />Sources:<br /><br />[@paliroots](https://www.instagram.com/paliroots/)<br /><br />[@adamjohnsonCHI](https://twitter.com/adamjohnsonCHI)<br /><br />[@depechesmode](https://twitter.com/depechesmode)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 2396752862,
    "text": "**Does saying ‘Free Palestine’ mean I'm anti-semitic?**<br /><br />**Short:** No, saying \"Free Palestine\" is not anti-semitic; it advocates for ending the Israeli occupation that has deprived Palestinians of their basic human rights for 75 years. It calls to stop confining 2.3 million Palestinians, including half whom are children, in the world's largest open-air prison, and to dismantle the imposed apartheid system. The movement seeks liberation for all residents, regardless of their religious or ethnic background, and doesn't target Judaism. Instead, it embraces Judaism as part of the broader call for justice and liberation. The goal of freeing Palestine is to establish a democratic state that ensures self-determination and human rights for everyone.<br /><br />**Long:** No. Saying “Free Palestine” does not mean you are anti-semitic or “want all the Jews gone.” Free Palestine means free Palestinians from the Israeli occupation that’s been robbing them of their basic human rights for 75 years. It means stop caging 2.3 million Palestinians in the world’s largest open-air prison, half of whom are children. It means ending apartheid imposed by the Israeli government. It means giving the Palestinians control over the basic infrastructure in their land.<br /><br />Advocating for a free and liberated Palestine includes Jewish, Christian, Muslim, Druze and all residents. The movement does not single out or attack Judaism as a religion or people, in fact it embraces it as an integral part of the movement towards liberation for all. A Free Palestine calls for justice and liberation, both for Palestinians in the West Bank, Gaza, Jerusalem and the 48 occupied territories as well as justice and liberation for the oppressed Jews within the Israeli state including Mizrahi and Ethiopian Jews. It hopes to create a truly democratic state in which self-determination and human rights are available for everyone.<br /><br />Sources:<br /><br />[@najwazebian](https://www.instagram.com/najwazebian/)<br /><br />[@theslowfactory](https://www.instagram.com/theslowfactory)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3038078369,
    "text": "**Isn’t the statement ‘From the River to the Sea, Palestine will be free’ calling for Genocide against Jews?**<br /><br />**Short**: Simply put, no. The idea that the phrase is a call for genocide against the Jewish population is completely unfounded and stems from deliberate Zionist misrepresentation. The phrase was coined in the 1960s during the formation of Palestinian liberation and was always advocating for a democratic state where Christians, Muslims, and Jews could coexist with equal rights. The historical borders of Palestine are from the Jordan River to the Mediterranean Sea, and the chant symbolises a plea for universal Palestinian rights, land back and freedom of movement, which are currently restricted by the Israeli occupation, including its military blockades and checkpoints. If we’re going to question alleged genocidal chants, we need to also question actual genocidal chants, such as those coming out of Israel and which are topping the charts.<br /><br />**Long**:  Simply put, no. If we break down the phrase word by word, it becomes immediately clear the genocidal implications of the language used require an extremely loaded and presumptive interpretation of what is actually being said. If we can understand that the phrase ‘Black Lives Matter’ is not saying white lives don’t matter, we can understand that saying Palestinians will be free ‘from the river to the sea’ is not calling for genocide against the Jewish population. <br /><br />This interpretation of the phrase was born out of the mouths of Zionists, who once again are co-opting antisemitism and deploying it recklessly to undermine the liberation of Palestinians. Many Jews understand and support this phrase, as it is intended to be used - to call for justice. The phrase was coined in the 1960s when the Palestinian liberation was formed, and it was created to signify one democratic state for ALL 3 religions (Christians, Muslims and Jews) to coexist and share the land as equals. <br /><br />The historical borders of Palestine are from the Jordan River to the Mediterranean Sea. This call is asking for every Palestinian to have equal rights across their entire land, something which they currently do not have. Not even American or UK citizens with Palestinian heritage have freedom of movement within Palestine. If a Jewish American flew to Palestine, they would be able to land at the Israeli airport. A Palestinian American must fly through Jordan. Palestinians in Gaza and the West Bank, cannot even move freely between suburbs/cities due to military blockades and Israeli checkpoints. The entire Gaza Strip borders the sea, many Gazans live just 10 minutes from it and can see and smell the ocean from their rooftops, yet the majority of the 2.2 million people living in Gaza have never set foot on the shore. <br /><br />Lastly, if we’re going to criticise genocidal chants, which aren’t even genocidal, what about the multitude of Arab and Palestinian songs Israelis have co-opted to include lyrics calling to kill all Palestinian animals and watch them burn and struggle under the rubble, while they dance in military uniforms on occupied territory? Currently, the no. 1 song in the Israeli charts is a pop song that specifically calls to eradicate all Palestinians. We don’t need to spend time looking for hidden meanings in phrases such as from the river to the sea when there are blatant, explicit calls for genocide coming out of Israel on a daily basis. <br /><br />[Video](https://www.instagram.com/reel/C0ewo4Rtp79/?utm_source=ig_web_copy_link): Listen to the Israeli chart topper here <br /><br />Sources:<br /><br />[@samah_sabawi](http://www.instagram.com/samah_sabawi)<br /><br />[@hasandpiker](https://www.instagram.com/hasandpiker/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 1737195364,
    "text": "**Doesn’t Israel have a right to defend itself?**<br /><br />**Short:**  The Israeli state had the right to defend its people from the militants who attacked as it was happening on Oct. 7th. But that was a one-day event; they can't then follow that by spending an indefinite amount of time massacring Palestinian civilians as revenge. Plus, under international law, the Israeli government actually has a responsibility to protect civilians under its occupation, meaning Palestinians. The Israeli government declaring war on the same territory it occupies is not just contradictory, it leaves Palestinians doubly vulnerable because they are occupied and then attacked under occupation by those occupiers. The Israeli government does not have a right, morally or legally to do either of those things. The International Court of Justice has actually rejected Israel's interpretation of the right to self-defence, stating that attacks on Israel by Palestinians do not meet the criteria for invoking Article 51 of the UN Charter. The ongoing double standard in the Palestine/Israel ‘conflict’ is obvious when we start justifying Israeli violence while condemning any Palestinian response. Regardless of where you stand, it should be clear that self-defence doesn’t include killing children, bombing hospitals, bombing aid trucks, bombing schools and refugee camps, cutting off food and water and displacing millions of people. <br /><br />**Long:** The Israeli state had the right to defend its people from the militants who attacked as it was happening on Oct. 7th. But that was a one-day event; they can't then follow that by spending an indefinite amount of time massacring Palestinian civilians as revenge. As the occupying power of the Palestinian territories, the Israeli government has an obligation to protect the civilians under its occupation. So it cannot simultaneously occupy the territory, thus taking over the self-governing powers that would otherwise belong to Palestinians, and then declaring war upon them.<br /><br />These contradictory policies (occupying land and then declaring war on it) make the Palestinian population even more vulnerable. The unstable and unsafe conditions Palestinians suffer are Israel's responsibility. Israel argues that it can invoke the right to self-defence under international law as defined in Article 51 of the UN Charter. The International Court of Justice, however, rejected this. The ICJ explained that an armed attack that would trigger Article 51 must be attributable to a sovereign state - but the armed attacks by Palestinians emerge from a land which Israel controls. While Israel does have the right to defend itself against rocket attacks, it must do so in accordance with occupation law which balances military advantage, civilian suffering and proportionality. We can see that morally and legally, it is doing none of those things.<br /><br />The basic double standard of the Palestine/Israel ‘conflict’ is also that any Palestinian violence justifies any Israeli violence, but no Israeli violence ever justifies any Palestinian violence. Even if you believe Israel is ‘defending’ itself after the Hamas attacks, what do you think defence looks like? Is defence collectively punishing a population of more than 2 million people, publicly calling for genocide, cutting off food, water, and power, and indiscriminately bombing them self defence? Do these really seem like the actions of a state defending itself, or is there perhaps more going on? <br /><br />Sources:<br /><br />[@nouraerakat](https://www.instagram.com/nouraerakat/)<br /><br />[@zunguzungu](https://twitter.com/zunguzungu)<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[@aaronjmate](http://www.twitter.com/aaronjmate)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 361472764,
    "text": "**Can you be Jewish and anti-Zionist? (Is it antisemitic to be against Israel?)**<br /><br />**Short:** Yes! Many pro-Palestinian advocates are Jewish, such as those found in organisations like Jewish Voice for Peace which emphasise the importance of Jews condemning Israel. Antisemitism is discrimination against Jews and differs from anti-Zionism which is the rejection of a historical movement founded in 1897 which stated that Jews had exclusive rights to Indigenous Palestine, and called for their expulsion and extermination. Anti-Zionism is not antisemitic, and equating criticism of Israel with antisemitism contributes to a simplified understanding of what the word really means. This approach also reinforces harmful antisemitic cliches and dismisses nuanced discussions by treating any resemblance to these cliches as antisemitism. It’s especially harmful because it’s most often used to deflect criticism of Israel by shifting the focus to a hatred of Jews. The entire premise that it’s antisemitic to be against Israel is a massive part of Israeli government propaganda, and also insulting to a large majority of Jews who are in direct opposition to the actions of Israel and its existence full stop.<br /><br />**Long:** Yes! In fact, many of the most vocal pro-Palestinian advocates are Jewish, including many Rabbis and Orthodox Jews. As long as Zionism existed, there were Jews standing in opposition to it. From the Jewish Labor Bund to Albert Einstein, Hannah Arendt and Judith Butler. Also, organisations like Jewish Voice for Peace demonstrate on a daily basis not only the ability of Jews to stand behind Palestine and condemn Israel but the importance of Jews doing so. Antisemitism is a form of prejudice or discrimination directed toward Jews as individuals or as a group. Zionism actually emerged as a historical movement and a political ideology in 1897 under Theodor Herzl, not a religious one. It stated that Indigenous Palestine belongs solely to the Jewish people, and called for their eradication and displacement. Anti-Zionism is the rejection of a racist and colonial movement. Anti-Zionism is NOT the rejection of Jews, nor is it antisemitic.<br /><br />In fact, relating the idea that it could be considered un-Jewish or antisemitic to condemn Israel plays into the “tropeification” of antisemitism. Rather than thoughtfully considering whether something really invokes hatred of Jews or upholds systems that harm Jews, a ‘tropeified’ understanding of antisemitism compares questionable statements to a multitude of established cliches: blood libel, divided loyalty, world domination, etc. And so according to this logic, if a statement is similar to one of these cliches it’s antisemitic – regardless of the context or the truth. It essentially assumes that antisemitism is built-in to cliches, rather than expressed by them. <br /><br />This mechanical understanding of antisemitism is most often used to neutralise criticism of Israel. In debates, it spurs Zionists to scan anti-Zionist arguments for cliches and then, by calling out ‘antisemitism’, shift the conversation from the other party's arguments to their ‘hatred of Jews.’ The entire premise that it’s antisemitic to be against Israel is a massive part of Israeli government propaganda, and also insulting to a large majority of Jews who are in direct opposition to the actions of Israel and its existence full stop.<br /><br />Sources:<br /><br />[@Em Cohen](https://vashtimedia.com/2021/03/24/formats/opinion/antisemitism-snl-israel-palestine-tropes-zionism-antizionism/comment-page-1/)<br /><br />[@claremontsjp](https://www.instagram.com/claremontsjp)<br /><br />[@jewishvoiceforpeace](https://www.instagram.com/jewishvoiceforpeace/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 1500479971,
    "text": "**Doesn't Israel has the right to exist? and doesn't Jewish people deserve a homeland?**<br /><br />**Short:** Israel as it currently stands should not exist, and the current state of affairs required to maintain its existence are morally reprehensible and illegal. Advocating for dismantling Israel does not mean expelling or eradicating Jews, but simply calls to end an oppressive military occupation that denies indigenous Palestinians their rights. Opposing religious nationalism and exclusionary policies based on religion, race, or ethnicity is essential to create a better world for all of us, and calling for a democratic environment that grants Palestinians full rights is not anti-Jewish, its equality. Also the idea of a Jewish homeland was driven by Zionist beliefs and geopolitical motives, not justified by the Holocaust nor the now debunked bible tales. Jews deserve freedom and protection from persecution, but this shouldn't come at the expense of Palestinians.<br /><br />**Long:** Israel as it currently stands should not exist, and the current state of affairs required to maintain its existence are morally reprehensible and illegal. Calling for the dismantling of Israel is not akin to expelling Jews, nor is it calling for their eradication. It is asking for the dismantling of an oppressive military occupation, that deprives the indigenous inhabitants their land, power and freedoms, and subjects the Palestinians to a 2-class system, with separate roads, schools, laws and more. Religious nationalism in all forms, anywhere, should be condemned. Any state that is founded on exclusionary policies based on religion, race or ethnicity will lead to oppression. Advocating for a democratic environment in which Palestinians have full human and civil rights alongside all other people in the region including those of Jewish descent is not calling for the eradication of Jews, nor depriving them of a place to live, work and build community.<br /><br />The idea that Jewish people deserve a homeland is a Zionist belief, and one that millions of Jews worldwide denounce. The atrocities of the holocaust do not justify a repetition of this same fate for a different ethnic group. In fact, the call for a Jewish homeland was posited by Zionists and endorsed by the British government, who were keen to wipe their hands clean of the ‘Jewish problem’ that it claimed was left after the war and gain a foothold in the Middle East. The creation of Israel was purely political, and utilised debunked tales from the Hebrew bible as justification. Jews have a right to exist freely and not face persecution, just like any other people. But they do not deserve these things at the expense of Palestinians.<br /><br />Sources:<br /><br />[@raadbarhoush](https://www.instagram.com/raadbarhoush/)<br /><br />[@theslowfactory](http://www.instagram.com/theslowfactory)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 2421495898,
    "text": "**What is Zionism?**<br /><br />Zionism is a political and ideological movement that emerged in the late 19th century, advocating for the establishment of a Jewish homeland in Palestine. The term is derived from \"Zion,\" a biblical reference to Jerusalem. The Zionist movement gained momentum in response to increasing anti-Semitism in Europe. The most notable event was the publication of \"Theodor Herzl's\" book \"Der Judenstaat\" (\"The Jewish State\") in 1896, where he called for the creation of a Jewish state in Palestine. Zionism led to the establishment of the State of Israel in 1948, and the subsequent Nakba in which 800,000 Palestinians were forcibly displaced, 15,000 violently killed and thousands more maimed, raped, imprisoned, abused and tortured.<br /><br />**What does it mean if I denounce Zionism?**<br /><br />It means opposing the political ideology of Zionism, which has resulted in the expulsion of millions of Indigenous Palestinians from their land and homes. It means standing against the creation of a nation-state with exclusive rights for Jews above others on the land. Anti-Zionism supports liberation and justice for the Palestinian people, including their right to return to their homes and land. Anti-Zionists believe in a future where all people on the land live in freedom, safety and equality. Opposition to the political movement of Zionism and/or the policies of the state of Israel is no different from criticism of any other political ideology or policies of any other nation-state.<br /><br />Sources:<br /><br />[@jewishvoiceforpeace](https://www.instagram.com/jewishvoiceforpeace/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 3942158222,
    "text": "**How is this a genocide for Palestinians? And why is it not a war?**<br /><br />**Short:** Firstly, this is not a war because Palestine has no army. When Israel attacks Hamas/Palestine, it is attacking civilians. Referring to it as the \"Israel-Hamas war\" is misleading, as it’s really an ethnic purge of all Palestinians. The situation in Gaza goes beyond mass killings; it qualifies as genocide based on intentional, systematic efforts by Israel to cause serious harm and death to Palestinians. Israel's own Prime Minister and political leaders are proudly admitting to this fact. Israeli actions align with the stages of genocide, fitting the definitions of racial classification, discrimination, dehumanization, organization, polarization, preparation (such as the land invasion of Gaza), persecution (prolonged siege), and extermination through bombings and targeting of entire bloodlines. This genocide is a culmination of a long-term plan, and the current events are the final, darkest stage.<br /><br />**Long:** Firstly, this is not a war because Palestine has no army. When Israel attacks Hamas/Palestine, it is attacking civilians. Calling it the “Israel-Hamas war” creates the false impression that this is a war that is directed exclusively at Hamas when it’s really an ethnic purge that is directed at all Palestinians in Gaza. The child body count alone makes it clear that this isn’t just a war against Hamas.<br /><br />Secondly, talking about a genocide in Gaza isn't exaggerating. Genocide isn’t a synonym for \"mass killings\", it is the intentional and systematic act of causing serious harm or death to a large group of people, often based on their ethnicity, nationality, religion, or other identifiable characteristics. The current actions of Israel are a deliberate attempt to destroy Gaza as an entity and wipe out enough Palestinians in order to weaken an entire people, in Netanyahu's own words, \"for generations…finish them off and don't leave anyone behind. Erase the memory of them. Erase them, their families, mothers and children. These animals can no longer live.” Genocides also never come out of nowhere. They are always the deadly culmination of a long-term process. The main framework of genocide breaks these processes down into 9 stages (and a later stage of denial). While Israel has long been considered to have completed at least the first 8 stages, it is clear that its actions in Gaza represent the beginning of the final - and darkest - stage.<br /><br />The stages are as follows: Classification and symbolization, Discrimination, Dehumanization, Organization, Polarisation, Preparation, Persecution, and Extermination. Israel's strict racial classification of Palestinian and Jewish populations, discriminatory practices, and dehumanising rhetoric contribute to Palestinian oppression. The highly organised Israeli army and militant settler groups, coupled with hate propaganda and polarisation, dehumanise Palestinians. Israel's preparation for mass extermination, marked by its land invasion of Gaza, is how it carries out genocide. The persecution stage involves genocidal acts, such as the prolonged siege of Gaza, pushing millions to the brink of death. The final stage, extermination, is underway, with Israel using bombs, killing entire families, and signalling a full-scale extermination through a land invasion.<br /><br />[Video](https://twitter.com/hahauenstein/status/1723441134221869453): Even Israel admits this is a genocide <br /><br />[Post](https://www.instagram.com/p/Cy3cMzdLA0i/): The 8 Stages of White Settler-Colonial Denial <br /><br />Sources:<br />[@caitoz](https://twitter.com/caitoz)<br />[@letstalkpalestine](https://www.instagram.com/letstalkpalestine/)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 38287913,
    "text": "**Don't Jews and Israelis have a right to fear for their lives too right now?.**<br /><br />*This response has pulled together statements made by Jewish people, and it reads in this context. Please make this clear if you are to share it further.*<br /><br />A lot of the fear I'm seeing from Jews is manufactured and unwarranted. Or, this fear is being weaponized to justify islamophobic behaviour and to avoid accountability. I have yet to see anything genuinely materialise that could pose an actual threat toward Jews in the United States. I have not seen Palestinians, activists, or any group of people, call for violence against Jews at any rallies or on the internet. I think the Jewish community has to reckon with the fact that while antisemitism is absolutely real and very present in this world, we've adopted an unhealthy identity of perpetual victimhood. Just because we are sometimes victims does not mean we can't also become oppressors. White Jews, like any other white person, have an immense amount of privilege, and yet, since October 7th, white Jews in the United States seem to be crying the loudest out of anyone about being oppressed, threatened and scared. It's a false narrative and it's incredibly self-serving while entire families are literally being bombed out of existence in Gaza. The fact that every time someone posts about Palestinian liberation, they also feel pressured to include a disclaimer that \"antisemitism is also bad\" to avoid being attacked is proof of this.<br /><br />Similarly, Israel invoking Holocaust analogies and incessantly wielding anti-semitism as a weapon is not about safeguarding and protecting fellow Jewish people. It’s all designed to (1) make non-Jewish ppl afraid to speak up, and (2) manufacture consent for Palestinian genocide. Whether by fear or any other means, Israel has always needed to invest a lot of time and money into enlisting Jews from the diaspora to become settlers in occupied Palestine. Israel relies on us to populate, police, and justify their settler-colony and genocide.<br /><br />Sources: (in paragraph order)<br /><br />[@joshxhoffman](https://twitter.com/joshxhoffman)<br /><br />[@agelender](https://www.instagram.com/agelender)<br /><br />This answer is taken from the document [Palestine: in Conversation Document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs).<br /><br />",
    "responderId": 3918263088,
    "source": {
      "type": "googledoc",
      "reference": "https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1&fbclid=IwAR31dX1VTjTiQRPBgdu-jeocUOhqXZcPCnsWFthV4VFLhjCya9_A22ZpQEs"
    }
  },
  {
    "id": 974295715,
    "text": "* By reading articles and documents:<br />  * [A guide to Palestine for Beginners / FAQ](https://docs.google.com/document/d/1lgiFGdUKiPfzC-xo6LZQXvGNIXGHyMYsGCA035kKc80/mobilebasic?fbclid=PAAaYY_2VjYc9JEDfDNGsUbIqP7asPt5VTbMFbT-0QmoFWop9eTouVjArk7-0_aem_AdrsDFBZsjh8HPwmlGWJKYBWtCsMng8qjg5PLM1tUy9aTuJxBJWgGL1Z2B156rBfIXw)<br />   * [Israeli forces are responsible for many of its own deaths on October 7th](https://mondoweiss.net/2023/10/a-growing-number-of-reports-indicate-israeli-forces-responsible-for-israeli-civilian-and-military-deaths-following-october-7-attack/)<br />   * [Explanations for war are not excuses](https://nymag.com/intelligencer/2023/10/israel-gaza-war-manufactured-consent.html?fbclid=PAAaYkBBt_dNfBf81P3cj4TzCtmP7kl7vUj1y77HIamb3NUeXkv2h-hV6tcng_aem_AVQVNt-IxhLDilPG-52dc5kHHwplE7LVyShh0ct12F_1Z6TrQaWU_8bulk2-CX--iJo)<br />   * [Antisemitism isn’t a set of tropes, and thinking about it that way helps nobody](https://vashtimedia.com/2021/03/24/formats/opinion/antisemitism-snl-israel-palestine-tropes-zionism-antizionism/comment-page-1/)<br />* By watching educational youtube videos:<br />  * [Historian Explains the Israeli Apartheid Regime](https://www.youtube.com/watch?v=hyDZeWwsykM)<br />  * [برنامج قصة فلسطين](https://www.youtube.com/playlist?list=PL5sA3mjpH7wCGL-qqwShh0t7XD-6xCRNp)<br />  * [فلسطين ... حكاية الأرض](https://www.youtube.com/watch?v=f0oy-NicIgE)<br />  * [Israel's Apartheid Against Palestinians: Cruel System of Domination and Crime Against Humanity](https://www.youtube.com/watch?v=CoFjbnvkmQ0&t=1)<br />* By reading educational tweets:<br />  * [A compilation thread of info sheets on Israeli Apartheid, Settler Terrorism and the Blockade on Gaza](https://twitter.com/gldenyears/status/1711417109618503999)<br />  * [Here’s what Israel has really been doing. A look at life in occupied Palestine](https://twitter.com/Hmz290/status/1711388886750900676)<br />  * [Zionist lies are Zionist confessions](https://twitter.com/shxmsm/status/1719178733943222399)<br />  * [The Palestinian “Stolen Generation”](https://twitter.com/tastefullysaucy/status/1723254918448820331)<br />  * [Barnaby Raine, a Jewish PhD student, breaks down the conflict in all its brutality](https://twitter.com/danish_amooz/status/1714759771880911134)<br />  * [The myth of Israeli Self Defense](https://twitter.com/DoubleDownNews/status/1713128051356082550)<br />  * [Israeli Propaganda is not Sustainable](https://twitter.com/davenewworld_2/status/1717410039013515502)<br />* By following the news:<br />  * [Al Jazeera](https://www.instagram.com/aljazeeraenglish/)<br />  * [Middle East Eye](https://www.instagram.com/middleeasteye/)<br />  * [IMEU](https://www.instagram.com/theimeu)<br />  * [AJ+](https://www.instagram.com/ajplus/)<br />  * [shaunking](https://www.instagram.com/shaunking/)<br />* By following active Pro-Palestinian voices on Instagram:<br />  * [@sim_bookstagrams_badly](https://www.instagram.com/sim_bookstagrams_badly/)<br />  * [@slowfactory](https://www.instagram.com/theslowfactory/?hl=en)<br />  * [@sainthoax](https://www.instagram.com/sainthoax/)<br />  * [@k.w.bogen](https://www.instagram.com/k.w.bogen/)<br />* By reading and watching specific Instagram posts:<br />  * [A family story during war from Gaza city](https://www.instagram.com/p/CziRlqWuuIs/?img_index=1)<br />  * [Israeli Apartheid for beginners](https://www.instagram.com/p/CyswI0MtoUw/?img_index=1)<br />  * [Most of us have a selective memory of history - yes, even the Holocaust](https://www.instagram.com/p/Cy86chzr4LF/?img_index=1)<br />  * [Let’s say it’s all true. What does that really mean?](https://www.instagram.com/p/CzJv6j2LIPE/?img_index=1)<br />  * [Basic questions you have about Gaza and Israel but are too afraid to ask](https://www.instagram.com/p/CyR0YvuP19J/)<br />  * [Myths about the Nakba debunked](https://www.instagram.com/p/CzM2Cs5OvZL/?img_index=1)<br />  * [Did you know there is a ‘Zionist’ playbook made by Israel that instructs people on how to speak about Zionism?](https://www.instagram.com/p/CzNfXa8OChw/)<br />  * [On the contradictions](https://www.instagram.com/reel/Cy7NrrFJCTN/?igshid=MzRlODBiNWFlZA%3D%3D)<br />  * [Former IDF soldier recounts how they are instructed to kill anyone they see](https://www.instagram.com/p/CzmnHFTs77U/)<br />  * [It is illegal to boycott Israel in the US](https://www.instagram.com/p/CzRjDAktFCc/)<br />  * [How children are treated in Israeli prisons](https://www.instagram.com/p/C0AmNm6IchN/)<br />  * [How Israel uses food as a weapon](https://www.instagram.com/p/CzWzeKFrC6l/)<br />  * [How language enables genocide](https://www.instagram.com/p/Cy25_uTOtwl/)<br />  * [Yara Eid paints a picture of current life in Palestine](https://www.instagram.com/p/Czq5Vceoh6o/?img_index=1)<br />  * [The Pyramid of white supremacy](https://www.instagram.com/p/CzhyHHarfLq/)<br />  * [98% of Palestinians will not \"forgive nor forget\" Israel's onslaught on Gaza](https://www.instagram.com/p/C0s1IP-tZ8-/?img_index=1)<br />  * [How long until Palestinians have nowhere left to live?](https://www.instagram.com/p/Cz6eLNZOkOM/)<br /><br />Most of the resources here are taken from [Palestine: in Conversation](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1) document.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 4218057026,
    "text": "Mohammad Ibrahim Shtayyeh, the Prime Minister of the State of Palestine mentioned in [this](https://youtu.be/T7dMWQIblFk?si=jZgc53kCaLq0vZC0&t=1377) YouTube video when asked what will happen to Hamas after the war ends:<br /><br />Hamas is going is not going to be finished. If Israel thinks that they're going to finish Hamas, I think that's a miscalculation on their side. Hamas is an integral part of the Palestinian political Arena whether certain capitals consider Hamas as a terrorist organization or not, that's something to do with them, but Hamas is an integral part of the Palestinian political Arena. We have been in dialogue with Hamas and as I said, Israel will not finish Hamas. Hamas leadership is in Qatar, in certain parts of the world, and so on.<br /><br />We saw this happen to us in Beirut in 1982. Palestinian political forces have been evacuated from Lebanon. We lost a geographic base but this did not end either Fatah or all the PLO factions. This will not end Hamas. Palestinians after this have to come to the voice of reason and be united. So that we have a Rosy image, we go to war together if need to be and we go to peace together if need to be. I think the big lesson that we should learn from this is that to continue to be divided and split is something that is weakening our cause and therefore we will invest every effort to be united and invest every effort to make these sacrifices of our people does not go with the wind but it does bring justice, freedom, dignity, and sovereign state of Palestine that all Palestinians have been looking at, working for, fighting for, and paying sacrifices since 197 19448 until today Palestinian.<br /><br />",
    "responderId": 1917907232,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/T7dMWQIblFk?si=jZgc53kCaLq0vZC0&start=1377"
    }
  },
  {
    "id": 2459895743,
    "text": "[Osama Hamdan](https://en.wikipedia.org/wiki/Osama_Hamdan), a Hamas official, said in [this](https://youtu.be/BIK45RYzN1M?si=_IEWagVyRe_RiVQA&t=579) video:<br /><br /><br />In fact, [Mohammed Deif](https://en.wikipedia.org/wiki/Mohammed_Deif), the leader of the leader of Al Qassam troops, in his message for the fighters before starting the operation said you don't have to attack old men, women, and children. Don't kill don't harm even the soldiers who are wounded you don't have to kill them. This is our values and this is our morals.",
    "responderId": 1817907232,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/BIK45RYzN1M?si=_IEWagVyRe_RiVQA&start=579"
    }
  },
  {
    "id": 3527672079,
    "text": "A narrow space with many inhabitants has taken all resources and materials to build multi-storey dwellings where many families live. Aid given to Palestinians has gone to the Palestinian authority. We all know something about the relations between PA and Hamas. I respect both institutions because they care about their population, but it is a well-known fact about financial aid and its priorities inside occupied lands. Check [this](https://reliefweb.int/report/occupied-palestinian-territory/gaza-2020-liveable-place) article by [ReliefWeb](https://en.wikipedia.org/wiki/ReliefWeb) about how Gaza is an unliveable place.<br />",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 254241936,
    "text": "This seemingly simple question leads to many questions: Do the Israelis have the right to expel (transfer) a population out of their motherland Palestine? If it is a war about expelling the other, then Israelis should be transferred elsewhere, because the IDF, with terror groups (since 1948), are responsible for many massacres and for the exodus of the native inhabitants.<br /><br />Always, they have organised attacks, mass killings, and embargoes. The problem is also with Arab states who refuse to shelter Palestinians and to review their agreements with Israel to make it possible for the refugees to have a better living, no country has been brave enough to take tough measures against Israel. Check the AlJazeera article about [Gaza Blockade Collective Punishment](https://www.aljazeera.com/news/2023/10/9/is-total-gaza-blockade-a-collective-punishment-against-palestinians) and Amnesty International's report about [Israel and Occupied Palestinian Territories](https://www.amnesty.org/en/location/middle-east-and-north-africa/israel-and-occupied-palestinian-territories/report-israel-and-occupied-palestinian-territories/).<br /><br />I think that any person in the world needs a land and a country, but not this way.  Israelis have failed to live among Arabs, as a State and army, but Jewish people may live in peace among Arabs, they did it in Andalusia, although western colonialism has brought changes in our lives, and although there are problems among communities, all should work hard to establish justice and peace. ",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1897807407,
    "text": "[Dr. Omar Suleiman](https://yaqeeninstitute.org/team/omar-suleiman) said in [this](https://youtu.be/DjhQwkq4m-c?si=DQI66R7nvWCE7n9p&t=826) video:<br /><br />By insisting on facts. Jews have lived in the Muslim world for as long as Islam has existed in the Muslim world. Anti-Semitism is the crime of the West. You have historic Jewish communities in the Muslim world; show me that counterpart in the West; it doesn't exist. Zionism is an inherently racist project and in and of itself has a layer of anti-semitism to it because the idea was to dispose, in many ways, of the Jewish people from Europe and the West. Palestinians did not just wake up one day and start hating Jews. Islam was not the problem. Occupation is the problem. If Muslims came and kicked Palestinians out of their land established an illegal state on their territory and mistreated them the way that Israel is mistreating them then we we would resist that Muslim state. This has nothing to do with religion. This is based in, not just a lack of facts, but based entirely in fear. Religion cannot be scapegoated nor should religion be used to continue the war on the Palestinians.<br /><br />Senator [Lindsey Graham](https://en.wikipedia.org/wiki/Lindsey_Graham) said that Israel is in a religious war and I stand with Israel unapologetically. It's clearly not us who have the problem of religious fanaticism. It is the speaker of the house. It is multiple members of Congress. It's the president of the United States who stands unapologetically as a Zionist and who speaks with such disregard for Palestinian Humanity and the children who are being slaughtered in his own country and abroad. We have a president whose Legacy will be genocide. We call him Genocide Joe for a reason. You can't fight that evil if you can't name it properly and it is important for us to no longer allow the Democratic party or a Democratic president to say well I am the lesser of the two evils. How much more evil can you get than an average of 10,000 civilians being killed a month you don't get much more evil than that so we're not going to fall for it anymore we will hold him accountable and we look forward to holding every single politician that has stood for this genocide accountable come November 24.<br />",
    "responderId": 4187020424,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/DjhQwkq4m-c?si=DQI66R7nvWCE7n9p&start=826"
    }
  },
  {
    "id": 3807198980,
    "text": "[Dr. Omar Suleiman](https://yaqeeninstitute.org/team/omar-suleiman) explained in [this](https://www.youtube.com/watch?v=e0G8II_7f7k) video:<br /><br />The prophet, peace be upon him, said that the first person to be judged on the day of judgment will be a Shahid, a martyr who is brought forth in front of Allah. Allah will mention his blessings, his favours upon that person, and the person will acknowledge all of those blessings. Then, Allah will say what did you do with those blessings? He would say that I fought in your cause until I lost my life. Allah would say you have lied. Rather, you fought so that people would say what a brave man you are, what a courageous man you are. You wanted that to be said and it was said. In this Hadith, the Prophet also mentions a scholar who only taught or who only recited the Quran so people would praise their recitation or their knowledge.<br /><br />There are five things that the scholars mention:<br />* **A sign is a person who doesn't renew their intentions.** We're a religion where we are taught to renew our intentions every single day every single morning before every single act of worship.<br />* **If the only time you do good work is when other people see it then that's a sign.**<br />* **If you're disappointed when you're not celebrated.**<br />* **That you quit when you're attacked.**<br />* **That you walk when everybody else walks away.** Things capture our attention and everybody gets excited about a noble cause and then eventually attention moves on. Our attention spans are getting shorter and shorter and shorter. There are going to be people that are going to look around and say no one's talking about this anymore no one's posting about it anymore no one's protesting anymore no one's praying about it anymore no one's giving to it anymore I guess we can all move on now. ",
    "responderId": 4187020424,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 455417067,
    "text": "[Dr. Abdel Wahab El-Messiri](https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D9%8A%D8%B1%D9%8A) said years ago when he was asked in [this](https://youtu.be/FIhfNZRD6lc?si=ks4Epr78AgqQRDtl&t=129) video who is right: Hamas or Fatah?<br /><br />Hamas, of course. My convictions are known. The only solution is resistance and more resistance. As for imagining that what they call a culture of peace will lead to positive results, no. The West gives you according to your strength. If you give up the resistance, you will not get anything, as happened with President Sadat. President Sadat imagined that when he went to Jerusalem, the treasures would be opened for him, but in the end they left him until he was assassinated. The same applies to Fatah and the Palestinian Authority. They announce that they will drop weapons and that they will inspect some members of Fatah who insist on carrying weapons, meaning that it has turned into a tool of oppression, believing that by doing so the Israelis will give them some gains.<br /><br />The main problem in the conflict is that the Zionist minimum does not agree with the Palestinian minimum. For example, on an issue such as Jerusalem, Israel cannot give up half of Jerusalem. Another example is the issue of the return of refugees cannot be given up because it threatens the fragile demographic structure. Another example is dismantling the settlements. If Israel dismantles the settlements, it will lose its legitimacy as a Zionist state.",
    "responderId": 317080511,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/FIhfNZRD6lc?si=ks4Epr78AgqQRDtl&start=129"
    }
  },
  {
    "id": 3596863445,
    "text": "[Dr. Abdel Wahab El-Messiri](https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D9%8A%D8%B1%D9%8A) said years ago in [this](https://youtu.be/F-j8QHxqZFY?si=vOJZ45vwQSJY2G-C&t=395) video:<br /><br />The Zionist state is a state committed to the settler ideology. The settler ideology is an ideology that establishes the right for a group in the West to move to Palestine and seize it. In this, it is not at all different from the settlement of whites in South Africa and the settlement of whites in North America and Australia. By the way, they have also used biblical apologies and preambles. They all said about themselves that they were Hebrews, that they were Israelis ascending to Zion, and that the original inhabitants of the land, the Canaanites, must be exterminated. This applies to the Native Americans, it applies to the blacks in South Africa, and it applies to the Palestinians, even to others. They all spoke of themselves as a chosen people, and they all spoke of themselves as having absolute rights. As I mentioned this funny incident, which is an extreme one, but it is indicative: when they were discussing the language that would be used in the United States when declaring independence, Hebrew was presented as one of the possible scenarios. It was rejected, of course, and German and English were horrified, but it is a significant issue. In the end, the emergence of Christian Zionism is a resurrection for these settlement biblical myths.<br /><br />The statements and apologies differ because some Zionists said that they had no connection to religion, but rather came to establish a secular, democratic state. Some of them said that we came to establish a government of workers. Still, the common element between all these experiences is the transfer of a human mass from the West to the East, because in the late 19th century Europe had many social problems. Crime increased, social frustration increased, and the Jewish question and unemployment worsened until they called the unemployed human surplus. Because the colonial solution is a solution to all problems and the solution is to export them, what was done was to export a group of Jews who were not absorbed by the new western economy, the new capitalist economy.",
    "responderId": 317080511,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F-j8QHxqZFY?si=vOJZ45vwQSJY2G-C&start=395"
    }
  },
  {
    "id": 23429435,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://www.youtube.com/watch?v=3MERTh-mWxM) video when he was asked about Hamas targeting civilians:<br /><br />It's not true. I think Hamas mainly attacked military establishments and installations and most of the people they they have arrested and taken as war prisoners are military people. I do not accept attacking any civilian. I do not accept that Israelis attack our civilians. Look at what Israeli planes are doing now in Gaza. They are bombarding houses. They're bringing down to earth whole apartments, whole buildings, high buildings are brought down to the ground. We already are reporting and receiving reports about families who are killed. Nine people in one family, 10 people in another family including children. I do not want any civilian to be hurt either by Palestinians or by Israelis but the question is how to end that? Will it end by attacking the Gaza Strip another time? Israel has already conducted five Wars on Gaza. One of them lasted 51 days. They destroyed everything. This did not stop Hamas, did not stop resistance. There is one way to stop any violence and that is to end the Israeli occupation and that the United States be fair. They cannot say that Israel has the right to defend itself but we the Palestinians don't have the right to defend ourselves. Let me remind you of the case of [Shireen Abu Akleh](https://en.wikipedia.org/wiki/Shireen_Abu_Akleh), who was not only Palestinian but also American. A very peaceful journalist; she was shot to death by an Israeli sniper. Was anybody indicted? Was anybody taken to court? No! 52 other journalists were also killed. Our first aid providers are shot. Our doctors are shot. <br />",
    "responderId": 66002164,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1615530496,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/Gjgb2faf3FQ?si=hmu4UQSyoF1De-QW&t=116) video:<br /><br />Do you condemn that Israel has been occupying us since 1967? Do you condemn that Israel has been practising ethnic cleansing against Palestinian people for 75 years? Do you condemn that Israel has evicted 70% of the Palestinian people from their land, erasing to the ground 520 Palestinian towns and Villages? Condemn that and then I'll answer. Until you condemn the atrocities that are happening in Gaza; three war crimes, the war crime of ethnic cleansing. I am a person of nonviolence. I never accept the killing of any child whether Palestinian or Israeli. I don't accept the killing of the 30 children they say were killed on the 7th of October, but you should also agree with me that you do not agree with killing 12,000 Palestinian children! 12,000! Do you know what that means? children were killed by Israeli bombardment and they have been occupying us since 1967.",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/Gjgb2faf3FQ?si=hmu4UQSyoF1De-QW&start=116"
    }
  },
  {
    "id": 1121907116,
    "text": "First, allow Hamas and Gaza people to have basic life needs, safety in their country, a gateway to life, trade, chances for work, safety doing their prayers in AlAaqsa mosque, don't arrest their children, stop the terrible actions that have been lasting for as long as 75 years, condemn the Israeli government, and return the hundreds of their captives from women, children, and men back first and then ask about recent captives.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2272053725,
    "text": "[Dr. Abdel Wahab El-Messiri](https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D9%8A%D8%B1%D9%8A) said years ago in [this](https://www.youtube.com/watch?v=fPMc45jYg0k) video:<br /><br /><br />The origin of this movement was that Europe was beginning to think of this Zionist thinking on two levels. The first level is that the imperialist solution for all Europe's problems is by exporting these problems abroad, just as they exported criminals, religious protesters, and so on, and exported social failures, so the Jews had to be exported. At this stage, the search was for any offer from Mozambique, Argentina, or Al-Arish, but what happened was that the Jewish issue coincided with the Ottoman issue. The Ottoman issue was that Europe decided to divide the Ottoman Empire, and found it necessary to create a settlement state in this place. Through the marriage of the imperialist solution to the Jewish question and the imperialist solution, Palestine was determined as the place of Jewish settlement. This arose again in colonial circles before it arose among the Jews.",
    "responderId": 317080511,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2877787271,
    "text": "[Bassem Youssef](https://en.wikipedia.org/wiki/Bassem_Youssef) said in [this](https://www.youtube.com/live/KE71VcdvpAs?si=401CyRgGOQ-io-vV&t=6431) video:<br /><br />Do you know why they increased? You would say \"Because they are having babies like crazy\". No, this is how you look stupid when you talk data while being uninformed. The reason behind this 1.5 million increase didn't come from Gaza; it was pushed to Gaza from other parts of Israel to put those people in the largest open-air prison. So most of this increase is because of refugees being kicked out. My wife's family is not from Gaza and yet they found themselves in Gaza because they were sitting in other cities and villages outside Gaza. This is the systemic pushing of people from other parts of Israel to Gaza. The people who belong to Gaza are 700 thousand people. The 2.5 million is not the birth rate; these are people pushed to Gaza. That's not the first time, in 1948, on the night of the declaration of the state of Israel, 1.5 million Palestinians were moved outside.",
    "responderId": 3883926909,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2444286130,
    "text": "* Check [boycotzionism.com](https://www.boycotzionism.com/) or [boycott.thewitness.news](https://boycott.thewitness.news/) to see which products are affiliated with Israel.<br />* Check [bdsmovement.net](https://bdsmovement.net/) for a principled BDS movement, specifically go to the [What to Boycott](https://bdsmovement.net/get-involved/what-to-boycott) section to see which companies the BDS movement is targetting now.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 856727960,
    "text": "Because most of them have ties, deals, and business with Israel. Also, neighboring countries might be a  afraid of being bombed as well.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 4135275275,
    "text": "Because they're ruled by people who don't care about Palestine.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1110692008,
    "text": "The [Law 4 Palestine](https://law4palestine.org/) website has compiled a list of quotes from each of the following:<br />* [Decision Makers](https://law4palestine.org/wp-content/uploads/2024/01/1-Database-of-Israeli-Incitement-to-Genocide-15th-January-2024-DECISION-MAKERS.pdf)<br />* [Armed Forces](https://law4palestine.org/wp-content/uploads/2024/01/3-Database-of-Israeli-Incitement-to-Genocide-15th-January-2024-ARMED-FORCES.pdf)<br />* [Legislators](https://law4palestine.org/wp-content/uploads/2024/01/2-Database-of-Israeli-Incitement-to-Genocide-15th-January-2024-LEGISLATORS.pdf)<br />* [Journalists & Influencers](https://law4palestine.org/wp-content/uploads/2024/01/4-Database-of-Israeli-Incitement-to-Genocide-15th-January-2024-Journalists-Influencers.pdf)<br />* [Public Expressions](https://law4palestine.org/wp-content/uploads/2024/01/5-Database-of-Israeli-Incitement-to-Genocide-15th-January-2024-Public-Expressions.pdf)",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3218286880,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/F6_cheSL29I?si=_WyrKha38UR0-tEv&t=1245) video:<br /><br />It was on the 21st of March 1968. It was a great victory because the Arabs were out of a great defeat by Israel when the three Arab states were defeated in six days. By the way, what the occupation army lost in confronting the resistance in Gaza in the current war (2024) is more than they lost in the 1967 war, which made them occupy three times the area of the Israeli entity.<br /><br />That is because back then in 1967, there was no real battle. It was shocking, of course, how Israel was able to defeat three Arab armies. They used deception and many methods, but they succeeded in this aggression and created a new reality which guaranteed the occupation of Sinai, the wrath of the Golan Heights, and of course all of the West Bank and Gaza.<br /><br />Then in 1968, there was a deep feeling of defeat and anger and the resistance movement began to grow. Although the Fatah movement began in the 1950s and its first operations were carried out earlier but the transformation took place in the battle of Al-Karama, because it was the first battle in which the Palestinian and Jordanian sides defeated Israel. A year later, Yasser Arafat was elected president of the Palestinian Liberation Organization.",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F6_cheSL29I?si=_WyrKha38UR0-tEv&start=1245"
    }
  },
  {
    "id": 3171175986,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/F6_cheSL29I?si=IGXU8J60gOeOkWEG&t=2495) video:<br /><br />The US and Britain created Israel. They created it to be the base of imperialist and colonial interests in the region. They created it to preserve American interests in the region. They also created it to be a threat force to the surrounding countries in the region. Their goals are: control of oil, control of energy resources, and control of the strategic location. Israel, for them, was the best ally. At the beginning, they claimed that they were doing this to confront the Soviet Union and the other countries. Today, they want to impose it as a method for economic, strategic, and political control.<br /><br />Israel was established on the basis of Balfour's agreement which Britain issued in 1917. But Balfour's agreement is not excluded from the American-Anglican movement which supported this approach. They even used Jewish mythology to justify the establishment of the State of Israel in this way. Therefore, the relationship between the US and Israel is an organic relationship, not a temporary alliance relationship. Because they look at it as two sides: The first side is that it is a base to preserve their military, political, and strategic interests. Secondly, they consider it a project of occupation and settlement to take over the place of the Palestinians and take their land.<br />",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F6_cheSL29I?si=IGXU8J60gOeOkWEG&start=2495"
    }
  },
  {
    "id": 3915714141,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/F6_cheSL29I?si=BA9SGjA13Fb0Kciw&t=1745) video:<br /><br />What was proposed in Camp David was just talking about an independent government. The terms were not clear and do not forget who was leading Israel at that time, Menachem Begin, one of the most far extremists. And all the story of Camp David was a kind of trade. One of its main points is to give up on the Palestinian side. Therefore, the Palestinians saw in it a sad exit for Egypt from the battlefield with Israel. Therefore, of course, there was an objection to the Camp David Agreement at that time, a big objection.<br /><br />I think that if we go back in history, it was better for the Arabs and the Palestinians to stay with us in one line and not to allow Israel to separate them one by one.",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F6_cheSL29I?si=BA9SGjA13Fb0Kciw&start=1745"
    }
  },
  {
    "id": 2448619580,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/F6_cheSL29I?si=wwyfNeeCDQgyM4dJ&t=4198) video:<br /><br />The Oslo Agreement was the greatest genius idea in the history of Israel because it guaranteed the continuation of the occupation without having Israel pay for the costs of the occupation. I mean that the [First Intifada](https://en.wikipedia.org/wiki/First_Intifada) was costing Israel huge costs. They got rid of the Intifada because the stoppage of the uprising<br />was part of the agreement. They got rid of that ongoing blood which they could not afford. They gave the Palestinians an illusion.<br /><br />There were many mistakes in the Oslo Accord:<br />*  The first one was what [Dr. Haider Abdel Shafi](https://en.wikipedia.org/wiki/Haidar_Abdel-Shafi) warned it is not permitted to sign any agreement with Israel without stopping the occupation. The Palestine Liberation Organization agreed to sign the agreement without stopping the settlement. As a result, we had 121,000 settlers in 1993. Today, we have 750,000 settlers. In other words, the occupation and Judaization process did not stop. How can you sign an agreement without stopping the settlement?<br />* The second point is that there was a non-contradictory recognition. The Palestinians recognized Israel and Israel only recognized the organization and not the Palestinian state. It recognized the organization as a representative of the Palestinians and did not recognize the Palestinian state.<br />*  The third mistake was that the organization agreed to sign a transitional agreement without determining the ultimate goal, as was required by the official agreement in Madrid and Washington. We used to say that before we talk about the details and the stages, we should first determine the ultimate goal and stop the occupation of all the occupied territories. After that, we will study how to reach that goal. However, without determining the ultimate goal, the organization lost the initiative. There was a transitional period of six years after which the research for the ultimate solution should begin, which included Jerusalem, the settlers, the refugees, the borders, security, and water.  What happened was that Israel took the agreement and stopped the negotiations.<br />* The other major mistake was that in the second stage of the agreement, they agreed to divide the West Bank into three parts, A, B, and C. A was an area under the control of the Palestinian Authority, while B was under civilian control. However, the majority of the land, 60%, remained under the control of C, which means it is under the control of Israel. As for now, Israel took control even over A. This was after the last war.<br /><br />As a result, the Oslo agreement was one of the biggest historical mistakes made by the Palestinian Authority. Because it was based on two delusions. The first delusion was that the Zionist movement was ready to find a solution with the Palestinians, while in reality, it was not. The second delusion was that the United States could be an honest mediator. It's not honest and it's not a moderator. On the contrary, Netanyahu came to power to destroy the Oslo agreement. They got rid of the intifada, and then they wanted to destroy the Oslo agreement. He made every effort to postpone the negotiations. Since 2014, there has been no meeting between the Palestinian-Israeli negotiations. All of this is over.<br /><br />The liberation movement got tricked into wanting recognition at any cost. The contradiction began then between the liberation organization, the bureaucratic system and the liberation organization: the liberation movement. The interests of the bureaucratic system that manages the organization conflict with the interests of the liberation movement. This became worse when the Palestinian Authority was established. Because the bureaucratic system that was established with the Palestinian Authority took over the organization. Instead of the authority being a member of the organization and a reference point to the organization, the organization became a small expense item in the Palestinian Authority's budget.<br /><br />This is the reason for the internal Palestinian crisis and the reason for the division. What led to the division was the Oslo Accord. The Oslo Accord created the original division in the Palestinian sphere. People became with Oslo or against Oslo. We were very careful about this. Dr. Haidar Abdel Shafi, Dr. Edward Said, Mr. Ibrahim Al-Dakkaq, and I were against Oslo and we were aware of its dangers. This is the reason for the establishment of the [Palestinian National Initiative](https://en.wikipedia.org/wiki/Palestinian_National_Initiative). These four people, along with 500 other people, established the Initiative to reject the Oslo Accord.",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F6_cheSL29I?si=wwyfNeeCDQgyM4dJ&start=4198"
    }
  },
  {
    "id": 3623179040,
    "text": "[Dr. Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) said in [this](https://youtu.be/F6_cheSL29I?si=dw9Qh59o-EmckowK&t=6323) video:<br /><br />The Palestinian-Palestinian conflict and the internal division are caused by two things. Both are not ongoing right now. The first reason is the Oslo Accords (check the answer to the question 'Was the Oslo Agreement / Accords a mistake?'. The disagreement on the Oslo Accords and the disagreement on the national approach. The supporters of the Oslo accords believe in the negotiations and some of them still believe in the middle solution with the Zionist movement, while Israel presents evidence every day to reject any idea of a middle solution. In my opinion, after what happened and after what Israel and Netanyahu did to destroy the Oslo Accords and the expansion of the settlement to 750,000 settlers, and after his continuous declaration that he will not allow the establishment of an independent Palestinian state, the reason for the political conflict vanishes, because those who believe in the Oslo accords have no one to talk to, there is no room for negotiations. Therefore, those who insist on the continuation of the Oslo Accords are wrong. Today, national unity must be established on a different program, a national struggle to overthrow the occupation, apartheid, and the racist separatist regime, as well as all of the occupation systems. So the division on the program has practically disappeared, even though some still hold on to their Oslo accords illusions in the Palestinian Authority.<br /><br />The second reason for the division is the conflict over the authority in Gaza and the West Bank. This reason has also disappeared because there is no authority left. Israel has eliminated every authority. The authority in the West Bank has become an authority without authority and under the occupation, and Gaza is undergoing re-occupation as we see today. Therefore, what do we argue about? There is no reason for the division in the program because there is now no room for a program except for the national resistance and struggle. And for the authority, there is no authority because it is all under the occupation.<br /><br />Therefore, in my opinion, there is no reason for the continuation of the division. Now, everyone should unite in a united national front. I mean a united national leadership for the Palestinians. The liberation Organization can be the backbone or platform of this united national leadership so that all the forces are included, including the Hamas movement and the Islamic Jihad movement, and so that there is no longer an individual decision from any party or party. I mean a united national leadership where everyone participates. For example, we have been members of the Liberation Organization since 2015 but we are not in the leadership of the Liberation Organization, we are marginalized from the leadership of the Liberation Organization. What should happen is a united leadership that includes everyone and agrees on a vision and a national program of joint struggle and resistance. It is possible that a temporary national unity government in the current situation to prevent the separation of Gaza from the West Bank to prevent the Israeli conspiracy to re-occupy Gaza and impose a convoy of agents to work under the supervision of the Israeli occupation to separate Gaza from the West Bank and to close the road in front of the United States and Israel in a policy of “divide and conquer”. Why do I say a temporary national unity government? Because, of course, in the current stage, it is difficult to run elections while the war is ongoing. After things calm down and we end this aggression, InshaAllah, and the reconstruction process begins, a temporary government in a period of no more than a year may call for elections. We will achieve what we should have done in 2011, which is to hold free and democratic elections and give the Palestinian people the right to choose their leadership in a democratic way. When people elect, they do not only elect people, they elect a method, a political program. In my opinion, there is no good program for the Palestinian people but a national resistance, struggle program.<br /><br />I proposed that in front of the leadership of the brothers of the Fatah Movement and in front Brother Abu Mazen and the brothers of the Hamas Movement and others. I believe that there is a kind of coalition of a large number of the Palestinian forces on this vision now. The divisions still exist but the reasons no longer exist. But there are external interventions and some external interventions try to deepen the division in the Palestinian sphere. This hurts us. We must maintain the independence of the Palestinian national decision regardless of any external interventions to ensure that we have a unified national leadership.<br /><br />I do not know what the disagreement is. Today, the Palestinian people are exposed to a second Nakba. There is no justification or reason to continue an internal conflict when we are in a real battle that threatens the lives of all Palestinians, not only in Gaza but also in the West Bank.",
    "responderId": 66002164,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/F6_cheSL29I?si=dw9Qh59o-EmckowK&start=6323"
    }
  },
  {
    "id": 968481095,
    "text": "[Dr. Abdel Wahab El-Messiri](https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D9%8A%D8%B1%D9%8A) said years ago in [this](https://www.youtube.com/watch?v=fPMc45jYg0k) video:<br /><br /><br />The origin of this movement was that Europe was beginning to think of this Zionist thinking on two levels. The first level is that the imperialist solution for all Europe's problems is by exporting these problems abroad, just as they exported criminals, religious protesters, and so on, and exported social failures, so the Jews had to be exported. At this stage, the search was for any offer from Mozambique, Argentina, or Al-Arish, but what happened was that the Jewish issue coincided with the Ottoman issue. The Ottoman issue was that Europe decided to divide the Ottoman Empire, and found it necessary to create a settlement state in this place. Through the marriage of the imperialist solution to the Jewish question and the imperialist solution, Palestine was determined as the place of Jewish settlement. This arose again in colonial circles before it arose among the Jews.",
    "responderId": 317080511,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1487550032,
    "text": "Middle Eastern supporters of Palestine have long bemoaned the failure of Arab leaders to take a strong stance against the Israeli occupation. It’s easy to see why.<br /><br />Every time Israel ramps up its brutal oppression of the Palestinians, its Western allies snap into action. Leaders of countries like Australia, Germany, France, the UK and the US send passionate messages of support. The media go into overdrive, amplifying the racist narratives that justify Israel’s crimes and doing their best to distort the fact that Israel is the oppressor and aggressor. Billions of dollars’ worth of emergency aid gets rushed through parliaments to assist the Israeli army in its genocide.<br /><br />While all this support is given to Israel, governments of the predominantly Arab and Muslim states sit twiddling their thumbs. This deplorable passivity was on display at the recent special combined conference of the Arab League and the Organisation for Islamic Cooperation. Promoted as an urgent and “extraordinary gathering” in response to the massacre in Gaza, the conference met for just one day. After much shouting and gesticulation, the only concrete demand from these eminent representatives of the Arab and Muslim world was the “convening of an international peace conference, as soon as possible”. The Israelis will be shaking in their boots.<br /><br />To be fair, there was more to their motion. While they patiently wait for Israel to finish its genocidal attack on Gaza, the leaders committed to “supporting Egypt’s efforts to deliver aid to the Strip”. This sounds all well and good, except if you know that Egypt controls and constrains the woefully inadequate aid that currently passes through the Rafah crossing into Gaza. Similarly, Egypt has helped the Israelis maintain the siege on Gaza for the last seventeen years.<br /><br />But with that piece of breathtaking cynicism—followed by the obligatory feast and photo opportunities—another successful gathering of the Arab and Muslim world was complete.<br /><br />Little wonder that Palestinians and their supporters rage against these pathetic gatherings. The fiery rhetoric heard at such events is never followed by any real action, either in terms of practical solidarity with the Palestinian people or in pressuring the West to stop the atrocities.<br /><br />It’s not as if the Middle East can’t hold anything over Israel and its imperial allies. Arab and Muslim countries control the bulk of the world’s known oil reserves; Saudi Arabia and Iraq alone control more than 21 percent of daily oil exports. This gives these countries enormous leverage.<br /><br />But it’s not just oil. The Suez Canal, owned and operated by the Egyptian government, is vital to global trade. A report by the New Zealand embassy in Cairo estimates the value of goods transported through the canal to be US$1 trillion a year, which represents about 30 percent of global shipping trade. When it was cut off for just six days due to an accident in 2021, the cost to the world economy was an estimated $9.6 billion a day, according to data from Lloyd’s List.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2585201328,
    "text": "Egypt is helping but it's not enough, they give enough food to feed barely enough people and in the end, not all Palestinians can access the food sent by Egypt.",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2417685228,
    "text": "In [this](https://www.aljazeera.com/opinions/2024/3/21/a-ramadan-no-palestinian-will-ever-forget) article, AlJazeera publishes the following<br /><br />For those in Gaza, who survived more than five months of genocide, there is no food for Iftar. Israel is still blocking aid from reaching the most desperate, and people are cooking grass to have something, anything, to break their fast with. Babies and children are all malnourished, and dozens have already died from lack of food and clean water. Everyone in the besieged enclave lost someone, but they are not even provided with the time and space to breathe, mourn and process their trauma. There is no mosque left undamaged, and no safe place for collective prayer. Indeed, people of Gaza  are still under constant bombardment. Even those who tried to find refuge in Rafah, that last so-called “safe zone” in the besieged enclave, are still being threatened with a ground invasion – an invasion that would undoubtedly kill and maim thousands more innocents.<br /><br />In [this](https://www.youtube.com/watch?v=xFxub2xjqGw) video, AlJazeera shows palestinians getting ready for Iftar.<br />",
    "responderId": 7852704,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3561590871,
    "text": "[This](https://www.youtube.com/watch?v=1jLSPnPfJRE) video by المُخبر الاقتصادي+ explains the following:<br /><br />[The American Israel Public Affairs Committee](https://en.wikipedia.org/wiki/AIPAC) (AIPAC)  is a powerful lobbying group in the United States, initially founded in 1954 as the American Zionist Committee for Public Affairs. By 1959, it was renamed AIPAC, marking the start of its journey to become one of the most influential entities in U.S. politics concerning foreign policy towards Israel. The video highlights pivotal moments and figures, underscoring AIPAC's extensive reach and its ability to shape U.S. policy and public opinion in favor of Israel. A critical instance of its historical impact was the shift in tactics following the [massacre in the Palestinian village of Qibya](https://en.wikipedia.org/wiki/Qibya_massacre) in 1953, which drew international condemnation towards Israel. This event underscored the necessity for Israel to cultivate robust support within the United States, leading to the strategic establishment and operational expansion of AIPAC.<br /><br />AIPAC's influence on American politicians is profound, as illustrated through the careers of individuals such as Paul Findley and Charles Percy. Findley's political downfall, attributed to his public friendship with Yasser Arafat, and Percy's electoral defeat after being targeted by AIPAC for his views on Israel, serve as testament to the organization's significant sway over political careers based on their stance towards Israel. Additionally, recounts how AIPAC's lobbying efforts led to an overwhelming Congressional rejection of the Goldstone Report in 2009, which accused Israel of committing war crimes. This demonstrates AIPAC's capability to mobilize U.S. lawmakers against international critiques of Israeli actions, further solidifying its role in directing U.S. foreign policy.<br /><br />[The leaked video](https://youtu.be/mvqCWvi-nFo?si=mOscPMxMxUDjZXZU&t=59) of Benjamin Netanyahu from 2010, where he candidly remarked that America could be easily moved to support Israel's direction, embodies the perceived influence Israel exerts over U.S. policies. This candid acknowledgment by a sitting Israeli Prime Minister highlights the nuanced and sometimes controversial relationship between the U.S. and Israel, where lobbying efforts by groups like AIPAC play a central role in maintaining strong bilateral support regardless of the complex political and ethical dynamics at play.<br /><br />Reflecting on AIPAC's strategic importance and operational tactics, the narrative underscores its enduring impact on shaping U.S.-Israel relations. From influencing key political figures and legislative outcomes to navigating through moments of international scrutiny against Israel, AIPAC's role is critical.<br /><br /><br /><br /><br /><br />",
    "responderId": 2737087625,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/mvqCWvi-nFo?si=mOscPMxMxUDjZXZU&start=59"
    }
  },
  {
    "id": 3519902184,
    "text": "Dr. Omar Suleiman mentions in [this](https://www.youtube.com/live/eSoNa2eCwZo?si=CnDZtqPvkcjQPtf9&t=279) video:<br /><br />Allah Subhanahu Wa Ta'ala says in the Quran:<br /><br /> وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَاجِدَ اللَّهِ أَن يُذْكَرَ فِيهَا اسْمُهُ وَسَعَىٰ فِي خَرَابِهَا ۚ أُولَٰئِكَ مَا كَانَ لَهُمْ أَن يَدْخُلُوهَا إِلَّا خَائِفِينَ ۚ لَهُمْ فِي الدُّنْيَا خِزْيٌ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ<br />[البقرة: 114]<br /><br />This means: Who does more wrong than those who prevent Allah’s Name from being mentioned in His places of worship and strive to destroy them? Such people have no right to enter these places except with fear. For them is disgrace in this world, and they will suffer a tremendous punishment in the Hereafter.",
    "responderId": 4187020424,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2137261574,
    "text": "In [this](https://youtu.be/oFSyNdQf5uk?si=jgJOHeZYZJ18aCNr&t=5136) video, Dr. Omar Suleiman mentions:<br /><br />So Congresswoman Eddie Bernice Johnson was one of the few co-sponsors of a bill that has been on the floor of Congress for years, initially sponsored by Congresswoman Betty McCollum, to penalize Israel for its detention of child prisoners. Thousands of children arbitrarily detained, put in military courts, solitary confinement, and yes, sexual violence, that's been documented by human rights organizations, against them, and there have been no repercussions. So I want you to think about this. You know, just the thought of conditioning aid to Israel, you know, so that it doesn't indiscriminately bomb entire populations has not been able to find any home in mainstream American politics for years.<br /><br />Just trying to stop Israel from picking up children and throwing them into military prisons, where they disappear for decades at times, has not found any thrust in mainstream American politics, whereas any resolution that is pro-Israel will make it past both chambers relatively quickly. When people talk about Israeli hostages and then talk about Palestinian prisoners, there's already a problem with that framing. First of all, all 2.2 million people in Gaza are hostages. Every Palestinian that lives under occupation is a hostage, but all of those prisoners that have been picked up, women, children, innocent people, with absolutely no process of making sure that they're treated right or given fair trials, or even given a communication line with their families or with any government to help them, is absolutely criminal. All of those prisoners are also hostages. And when you already propose this idea that there are Israeli hostages and Palestinian prisoners, you're already implying that one group is complicit in their own devastation, whereas another group has had devastation visited upon them entirely out of their own doing. And so it's important for people to learn about children prisoners, who are indeed hostages to an apartheid system, and even what happened during that four-day truce, which all of us hoped would be extended and become permanent, where 150 Palestinian prisoners were released. Israel just went and picked up another 135 in the West Bank and threw them in prisons. That's what I mean when I say you're not addressing the root of the problem. The root of the problem is the occupation. The root of the problem is the apartheid. The root of the problem is the desperation that then drives the creation of all sorts of circumstances that will only further lead to the devastation of everyone, right?<br /><br />The root of that problem is the dehumanization of the Palestinian, because no one is raising alarms for those Palestinian hostages in Israeli military prisons, no one's putting up their pictures, and no one's talking about who they are and their human stories, and the violence that's been wreaked against them at every level. So if you don't solve, not just the root of occupation, but also the dehumanization that drives the occupation, which is, unfortunately, so pervasive right now in the discourse, then you're going to continue to have this gap in how the world sees the plight of the Palestinians and how, unfortunately, the American public sees the problem of the Palestinians.<br /><br />Abraham Accords is nothing but an agreement in which you slap the name of Abraham on arms deals. In exchange for countries being able to undertake their own unholy pursuits, they use one of the holiest names in history and continue to erase the main victims of this atrocity. And so the Abraham Accords are an insult to humanity, an insult to the Palestinians, and an insult to the name of Abraham.",
    "responderId": 4187020424,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/oFSyNdQf5uk?si=jgJOHeZYZJ18aCNr&start=5136"
    }
  },
  {
    "id": 727369457,
    "text": "Professor [Naom Chomsky](https://en.wikipedia.org/wiki/Noam_Chomsky) has mentioned in [this](https://youtu.be/cXhqgsZ7ZRc?si=jZEeBogDOgwKnfbR&t=1463) video:<br /><br />If you take a look at the Geneva Accords, you can occasionally find something looking like a map which is a considerable improvement over the [Taba proposal](https://en.wikipedia.org/wiki/Taba_Summit) which was itself a very substantial improvement over Camp David. Is the Geneva Accords just? No, because Israel<br />abandons nothing of its territory, to be precise, it abandons a little strip of its territory along the Gaza Strip which is not very important and in return, it takes over a  piece of the West Bank but it abandons nothing and crucially, a large section of the Palestinians were not<br />represented as part of these negotiations and their rights were essentially dismissed.",
    "responderId": 563133960,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/cXhqgsZ7ZRc?si=jZEeBogDOgwKnfbR&start=1463"
    }
  },
  {
    "id": 3203991589,
    "text": "Al Jazeera mentions in [this](https://youtu.be/p75R9MiSMSo?si=3QZUG83YWfmLaqCH&t=130) video:<br /><br />* The three countries Bahrain, UAE, and Israel committed to peace but there were no Palestinian representatives at this event. What was shown in front of cameras in Washington was a political triumph and a normalization of regional relations that doesn't meaningfully address the injustices faced by people living in the region.<br />* The Arab media covered all the bases. Newspapers like UAE Khaleej Times ran a cover page greeting Israeli leaders. Religious media channels in the UAE delivered sermons on TV and online emphasizing the duty of Muslims to trust their leaders' decisions. Dubai TV, Bahrain TV, and the Israeli Channel 12 hosted a simultaneous live broadcast to mark the signing of the accords.<br /><br />In [this](https://www.youtube.com/watch?v=a-g5bw3ckNk) video, it mentions:<br /><br />Normalisation is basically a diplomatic-speak for two countries having some kind of formal relationship where before there was none through things like trade deals, setting up embassies and direct flights. But not that long ago the idea of Gulf countries having cordial relations with Israel was unthinkable. There’s been a lot of bad blood.<br />",
    "responderId": 7852704,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/p75R9MiSMSo?si=3QZUG83YWfmLaqCH&start=130"
    }
  },
  {
    "id": 510061042,
    "text": "The Abraham Accords are when many states were bribed in a way to normalise ties with Israel. First, Morocco [was bribed](https://en.wikipedia.org/wiki/Abraham_Accords#:~:text=The%20agreement%20was%20negotiated%20by,sovereignty%20over%20the%20Western%20Sahara.) so that the USA accepts their sovereignty over the territory of Western Sahara. Sudan had economic sanctions and [was removed](https://en.wikipedia.org/wiki/Abraham_Accords#:~:text=officials.%5B36%5D-,As%20part%20of%20the%20agreement%2C%20the%20US%20removed%20Sudan%20from%20its%20list%20of%20state%20sponsors%20of%20terrorism%20and%20gave%20it%20a%20US%241.2%20billion%20loan%20to%20help%20the%20Sudanese%20government%20clear%20the%20country%27s%20debts,-to%20the%20World) for making ties. the UAE government were bribed with money to do this. ",
    "responderId": 1917907232,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2352163560,
    "text": "Professor Edward Said mentioned in [this](https://www.youtube.com/watch?v=-MbXY3X-xGU) video when he was asked whether Zionists have any historical claim to the lands of Israel.:<br /><br />Of course, but I would not say that the Jewish claim or the Zionist claim is the only claim or the main claim. I say that it is a claim among many others. Certainly, the Arabs have a much greater claim because they've had a longer history of inhabitants of actual residents in Palestine than the Jews did. There has been some quite interesting work done by biblical archaeologists in which you will see that the period of actual Israelites', as it was called in the Old Testament, dominance in Palestine amounts to about 200 to 250 years but there were Jebusites, there were Canaanites, there were Philistines, there were many other people in Palestine at the time and before and after. To isolate one of them and say that's the real owner of the land. that is fundamentalism because the only way you could back it up and say well God gave it to us yes but I mean Christians think that God gave it to them and Muslims think that God gave it to them I mean that's not a rational argument.<br /><br />The very important point is that I don't think any claim, [whether they say by God] or by the emperor; nobody has a claim that overrides all the others and entitles that person with that so-called claim to drive people out. This is a very very important point, I mean Jews have a claimant I've never denied that of course, they do but is it a claim that can tell a Palestinian: Well you've got to leave this house because I got it 2000 years ago and it's true I come from Poland or from Brooklyn but I have a bigger right to this house than to you you, so get out. Sorry, I disagree with that without kind of logic.<br />",
    "responderId": 779693087,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3044327279,
    "text": "Israel was constructed on the ruins of another society and by the mass dispossession of another people who remain unacknowledged as just sort of obscure natives in the background, back to the desert, let them let them go to one of the other Arab countries; that's been the position. The Oslo Accord say specifically that Israel bears no responsibility for the costs of the occupation. This after years of military occupation? As an Israeli journalist said: *We took over the country in 1948 from the British. The British left us the port of Haifa, a road system, an electrical system, a large number of municipal buildings, and lots of prisons. If we had taken Palestine in 1948 the way we left Gaza for the Palestinians, there would be no Israel. We destroyed the economy, we deported most of the capable people, we forced the people to live in refugee camps*  and they bear no responsibility for it; that's simply unacceptable; even for the Jewish people who have suffered so much, it's unacceptable you cannot continue to victimize somebody else just because you yourself were a victim once, there has to be a limit.<br />",
    "responderId": 779693087,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 1418356788,
    "text": "Professor Edward Said wrote an article named [The Morning After](https://www.lrb.co.uk/the-paper/v15/n20/edward-said/the-morning-after) in the London Review of Books magazine:<br /><br />* The fashion-show vulgarities of the White House ceremony, the degrading spectacle of Yasser Arafat thanking everyone for the suspension of most of his people’s rights, and the fatuous solemnity of Bill Clinton’s performance, like a 20th-century Roman emperor shepherding two vassal kings through rituals of reconciliation and obeisance: all these only temporarily obscure the truly astonishing proportions of the Palestinian capitulation.<br />*  The fact is that Israel has conceded nothing. By contrast Arafat’s recognition of Israel’s right to exist carries with it a whole series of renunciations: of the PLO Charter; of violence and terrorism; of all relevant UN resolutions, except 242 and 338, which do not have one word in them about the Palestinians, their rights or aspirations.<br />* The domination (if not the outright theft) of land and water resources is either overlooked, in the case of water, or, in the case of land, postponed by the Oslo accord.<br />* I doubt that there was a single Palestinian who watched the White House ceremony who did not also feel that a century of sacrifice, dispossession and heroic struggle had finally come to nought.<br />* The thinking behind the collaboration is that it will deter any Palestinian from demonstrating against the occupation, which will not withdraw, but merely redeploy. Besides, Israeli settlers will remain living, as they always have, under a different jurisdiction. The PLO will thus become Israel’s enforcer, an unhappy prospect for most Palestinians.<br />* True, residents of the West Bank and Gaza are rightly glad to see that some Israeli troops will withdraw, and that large amounts of money might start to come in. But it is rank dishonesty not to be alert to what the agreement entails in terms of further occupation, economic control and profound insecurity.",
    "responderId": 779693087,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 2912225514,
    "text": "Ahmed Mansour mentioned the following sayings in [this](https://www.youtube.com/watch?v=0uq_b-0Gp3Q) video:<br /><br />* The Camp David Accords, which President Anwar Sadat signed with the Israelis, will remain a milestone in the history of the Arab-Israeli conflict because, in short, it gave the Israelis the right to usurp Palestinian lands.<br />* Sheikh Ahmed Yassin, founder of the Hamas movement, says about the agreement: It is the beginning of the Arab retreat in the face of the Israeli settlement attack, and the days have proven that it is so, and it has torn apart Arab unity and the Arab wall as for Israel.<br />* Lieutenant General Saad Al-Shazly says about the agreement: What peace? Peace must be between two rivals and there must be a concession from both parties. But Sinai is still demilitarized, and we are not allowed to have aircraft or a military airport inside Sinai or missile air defense.",
    "responderId": 241692113,
    "source": {
      "type": "youtube",
      "reference": "https://www.youtube.com/embed/0uq_b-0Gp3Q"
    }
  },
  {
    "id": 2670977874,
    "text": "In [this](https://youtu.be/YlOtL2eULJA?si=Pw0-efDZ6nds9MHG&t=2246) video, Mehdi Hasan says:<br /><br />In 2011 in the Arab Spring, the Tunisians rose up peacefully against their dictator Ben Ali and the Egyptians rose up in Tahrir Square against Mubarak. We supported that in the West and those were referred to, in the Arabic press, as Intifada. In fact, we can go back to the uprising that we supported, Warsaw Ghetto which was by Jews standing up against the Nazis; Do you know how the US Holocaust Memorial Museum describes the Warsaw Ghetto on its Arabic page? It calls it the Warsaw Intifada, so we're not calling the Jews in Poland who stood up against the Nazis as terrorists. So no, I don't believe that Intifada in itself is a terroristic or violent phrase<br /><br />The first Intifada was largely nonviolent for the first year. Palestinians were killed at a rate of 27 times the number of Israelis that were killed. Yitzhak Rabin, do you remember Rabin, the Nobel Peace Prize winner? he said break their bones the violence came largely from the Israeli side in the first Intifada. So just to be clear that's what it means: Uprising. These students are not calling for violence. At Colombia University in New York, the police arrested 108 students many of them are Jewish. Let's talk about Jewish students. I've actually spoken to Jewish students and to Jewish professors. Columbia's Jewish professors have come out to condemn media coverage of what's going on and say this isn't anti-semitic. The Jewish professors said that these protests are not violent, they're not anti-semitic. My New Media Company, Zateo went and asked a Jewish student on campus who's part of these protests to write a piece for us and [he did](https://zeteo.com/p/i-am-a-jewish-student-at-columbia) and he said the real threat is coming not from Palestinian protesters but from the police who were assaulting and arresting Jewish students on campus.",
    "responderId": 1811331528,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/YlOtL2eULJA?si=Pw0-efDZ6nds9MHG&start=2246"
    }
  },
  {
    "id": 13349132,
    "text": "As of 17th of August, per [Al Jazeera](https://www.aljazeera.com/news/longform/2023/10/9/israel-hamas-war-in-maps-and-charts-live-tracker):<br /><br />* **Gaza**<br />  * **Killed**: at least 40,005 people, including nearly 16,500 children<br />  * **Injured**: more than 92,401 people<br />  * **Missing**: more than 10,000<br />* **Occupied West Bank**<br />  * **Killed**: at least 632 people, including more than 147 children<br />  * **Injured**: more than 5,400<br /><br />On the other side, 1,139 Israelis have been killed and 8730 have been injured.<br />",
    "responderId": 7852704,
    "source": {
      "type": null,
      "reference": null
    }
  },
  {
    "id": 3878801682,
    "text": "Mehdi Hasan mentioned in [this](https://www.youtube.com/watch?v=ho1Ahu4BdMc) video:<br /><br />**First**, for everyone who believes that Benjamin Netanyahu and his government of far-right fascists and racists are fighting their war in Gaza in order to rescue the hostages, how do they explain the fact that Netanyahu had a chance to bring all of the civilian hostages home right at the very beginning? It's [the view](https://www.timesofisrael.com/no-doubt-netanyahu-preventing-hostage-deal-charges-ex-spokesman-of-families-forum/) of Rubinstein who was a spokesman for the families of the Israeli hostages and said \"we learn that Hamas offered on October 9th or 10th to release all the captive civilians in its hands if the IDF did not enter the Gaza Strip but the government rejected the offer\". In fact, the Washington Post [reported](https://www.washingtonpost.com/world/2023/10/26/israel-gaza-war-hamas-civilians/) on a similar proposal at the end of October saying \"Hamas was proposing to release all foreign civilian hostages in exchange for a 5-day ceasefire Israeli civilian hostages would be released if additional demands were met including the release of Palestinian women and children in Israeli prisons and the opening of the Rafah border crossing\".<br /><br />**Second**, Israeli officials have said time and again that the war won't end until Hamas is destroyed regardless of whether the hostages are released. Smortich, Israel's Finance Minister, made clear that [he was opposed](https://twitter.com/kann_news/status/1785298974619861022) to any hostage release deal that stopped Israel from going into Rafah now you might say that's just smoke TR he's not in charge well prime minister Benjamin Netanyahu also said this week that he would invade Rafah with or without a deal on the hostages.<br /><br />**Third**, the hostages at the core of this conflict at the heart of this current round of killing and violence aren't just Israelis, they're Palestinians too because while we're all aware of the fact that around 250 hostages were taken from Israel by Hamas and other armed groups on October the 7th including, shamefully, children and around 130 hostages remain in captivity in Gaza we don't really mention the thousands of Palestinians who have been rounded up detained held without trial tortured sexually abused without any charges let alone any convictions in Israeli prisons and I'm not even talking about just since October the 7th I'm talking about before October the 7th.<br /><br />When the bad faith apologists for Israel pop up on TV or online to justify that violence and to robotically and cynically repeat \"what about the hostages\" ignoring all of the three things that I just pointed out to you, treat that dishonest refrain with the contempt it deserves.",
    "responderId": 1811331528,
    "source": {
      "type": "youtube",
      "reference": "https://www.youtube.com/embed/ho1Ahu4BdMc"
    }
  },
  {
    "id": 2597016667,
    "text": "George Galloway responded to that question in [this](https://youtu.be/IIHtjH6UkBk?si=8JPBx7yi-0hN8Gun&t=402) video by saying:<br /><br />It was by no means the single biggest slaughter in the Israel-Palestine chapter. In fact, in five hours, with Sharon on the roof, shining a searchlight into the Sabra and Shatila camps in Beirut. 3,850 Palestinian women and children. There were only women and children because the men had all agreed to sail away to Tunisia as part of an American broker deal. Now, younger viewers will not remember Sabra and Shatila, but those two names are burned in the minds of those older and who care about it. So that’s triple the actual death toll on October the 7th. The fact that you thought, I mean, disrespectfully, that this was the biggest single day of slaughter is part of the problem. The blood of Palestinians is oftentimes by commentators and politicians regarded as less valuable than the blood of Israelis. All the blood is a disgrace, all of it. ",
    "responderId": 3587760582,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/IIHtjH6UkBk?si=8JPBx7yi-0hN8Gun&start=402"
    }
  },
  {
    "id": 323479889,
    "text": "George Galloway answered this in [this](https://youtu.be/IIHtjH6UkBk?si=OVRLo68dTlsqyne2&t=648) video, saying:<br /><br />I was underground as an undercover agent of the [ANC](https://en.wikipedia.org/wiki/African_National_Congress). I was working for Nelson Mandela's ANC. I gave my blood on the floor of the Gugulethu police station in Cape Town. Was the ANC a terrorist organization? the answer is no, even though they had people who carried out terrorist attacks. You have to understand the whole picture and not just a tiny corner of a single snapshot. The Palestinians are fighting against an apartheid state for the millions of Palestinians scattered around the world with no one speaking up for them. If you are fighting against occupation forces undoubtedly it is resistance. It was David Cameron I remind you who called it the largest open-air prison camp in the world. If you break through that and you start taking a toll on the guards, the people who've kept you in this absolute misery with regular death being dealt to you, then that's a legitimate act of resistance.",
    "responderId": 3587760582,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/IIHtjH6UkBk?si=OVRLo68dTlsqyne2&start=648"
    }
  },
  {
    "id": 1800590558,
    "text": "George Galloway said in [this](https://youtu.be/IIHtjH6UkBk?si=8QEkLZM5QJPyRty7&t=915) video:<br /><br />On the question of \"Isn't it Hamas that started this?\", Yes, but Israel would have known that if you keep 2.3 million people in a cage, they’re going to try and break out. So there’s all kinds of concomitants should have known in this story. They should have known when they occupied Palestinian land, drove hundreds of thousands of them out, never to return, that those people would have children, and they would have children, and enmity, bitterness, and the desire for revenge would exist forever. And so it has..",
    "responderId": 3587760582,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/IIHtjH6UkBk?si=8QEkLZM5QJPyRty7&start=915"
    }
  },
  {
    "id": 4148149677,
    "text": "George Galloway mentioned in [this](https://youtu.be/IIHtjH6UkBk?si=jiEHdpI5VJAo-0_f&t=1176) video:<br /><br />The solution should be within one state it will have to be, because the two-state solution, which I supported as an Arafatist, I look foolish now, having supported the Oslo Agreement, I look like an idiot. Arafat looks like an idiot. Because we believed that there would be a two-state solution, and almost 40 years after the agreement, there's not one centimetre of Palestine free, and Gaza is in complete ruins. The West Bank is on fire. Settlers are running amok. The attempt to ethnically cleanse the West Bank and East Jerusalem is running concurrently with the slaughter in Gaza. So where are you going to put two-state solutions? There's 800,000 illegal settlers in the West Bank. They all settled there long before October the 7th.<br /><br />In 1948 the Balfour Declaration was received and co-signed by the Zionist organizations. I was literally in the building. It's a big Manchester story. Balfour himself was an MP in Manchester. The document was signed in Manchester. The reality is, when we promised, on behalf of one people, to give to a second people the land that belonged to a third people, we set off, as Churchill put it, down a descending staircase, soaked in blood. That's why when some people say, why are you so exercised by this? Because my country caused it, and my country is still involved in it. That's why I'm so exercised by it.",
    "responderId": 3587760582,
    "source": {
      "type": "youtube",
      "reference": "https://youtube.com/embed/IIHtjH6UkBk?si=jiEHdpI5VJAo-0_f&start=1176"
    }
  }
]