[
  {
    "id": 1232798458,
    "name": "Mohammed Hijab",
    "type": "person",
    "bio": "[Mohammed Hijab](https://mohammedhijab.com/) is a Philosopher of Religion and the co-founder of Sapience Institute. His debates and discussions representing the Islamic viewpoint philosophically, politically and theologically  are some of the most-viewed and engaged with in the world today.  His formal qualifications include the following:<br /><br />* PhD – University of Birmingham (Completing)<br />* MTH in Applied Theology – University of Oxford<br />* MA in Islamic Studies – SOAS University London<br />* MA in History – Queen Mary University of London<br />* BA in Politics – – Queen Mary University of London 2010 – 2013<br />* BA in Islamic Sciences – Al-Azhar (Completing)"
  },
  {
    "id": 1603959675,
    "name": "Norman Finkelstein",
    "type": "person",
    "bio": "[Norman Finkelstein](https://en.wikipedia.org/wiki/Norman_Finkelstein) is an American political scientist and activist. His primary fields of research are the Israeli–Palestinian conflict and the politics of the Holocaust. He is a graduate of Binghamton University and received his Ph.D. in political science at Princeton University."
  },
  {
    "id": 262151679,
    "name": "Kareem Dennis",
    "type": "person",
    "bio": "[Kareem Dennis](https://en.wikipedia.org/wiki/Lowkey) Lowkey is a vocal opponent of Zionism and is a patron of the Palestine Solidarity Campaign. He characterises Zionism as colonialism and ethnic cleansing.<br /><br />In February 2009, he travelled to Palestinian refugee camps around the West Bank area to perform fundraising shows to help rebuild the Gaza Strip but was detained by the Israel Police for nine hours at Ben Gurion International Airport and interrogated, while having his passport confiscated. Later in 2009, he travelled with M-1 of Dead Prez to carry out a humanitarian aid mission and bring medical aid to the Palestinian people in the Gaza Strip; this led to a collaboration between the two on Soundtrack to the Struggle. He was again detained for half a day by Israeli airport police in July 2010, en route to a number of concerts and musical workshops in refugee camps in the West Bank.<br /><br />"
  },
  {
    "id": 3883926909,
    "name": "Bassem Youssef",
    "type": "person",
    "bio": "[Bassem Youssef](https://en.wikipedia.org/wiki/Bassem_Youssef) Bassem Raafat Mohamed Youssef is an Egyptian comedian, television host, and surgeon. He is best-known in his media career for having hosted Al Bernameg, a satirical comedy show focused on Egyptian politics, from 2011 to 2014.<br /><br />On October 17, 2023, Youssef drew media attention after engaging in a virtual [interview](https://www.youtube.com/watch?v=4idQbwsvtUo) on Piers Morgan's show: Uncensored."
  },
  {
    "id": 1943801793,
    "name": "Husam Zomlot",
    "type": "person",
    "bio": "[Husam Zomlot](https://en.wikipedia.org/wiki/Husam_Zomlot/) is a Palestinian diplomat, academic and economist. He was appointed Head of the Palestinian Mission to the United Kingdom in October 2018. Before his posting to the UK, he served as head of the PLO mission to the United States that was closed by President Donald Trump's administration."
  },
  {
    "id": 2705686142,
    "name": "Vox Media",
    "type": "person",
    "bio": "[Vox Media](https://www.youtube.com/@Vox), Inc. is an American mass media company founded in Washington, D.C. and with operational headquarters in Lower Manhattan, New York City."
  },
  {
    "id": 681380190,
    "name": "Briahna Joy Gray",
    "type": "person",
    "bio": "[Briahna Joy Gray](https://en.wikipedia.org/wiki/Briahna_Joy_Gray) is an American political commentator, lawyer, and political consultant who served as the National Press Secretary for the Bernie Sanders 2020 presidential campaign. Gray is a contributing editor for Current Affairs, and was a senior politics editor for The Intercept. She hosts her own podcast, Bad Faith, and co-hosts The Hill's web series Rising."
  },
  {
    "id": 1811331528,
    "name": "Mehdi Hasan",
    "type": "person",
    "bio": "[Mehdi Raza Hasan](https://en.wikipedia.org/wiki/Mehdi_Hasan) is a British-American broadcaster and best-selling author of Indian descent. He has presented The Mehdi Hasan Show on Peacock since October 2020 and on MSNBC since February 2021.<br /><br />A graduate of Christ Church, Oxford, Hasan began his television career as a researcher and then producer on ITV's Jonathan Dimbleby programme. Following a stint on the BBC's The Politics Show he became deputy executive producer on Sky's breakfast show Sunrise before moving to Channel 4 as their editor of news and current affairs. In 2009 he was appointed senior editor for politics at the New Statesman. In 2012 he became a presenter on Al Jazeera's English news channel, and in 2015 moved to Washington, D.C. to work full-time for Al Jazeera on UpFrontand host the Deconstructed podcast produced by the online publication The Intercept from 2018 to 2020.<br />"
  },
  {
    "id": 2270142857,
    "name": "Amnesty International",
    "type": "organization",
    "bio": "[Amnesty International](https://en.wikipedia.org/wiki/Amnesty_International) (also referred to as Amnesty or AI) is an international non-governmental organisation focused on human rights, with its headquarters in the United Kingdom. <br /><br />In February 2022, Amnesty [accused](https://www.amnesty.org/en/documents/mde15/5141/2022/en/) Israel of committing the crime of apartheid against the Palestinians, joining other human rights organizations that had previously accused Israel of the crime against humanity. In 2021, Human Rights Watch and B'tselem both accused Israel of apartheid for its treatment of the Palestinians in the occupied territories."
  },
  {
    "id": 7852704,
    "name": "Al Jazeera",
    "type": "organization",
    "bio": "[Al Jazeera](https://en.wikipedia.org/wiki/Al_Jazeera) (also referred to as Amnesty or AI) is a Qatari state-media conglomerate headquartered at Qatar Radio and Television Corporation Complex in Wadi Al Sail, Doha."
  },
  {
    "id": 127173960,
    "name": "Yanis Varoufakis",
    "type": "person",
    "bio": "[Ioannis Georgiou \"Yanis\" Varoufakis](https://en.wikipedia.org/wiki/Yanis_Varoufakis)  is a Greek economist and politician. Since 2018, he has been Secretary-General of Democracy in Europe Movement 2025 (DiEM25), a left-wing pan-European political party he co-founded in 2016. Previously, he was a member of Syriza and was Greece's Minister of Finance between January 2015 and July 2015, negotiating on behalf of the Greek government during the 2009-2018 Greek government-debt crisis."
  },
  {
    "id": 2926155375,
    "name": "Middle East Monitor",
    "type": "organization",
    "bio": "[Middle East Monitor](https://en.wikipedia.org/wiki/Middle_East_Monitor) is a not-for-profit press monitoring organisation<br /> and lobbying group that emerged in mid 2009. MEMO is largely focused on the Israeli–Palestinian conflict, but writes about other issues in the Middle East as well."
  },
  {
    "id": 1763891674,
    "name": "Zachary Foster",
    "type": "person",
    "bio": "[Zachary Foster](https://twitter.com/_ZachFoster) is a historian of Palestine with a Ph.D. from Princeton University."
  },
  {
    "id": 3918263088,
    "name": "Palestine in Conversation",
    "type": "community",
    "bio": "Palestine in Conversation is an Instagram [account](https://www.instagram.com/palestineinconversation) whose creators have created the Palestine: in Conversation [document](https://docs.google.com/document/d/1OVKqgxQDOfFjy5h6KXgbKkHTFRPvRT79LFOcAao-imA/edit?pli=1).<br /><br />The authors mention in the document that this document was crafted by first generation Lebanese diaspora in Australia (Naarm & Eora) on stolen land. We stand in solidarity with Aboriginal and First Nations people in their fight for self-determination and justice."
  },
  {
    "id": 4187020424,
    "name": "Omar Suleiman",
    "type": "person",
    "bio": "**[Imam Omar Suleiman](https://yaqeeninstitute.org/team/omar-suleiman) is the Founder and President of the Yaqeen Institute for Islamic Research and an Adjunct Professor of Islamic Studies in the Graduate Liberal Studies Program at SMU (Southern Methodist University). Suleiman was born to a Palestinian family in New Orleans in 1986."
  },
  {
    "id": 317080511,
    "name": "Abdel-Wahab El-Messiri",
    "type": "person",
    "bio": "**[Dr. Abdel Wahab El-Messiri](https://www.elmessiri.com/cv.php) (October 1938 - July 3, 2008), an Egyptian Muslim thinker and sociologist, is the author of the Encyclopedia of Jews, Judaism and Zionism, one of the largest Arab encyclopedic works of the twentieth century. Through which he was able, in the opinion of some, to give a new, encyclopedic, objective, scientific view of the Jewish phenomenon in particular, and the experience of Western modernity in general, using what he developed during his academic life in terms of developing the concept of explanatory models. However, in the opinion of others, his vision in his encyclopedia was biased towards the Jews, and sympathetic to an extent. Great with their attitudes towards non-Jews, and some even described it as defending Jews.<br /><br />* Bachelor of Arts - English Literature - Alexandria University (1959).\r<br />* Master’s degree in English and Comparative Literature - Columbia University - USA (1964).\r<br />* Doctorate in English, American, and Comparative Literature - Rutgers University - United States of America (1969).\r<br />* Head of the Zionist Thought Unit and Member of the Council of Experts at the Center for Political and Strategic Studies in Al-Ahram (1970-1975).\r<br />* Cultural Advisor to the Permanent Delegation of the League of Arab States to the United Nations in New York (1975-1979).\r<br />* Professor of English and Comparative Literature - Ain Shams University (1979-1983).\r<br />* and more ... check [wikipedia](https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D9%8A%D8%B1%D9%8A)."
  },
  {
    "id": 66002164,
    "name": "Mustafa Barghouti",
    "type": "person",
    "bio": "**[Mustafa Barghouti](https://en.wikipedia.org/wiki/Mustafa_Barghouti) is a Palestinian physician, activist, and politician who serves as General Secretary of the Palestinian National Initiative (PNI), also known as al Mubadara. He has been a member of the Palestinian Legislative Council since 2006 and is also a member of the Palestine Liberation Organization (PLO) Central Council. In 2007, Barghouti was Minister of Information in the Palestinian unity government."
  },
  {
    "id": 2737087625,
    "name": "Mokhbir Eqtisadi",
    "type": "person",
    "bio": "**[Mokhbir Eqtisadi](https://www.youtube.com/channel/UC4kRorAXuIkyIX6vwXKaLWg) is one of the biggest Arabic youtube channels that are specialized in educating viewers about economics."
  },
  {
    "id": 563133960,
    "name": "Noam Chomsky",
    "type": "person",
    "bio": "**[Noam Chomsky](https://en.wikipedia.org/wiki/Noam_Chomsky) is an American professor and public intellectual known for his work in linguistics, political activism, and social criticism. Chomsky considers Israel's treatment of Palestinians to be worse than South African-style apartheid, and criticizes U.S. support for Israel. Chomsky remains a leading critic of U.S. foreign policy, contemporary capitalism, U.S. involvement and Israel's role in the Israeli–Palestinian conflict, and mass media."
  },
  {
    "id": 779693087,
    "name": "Edward Said",
    "type": "person",
    "bio": "**[Professor Edward Said](https://en.wikipedia.org/wiki/Edward_Said) was a Palestinian-American academic, literary critic and political activist. As a public intellectual, Said was a member of the Palestinian National Council supporting a two-state solution that incorporated the Palestinian right of return, before resigning in 1993 due to his criticism of the Oslo Accords."
  },
  {
    "id": 241692113,
    "name": "Ahmed Mansour",
    "type": "person",
    "bio": "[Ahmed Mansour](https://ahmedmansour.com) is an Egyptian broadcaster, journalist, and producer who works on the Al Jazeera satellite channel. He is a former editor-in-chief of the Kuwaiti society magazine. He holds Egyptian and British citizenship."
  },
  {
    "id": 3587760582,
    "name": "George Galloway",
    "type": "person",
    "bio": "George Galloway (born 16 August 1954) is a British politician, broadcaster, and writer. He has been leader of the Workers Party of Britain since he founded it in 2019, and was a former leader of the Respect Party. Until 2003, he was a member of the Labour Party. From 1987 to 2010, and from 2012 to 2015, Galloway served as a Member of Parliament (MP) for five constituencies, most recently for Rochdale briefly in 2024.<br /><br />Galloway is a staunch critic of Israel and of Zionism. He regards Israel as an apartheid state committing genocide against Palestinians. In 2013, he said, \"I don't recognise Israel and I don't debate with Israelis\". The following year, he declared Bradford an \"Israel-free zone\"."
  },
  {
    "id": 1817907232,
    "name": "Osama Hamdan",
    "type": "person",
    "bio": "Osama Hamdan is a former senior representative of Hamas in Lebanon and Tehran. He previously held the position of Head of International Relations Department for Hamas and Chair of the Political Committee of the Palestinian Legislative Council."
  },
  {
    "id": 1917907232,
    "name": "Community Members",
    "type": "community",
    "bio": "The answers posted with this name are answers that the curators of the website received from the community members. You can help us by submitting answers directly on GitHub (preferably with sources referenced)."
  }
]